package com.mn.modules.api.remote.impl;

import com.alibaba.fastjson.JSONArray;
import com.alibaba.fastjson.JSONObject;
import com.mn.modules.api.entity.GeographyPoint;

public class AdcodeData {

    static String adcodeJson = "{\n" +
            "  \"province\": [\n" +
            "    {\"key\": 100000, \"label\": \"全国\"},\n" +
            "    {\"key\": 110000, \"label\": \"北京市\"},\n" +
            "    {\"key\": 120000, \"label\": \"天津市\"},\n" +
            "    {\"key\": 130000, \"label\": \"河北省\"},\n" +
            "    {\"key\": 140000, \"label\": \"山西省\"},\n" +
            "    {\"key\": 150000, \"label\": \"内蒙古自治区\"},\n" +
            "    {\"key\": 210000, \"label\": \"辽宁省\"},\n" +
            "    {\"key\": 220000, \"label\": \"吉林省\"},\n" +
            "    {\"key\": 230000, \"label\": \"黑龙江省\"},\n" +
            "    {\"key\": 310000, \"label\": \"上海市\"},\n" +
            "    {\"key\": 320000, \"label\": \"江苏省\"},\n" +
            "    {\"key\": 330000, \"label\": \"浙江省\"},\n" +
            "    {\"key\": 340000, \"label\": \"安徽省\"},\n" +
            "    {\"key\": 350000, \"label\": \"福建省\"},\n" +
            "    {\"key\": 360000, \"label\": \"江西省\"},\n" +
            "    {\"key\": 370000, \"label\": \"山东省\"},\n" +
            "    {\"key\": 410000, \"label\": \"河南省\"},\n" +
            "    {\"key\": 420000, \"label\": \"湖北省\"},\n" +
            "    {\"key\": 430000, \"label\": \"湖南省\"},\n" +
            "    {\"key\": 440000, \"label\": \"广东省\"},\n" +
            "    {\"key\": 450000, \"label\": \"广西壮族自治区\"},\n" +
            "    {\"key\": 460000, \"label\": \"海南省\"},\n" +
            "    {\"key\": 500000, \"label\": \"重庆市\"},\n" +
            "    {\"key\": 510000, \"label\": \"四川省\"},\n" +
            "    {\"key\": 520000, \"label\": \"贵州省\"},\n" +
            "    {\"key\": 530000, \"label\": \"云南省\"},\n" +
            "    {\"key\": 540000, \"label\": \"西藏自治区\"},\n" +
            "    {\"key\": 610000, \"label\": \"陕西省\"},\n" +
            "    {\"key\": 620000, \"label\": \"甘肃省\"},\n" +
            "    {\"key\": 630000, \"label\": \"青海省\"},\n" +
            "    {\"key\": 640000, \"label\": \"宁夏回族自治区\"},\n" +
            "    {\"key\": 650000, \"label\": \"新疆维吾尔自治区\"},\n" +
            "    {\"key\": 710000, \"label\": \"台湾省\"},\n" +
            "    {\"key\": 810000, \"label\": \"香港特别行政区\"},\n" +
            "    {\"key\": 820000, \"label\": \"澳门特别行政区\"}\n" +
            "  ],\n" +
            "  \"city\": {\n" +
            "    \"110000\": [{\"key\": 110100, \"label\": \"北京市市辖区\"}],\n" +
            "    \"120000\": [{\"key\": 120100, \"label\": \"天津市市辖区\"}],\n" +
            "    \"130000\": [\n" +
            "      {\"key\": 130100, \"label\": \"石家庄市\"},\n" +
            "      {\"key\": 130200, \"label\": \"唐山市\"},\n" +
            "      {\"key\": 130300, \"label\": \"秦皇岛市\"},\n" +
            "      {\"key\": 130400, \"label\": \"邯郸市\"},\n" +
            "      {\"key\": 130500, \"label\": \"邢台市\"},\n" +
            "      {\"key\": 130600, \"label\": \"保定市\"},\n" +
            "      {\"key\": 130700, \"label\": \"张家口市\"},\n" +
            "      {\"key\": 130800, \"label\": \"承德市\"},\n" +
            "      {\"key\": 130900, \"label\": \"沧州市\"},\n" +
            "      {\"key\": 131000, \"label\": \"廊坊市\"},\n" +
            "      {\"key\": 131100, \"label\": \"衡水市\"}\n" +
            "    ],\n" +
            "    \"140000\": [\n" +
            "      {\"key\": 140100, \"label\": \"太原市\"},\n" +
            "      {\"key\": 140200, \"label\": \"大同市\"},\n" +
            "      {\"key\": 140300, \"label\": \"阳泉市\"},\n" +
            "      {\"key\": 140400, \"label\": \"长治市\"},\n" +
            "      {\"key\": 140500, \"label\": \"晋城市\"},\n" +
            "      {\"key\": 140600, \"label\": \"朔州市\"},\n" +
            "      {\"key\": 140700, \"label\": \"晋中市\"},\n" +
            "      {\"key\": 140800, \"label\": \"运城市\"},\n" +
            "      {\"key\": 140900, \"label\": \"忻州市\"},\n" +
            "      {\"key\": 141000, \"label\": \"临汾市\"},\n" +
            "      {\"key\": 141100, \"label\": \"吕梁市\"}\n" +
            "    ],\n" +
            "    \"150000\": [\n" +
            "      {\"key\": 150100, \"label\": \"呼和浩特市\"},\n" +
            "      {\"key\": 150200, \"label\": \"包头市\"},\n" +
            "      {\"key\": 150300, \"label\": \"乌海市\"},\n" +
            "      {\"key\": 150400, \"label\": \"赤峰市\"},\n" +
            "      {\"key\": 150500, \"label\": \"通辽市\"},\n" +
            "      {\"key\": 150600, \"label\": \"鄂尔多斯市\"},\n" +
            "      {\"key\": 150700, \"label\": \"呼伦贝尔市\"},\n" +
            "      {\"key\": 150800, \"label\": \"巴彦淖尔市\"},\n" +
            "      {\"key\": 150900, \"label\": \"乌兰察布市\"},\n" +
            "      {\"key\": 152200, \"label\": \"兴安盟\"},\n" +
            "      {\"key\": 152500, \"label\": \"锡林郭勒盟\"},\n" +
            "      {\"key\": 152900, \"label\": \"阿拉善盟\"}\n" +
            "    ],\n" +
            "    \"210000\": [\n" +
            "      {\"key\": 210100, \"label\": \"沈阳市\"},\n" +
            "      {\"key\": 210200, \"label\": \"大连市\"},\n" +
            "      {\"key\": 210300, \"label\": \"鞍山市\"},\n" +
            "      {\"key\": 210400, \"label\": \"抚顺市\"},\n" +
            "      {\"key\": 210500, \"label\": \"本溪市\"},\n" +
            "      {\"key\": 210600, \"label\": \"丹东市\"},\n" +
            "      {\"key\": 210700, \"label\": \"锦州市\"},\n" +
            "      {\"key\": 210800, \"label\": \"营口市\"},\n" +
            "      {\"key\": 210900, \"label\": \"阜新市\"},\n" +
            "      {\"key\": 211000, \"label\": \"辽阳市\"},\n" +
            "      {\"key\": 211100, \"label\": \"盘锦市\"},\n" +
            "      {\"key\": 211200, \"label\": \"铁岭市\"},\n" +
            "      {\"key\": 211300, \"label\": \"朝阳市\"},\n" +
            "      {\"key\": 211400, \"label\": \"葫芦岛市\"}\n" +
            "    ],\n" +
            "    \"220000\": [\n" +
            "      {\"key\": 220100, \"label\": \"长春市\"},\n" +
            "      {\"key\": 220200, \"label\": \"吉林市\"},\n" +
            "      {\"key\": 220300, \"label\": \"四平市\"},\n" +
            "      {\"key\": 220400, \"label\": \"辽源市\"},\n" +
            "      {\"key\": 220500, \"label\": \"通化市\"},\n" +
            "      {\"key\": 220600, \"label\": \"白山市\"},\n" +
            "      {\"key\": 220700, \"label\": \"松原市\"},\n" +
            "      {\"key\": 220800, \"label\": \"白城市\"},\n" +
            "      {\"key\": 222400, \"label\": \"延边朝鲜族自治州\"}\n" +
            "    ],\n" +
            "    \"230000\": [\n" +
            "      {\"key\": 230100, \"label\": \"哈尔滨市\"},\n" +
            "      {\"key\": 230200, \"label\": \"齐齐哈尔市\"},\n" +
            "      {\"key\": 230300, \"label\": \"鸡西市\"},\n" +
            "      {\"key\": 230400, \"label\": \"鹤岗市\"},\n" +
            "      {\"key\": 230500, \"label\": \"双鸭山市\"},\n" +
            "      {\"key\": 230600, \"label\": \"大庆市\"},\n" +
            "      {\"key\": 230700, \"label\": \"伊春市\"},\n" +
            "      {\"key\": 230800, \"label\": \"佳木斯市\"},\n" +
            "      {\"key\": 230900, \"label\": \"七台河市\"},\n" +
            "      {\"key\": 231000, \"label\": \"牡丹江市\"},\n" +
            "      {\"key\": 231100, \"label\": \"黑河市\"},\n" +
            "      {\"key\": 231200, \"label\": \"绥化市\"},\n" +
            "      {\"key\": 232700, \"label\": \"大兴安岭地区\"}\n" +
            "    ],\n" +
            "    \"310000\": [{\"key\": 310100, \"label\": \"上海市市辖区\"}],\n" +
            "    \"320000\": [\n" +
            "      {\"key\": 320100, \"label\": \"南京市\"},\n" +
            "      {\"key\": 320200, \"label\": \"无锡市\"},\n" +
            "      {\"key\": 320300, \"label\": \"徐州市\"},\n" +
            "      {\"key\": 320400, \"label\": \"常州市\"},\n" +
            "      {\"key\": 320500, \"label\": \"苏州市\"},\n" +
            "      {\"key\": 320600, \"label\": \"南通市\"},\n" +
            "      {\"key\": 320700, \"label\": \"连云港市\"},\n" +
            "      {\"key\": 320800, \"label\": \"淮安市\"},\n" +
            "      {\"key\": 320900, \"label\": \"盐城市\"},\n" +
            "      {\"key\": 321000, \"label\": \"扬州市\"},\n" +
            "      {\"key\": 321100, \"label\": \"镇江市\"},\n" +
            "      {\"key\": 321200, \"label\": \"泰州市\"},\n" +
            "      {\"key\": 321300, \"label\": \"宿迁市\"}\n" +
            "    ],\n" +
            "    \"330000\": [\n" +
            "      {\"key\": 330100, \"label\": \"杭州市\"},\n" +
            "      {\"key\": 330200, \"label\": \"宁波市\"},\n" +
            "      {\"key\": 330300, \"label\": \"温州市\"},\n" +
            "      {\"key\": 330400, \"label\": \"嘉兴市\"},\n" +
            "      {\"key\": 330500, \"label\": \"湖州市\"},\n" +
            "      {\"key\": 330600, \"label\": \"绍兴市\"},\n" +
            "      {\"key\": 330700, \"label\": \"金华市\"},\n" +
            "      {\"key\": 330800, \"label\": \"衢州市\"},\n" +
            "      {\"key\": 330900, \"label\": \"舟山市\"},\n" +
            "      {\"key\": 331000, \"label\": \"台州市\"},\n" +
            "      {\"key\": 331100, \"label\": \"丽水市\"}\n" +
            "    ],\n" +
            "    \"340000\": [\n" +
            "      {\"key\": 340100, \"label\": \"合肥市\"},\n" +
            "      {\"key\": 340200, \"label\": \"芜湖市\"},\n" +
            "      {\"key\": 340300, \"label\": \"蚌埠市\"},\n" +
            "      {\"key\": 340400, \"label\": \"淮南市\"},\n" +
            "      {\"key\": 340500, \"label\": \"马鞍山市\"},\n" +
            "      {\"key\": 340600, \"label\": \"淮北市\"},\n" +
            "      {\"key\": 340700, \"label\": \"铜陵市\"},\n" +
            "      {\"key\": 340800, \"label\": \"安庆市\"},\n" +
            "      {\"key\": 341000, \"label\": \"黄山市\"},\n" +
            "      {\"key\": 341100, \"label\": \"滁州市\"},\n" +
            "      {\"key\": 341200, \"label\": \"阜阳市\"},\n" +
            "      {\"key\": 341300, \"label\": \"宿州市\"},\n" +
            "      {\"key\": 341500, \"label\": \"六安市\"},\n" +
            "      {\"key\": 341600, \"label\": \"亳州市\"},\n" +
            "      {\"key\": 341700, \"label\": \"池州市\"},\n" +
            "      {\"key\": 341800, \"label\": \"宣城市\"}\n" +
            "    ],\n" +
            "    \"350000\": [\n" +
            "      {\"key\": 350100, \"label\": \"福州市\"},\n" +
            "      {\"key\": 350200, \"label\": \"厦门市\"},\n" +
            "      {\"key\": 350300, \"label\": \"莆田市\"},\n" +
            "      {\"key\": 350400, \"label\": \"三明市\"},\n" +
            "      {\"key\": 350500, \"label\": \"泉州市\"},\n" +
            "      {\"key\": 350600, \"label\": \"漳州市\"},\n" +
            "      {\"key\": 350700, \"label\": \"南平市\"},\n" +
            "      {\"key\": 350800, \"label\": \"龙岩市\"},\n" +
            "      {\"key\": 350900, \"label\": \"宁德市\"}\n" +
            "    ],\n" +
            "    \"360000\": [\n" +
            "      {\"key\": 360100, \"label\": \"南昌市\"},\n" +
            "      {\"key\": 360200, \"label\": \"景德镇市\"},\n" +
            "      {\"key\": 360300, \"label\": \"萍乡市\"},\n" +
            "      {\"key\": 360400, \"label\": \"九江市\"},\n" +
            "      {\"key\": 360500, \"label\": \"新余市\"},\n" +
            "      {\"key\": 360600, \"label\": \"鹰潭市\"},\n" +
            "      {\"key\": 360700, \"label\": \"赣州市\"},\n" +
            "      {\"key\": 360800, \"label\": \"吉安市\"},\n" +
            "      {\"key\": 360900, \"label\": \"宜春市\"},\n" +
            "      {\"key\": 361000, \"label\": \"抚州市\"},\n" +
            "      {\"key\": 361100, \"label\": \"上饶市\"}\n" +
            "    ],\n" +
            "    \"370000\": [\n" +
            "      {\"key\": 370100, \"label\": \"济南市\"},\n" +
            "      {\"key\": 370200, \"label\": \"青岛市\"},\n" +
            "      {\"key\": 370300, \"label\": \"淄博市\"},\n" +
            "      {\"key\": 370400, \"label\": \"枣庄市\"},\n" +
            "      {\"key\": 370500, \"label\": \"东营市\"},\n" +
            "      {\"key\": 370600, \"label\": \"烟台市\"},\n" +
            "      {\"key\": 370700, \"label\": \"潍坊市\"},\n" +
            "      {\"key\": 370800, \"label\": \"济宁市\"},\n" +
            "      {\"key\": 370900, \"label\": \"泰安市\"},\n" +
            "      {\"key\": 371000, \"label\": \"威海市\"},\n" +
            "      {\"key\": 371100, \"label\": \"日照市\"},\n" +
            "      {\"key\": 371300, \"label\": \"临沂市\"},\n" +
            "      {\"key\": 371400, \"label\": \"德州市\"},\n" +
            "      {\"key\": 371500, \"label\": \"聊城市\"},\n" +
            "      {\"key\": 371600, \"label\": \"滨州市\"},\n" +
            "      {\"key\": 371700, \"label\": \"菏泽市\"}\n" +
            "    ],\n" +
            "    \"410000\": [\n" +
            "      {\"key\": 410100, \"label\": \"郑州市\"},\n" +
            "      {\"key\": 410200, \"label\": \"开封市\"},\n" +
            "      {\"key\": 410300, \"label\": \"洛阳市\"},\n" +
            "      {\"key\": 410400, \"label\": \"平顶山市\"},\n" +
            "      {\"key\": 410500, \"label\": \"安阳市\"},\n" +
            "      {\"key\": 410600, \"label\": \"鹤壁市\"},\n" +
            "      {\"key\": 410700, \"label\": \"新乡市\"},\n" +
            "      {\"key\": 410800, \"label\": \"焦作市\"},\n" +
            "      {\"key\": 410900, \"label\": \"濮阳市\"},\n" +
            "      {\"key\": 411000, \"label\": \"许昌市\"},\n" +
            "      {\"key\": 411100, \"label\": \"漯河市\"},\n" +
            "      {\"key\": 411200, \"label\": \"三门峡市\"},\n" +
            "      {\"key\": 411300, \"label\": \"南阳市\"},\n" +
            "      {\"key\": 411400, \"label\": \"商丘市\"},\n" +
            "      {\"key\": 411500, \"label\": \"信阳市\"},\n" +
            "      {\"key\": 411600, \"label\": \"周口市\"},\n" +
            "      {\"key\": 411700, \"label\": \"驻马店市\"}\n" +
            "    ],\n" +
            "    \"420000\": [\n" +
            "      {\"key\": 420100, \"label\": \"武汉市\"},\n" +
            "      {\"key\": 420200, \"label\": \"黄石市\"},\n" +
            "      {\"key\": 420300, \"label\": \"十堰市\"},\n" +
            "      {\"key\": 420500, \"label\": \"宜昌市\"},\n" +
            "      {\"key\": 420600, \"label\": \"襄阳市\"},\n" +
            "      {\"key\": 420700, \"label\": \"鄂州市\"},\n" +
            "      {\"key\": 420800, \"label\": \"荆门市\"},\n" +
            "      {\"key\": 420900, \"label\": \"孝感市\"},\n" +
            "      {\"key\": 421000, \"label\": \"荆州市\"},\n" +
            "      {\"key\": 421100, \"label\": \"黄冈市\"},\n" +
            "      {\"key\": 421200, \"label\": \"咸宁市\"},\n" +
            "      {\"key\": 421300, \"label\": \"随州市\"},\n" +
            "      {\"key\": 422800, \"label\": \"恩施土家族苗族自治州\"}\n" +
            "    ],\n" +
            "    \"430000\": [\n" +
            "      {\"key\": 430100, \"label\": \"长沙市\"},\n" +
            "      {\"key\": 430200, \"label\": \"株洲市\"},\n" +
            "      {\"key\": 430300, \"label\": \"湘潭市\"},\n" +
            "      {\"key\": 430400, \"label\": \"衡阳市\"},\n" +
            "      {\"key\": 430500, \"label\": \"邵阳市\"},\n" +
            "      {\"key\": 430600, \"label\": \"岳阳市\"},\n" +
            "      {\"key\": 430700, \"label\": \"常德市\"},\n" +
            "      {\"key\": 430800, \"label\": \"张家界市\"},\n" +
            "      {\"key\": 430900, \"label\": \"益阳市\"},\n" +
            "      {\"key\": 431000, \"label\": \"郴州市\"},\n" +
            "      {\"key\": 431100, \"label\": \"永州市\"},\n" +
            "      {\"key\": 431200, \"label\": \"怀化市\"},\n" +
            "      {\"key\": 431300, \"label\": \"娄底市\"},\n" +
            "      {\"key\": 433100, \"label\": \"湘西土家族苗族自治州\"}\n" +
            "    ],\n" +
            "    \"440000\": [\n" +
            "      {\"key\": 440100, \"label\": \"广州市\"},\n" +
            "      {\"key\": 440200, \"label\": \"韶关市\"},\n" +
            "      {\"key\": 440300, \"label\": \"深圳市\"},\n" +
            "      {\"key\": 440400, \"label\": \"珠海市\"},\n" +
            "      {\"key\": 440500, \"label\": \"汕头市\"},\n" +
            "      {\"key\": 440600, \"label\": \"佛山市\"},\n" +
            "      {\"key\": 440700, \"label\": \"江门市\"},\n" +
            "      {\"key\": 440800, \"label\": \"湛江市\"},\n" +
            "      {\"key\": 440900, \"label\": \"茂名市\"},\n" +
            "      {\"key\": 441200, \"label\": \"肇庆市\"},\n" +
            "      {\"key\": 441300, \"label\": \"惠州市\"},\n" +
            "      {\"key\": 441400, \"label\": \"梅州市\"},\n" +
            "      {\"key\": 441500, \"label\": \"汕尾市\"},\n" +
            "      {\"key\": 441600, \"label\": \"河源市\"},\n" +
            "      {\"key\": 441700, \"label\": \"阳江市\"},\n" +
            "      {\"key\": 441800, \"label\": \"清远市\"},\n" +
            "      {\"key\": 441900, \"label\": \"东莞市\"},\n" +
            "      {\"key\": 442000, \"label\": \"中山市\"},\n" +
            "      {\"key\": 445100, \"label\": \"潮州市\"},\n" +
            "      {\"key\": 445200, \"label\": \"揭阳市\"},\n" +
            "      {\"key\": 445300, \"label\": \"云浮市\"}\n" +
            "    ],\n" +
            "    \"450000\": [\n" +
            "      {\"key\": 450100, \"label\": \"南宁市\"},\n" +
            "      {\"key\": 450200, \"label\": \"柳州市\"},\n" +
            "      {\"key\": 450300, \"label\": \"桂林市\"},\n" +
            "      {\"key\": 450400, \"label\": \"梧州市\"},\n" +
            "      {\"key\": 450500, \"label\": \"北海市\"},\n" +
            "      {\"key\": 450600, \"label\": \"防城港市\"},\n" +
            "      {\"key\": 450700, \"label\": \"钦州市\"},\n" +
            "      {\"key\": 450800, \"label\": \"贵港市\"},\n" +
            "      {\"key\": 450900, \"label\": \"玉林市\"},\n" +
            "      {\"key\": 451000, \"label\": \"百色市\"},\n" +
            "      {\"key\": 451100, \"label\": \"贺州市\"},\n" +
            "      {\"key\": 451200, \"label\": \"河池市\"},\n" +
            "      {\"key\": 451300, \"label\": \"来宾市\"},\n" +
            "      {\"key\": 451400, \"label\": \"崇左市\"}\n" +
            "    ],\n" +
            "    \"460000\": [\n" +
            "      {\"key\": 460100, \"label\": \"海口市\"},\n" +
            "      {\"key\": 460200, \"label\": \"三亚市\"},\n" +
            "      {\"key\": 460300, \"label\": \"三沙市\"},\n" +
            "      {\"key\": 460400, \"label\": \"儋州市\"}\n" +
            "    ],\n" +
            "    \"500000\": [{\"key\": 500100, \"label\": \"重庆市市辖区\"}, {\"key\": 500200, \"label\": \"重庆市郊县\"}],\n" +
            "    \"510000\": [\n" +
            "      {\"key\": 510100, \"label\": \"成都市\"},\n" +
            "      {\"key\": 510300, \"label\": \"自贡市\"},\n" +
            "      {\"key\": 510400, \"label\": \"攀枝花市\"},\n" +
            "      {\"key\": 510500, \"label\": \"泸州市\"},\n" +
            "      {\"key\": 510600, \"label\": \"德阳市\"},\n" +
            "      {\"key\": 510700, \"label\": \"绵阳市\"},\n" +
            "      {\"key\": 510800, \"label\": \"广元市\"},\n" +
            "      {\"key\": 510900, \"label\": \"遂宁市\"},\n" +
            "      {\"key\": 511000, \"label\": \"内江市\"},\n" +
            "      {\"key\": 511100, \"label\": \"乐山市\"},\n" +
            "      {\"key\": 511300, \"label\": \"南充市\"},\n" +
            "      {\"key\": 511400, \"label\": \"眉山市\"},\n" +
            "      {\"key\": 511500, \"label\": \"宜宾市\"},\n" +
            "      {\"key\": 511600, \"label\": \"广安市\"},\n" +
            "      {\"key\": 511700, \"label\": \"达州市\"},\n" +
            "      {\"key\": 511800, \"label\": \"雅安市\"},\n" +
            "      {\"key\": 511900, \"label\": \"巴中市\"},\n" +
            "      {\"key\": 512000, \"label\": \"资阳市\"},\n" +
            "      {\"key\": 513200, \"label\": \"阿坝藏族羌族自治州\"},\n" +
            "      {\"key\": 513300, \"label\": \"甘孜藏族自治州\"},\n" +
            "      {\"key\": 513400, \"label\": \"凉山彝族自治州\"}\n" +
            "    ],\n" +
            "    \"520000\": [\n" +
            "      {\"key\": 520100, \"label\": \"贵阳市\"},\n" +
            "      {\"key\": 520200, \"label\": \"六盘水市\"},\n" +
            "      {\"key\": 520300, \"label\": \"遵义市\"},\n" +
            "      {\"key\": 520400, \"label\": \"安顺市\"},\n" +
            "      {\"key\": 520500, \"label\": \"毕节市\"},\n" +
            "      {\"key\": 520600, \"label\": \"铜仁市\"},\n" +
            "      {\"key\": 522300, \"label\": \"黔西南布依族苗族自治州\"},\n" +
            "      {\"key\": 522600, \"label\": \"黔东南苗族侗族自治州\"},\n" +
            "      {\"key\": 522700, \"label\": \"黔南布依族苗族自治州\"}\n" +
            "    ],\n" +
            "    \"530000\": [\n" +
            "      {\"key\": 530100, \"label\": \"昆明市\"},\n" +
            "      {\"key\": 530300, \"label\": \"曲靖市\"},\n" +
            "      {\"key\": 530400, \"label\": \"玉溪市\"},\n" +
            "      {\"key\": 530500, \"label\": \"保山市\"},\n" +
            "      {\"key\": 530600, \"label\": \"昭通市\"},\n" +
            "      {\"key\": 530700, \"label\": \"丽江市\"},\n" +
            "      {\"key\": 530800, \"label\": \"普洱市\"},\n" +
            "      {\"key\": 530900, \"label\": \"临沧市\"},\n" +
            "      {\"key\": 532300, \"label\": \"楚雄彝族自治州\"},\n" +
            "      {\"key\": 532500, \"label\": \"红河哈尼族彝族自治州\"},\n" +
            "      {\"key\": 532600, \"label\": \"文山壮族苗族自治州\"},\n" +
            "      {\"key\": 532800, \"label\": \"西双版纳傣族自治州\"},\n" +
            "      {\"key\": 532900, \"label\": \"大理白族自治州\"},\n" +
            "      {\"key\": 533100, \"label\": \"德宏傣族景颇族自治州\"},\n" +
            "      {\"key\": 533300, \"label\": \"怒江傈僳族自治州\"},\n" +
            "      {\"key\": 533400, \"label\": \"迪庆藏族自治州\"}\n" +
            "    ],\n" +
            "    \"540000\": [\n" +
            "      {\"key\": 540100, \"label\": \"拉萨市\"},\n" +
            "      {\"key\": 540200, \"label\": \"日喀则市\"},\n" +
            "      {\"key\": 540300, \"label\": \"昌都市\"},\n" +
            "      {\"key\": 540400, \"label\": \"林芝市\"},\n" +
            "      {\"key\": 540500, \"label\": \"山南市\"},\n" +
            "      {\"key\": 540600, \"label\": \"那曲市\"},\n" +
            "      {\"key\": 542500, \"label\": \"阿里地区\"}\n" +
            "    ],\n" +
            "    \"610000\": [\n" +
            "      {\"key\": 610100, \"label\": \"西安市\"},\n" +
            "      {\"key\": 610200, \"label\": \"铜川市\"},\n" +
            "      {\"key\": 610300, \"label\": \"宝鸡市\"},\n" +
            "      {\"key\": 610400, \"label\": \"咸阳市\"},\n" +
            "      {\"key\": 610500, \"label\": \"渭南市\"},\n" +
            "      {\"key\": 610600, \"label\": \"延安市\"},\n" +
            "      {\"key\": 610700, \"label\": \"汉中市\"},\n" +
            "      {\"key\": 610800, \"label\": \"榆林市\"},\n" +
            "      {\"key\": 610900, \"label\": \"安康市\"},\n" +
            "      {\"key\": 611000, \"label\": \"商洛市\"}\n" +
            "    ],\n" +
            "    \"620000\": [\n" +
            "      {\"key\": 620100, \"label\": \"兰州市\"},\n" +
            "      {\"key\": 620200, \"label\": \"嘉峪关市\"},\n" +
            "      {\"key\": 620300, \"label\": \"金昌市\"},\n" +
            "      {\"key\": 620400, \"label\": \"白银市\"},\n" +
            "      {\"key\": 620500, \"label\": \"天水市\"},\n" +
            "      {\"key\": 620600, \"label\": \"武威市\"},\n" +
            "      {\"key\": 620700, \"label\": \"张掖市\"},\n" +
            "      {\"key\": 620800, \"label\": \"平凉市\"},\n" +
            "      {\"key\": 620900, \"label\": \"酒泉市\"},\n" +
            "      {\"key\": 621000, \"label\": \"庆阳市\"},\n" +
            "      {\"key\": 621100, \"label\": \"定西市\"},\n" +
            "      {\"key\": 621200, \"label\": \"陇南市\"},\n" +
            "      {\"key\": 622900, \"label\": \"临夏回族自治州\"},\n" +
            "      {\"key\": 623000, \"label\": \"甘南藏族自治州\"}\n" +
            "    ],\n" +
            "    \"630000\": [\n" +
            "      {\"key\": 630100, \"label\": \"西宁市\"},\n" +
            "      {\"key\": 630200, \"label\": \"海东市\"},\n" +
            "      {\"key\": 632200, \"label\": \"海北藏族自治州\"},\n" +
            "      {\"key\": 632300, \"label\": \"黄南藏族自治州\"},\n" +
            "      {\"key\": 632500, \"label\": \"海南藏族自治州\"},\n" +
            "      {\"key\": 632600, \"label\": \"果洛藏族自治州\"},\n" +
            "      {\"key\": 632700, \"label\": \"玉树藏族自治州\"},\n" +
            "      {\"key\": 632800, \"label\": \"海西蒙古族藏族自治州\"}\n" +
            "    ],\n" +
            "    \"640000\": [\n" +
            "      {\"key\": 640100, \"label\": \"银川市\"},\n" +
            "      {\"key\": 640200, \"label\": \"石嘴山市\"},\n" +
            "      {\"key\": 640300, \"label\": \"吴忠市\"},\n" +
            "      {\"key\": 640400, \"label\": \"固原市\"},\n" +
            "      {\"key\": 640500, \"label\": \"中卫市\"}\n" +
            "    ],\n" +
            "    \"650000\": [\n" +
            "      {\"key\": 650100, \"label\": \"乌鲁木齐市\"},\n" +
            "      {\"key\": 650200, \"label\": \"克拉玛依市\"},\n" +
            "      {\"key\": 650400, \"label\": \"吐鲁番市\"},\n" +
            "      {\"key\": 650500, \"label\": \"哈密市\"},\n" +
            "      {\"key\": 652300, \"label\": \"昌吉回族自治州\"},\n" +
            "      {\"key\": 652700, \"label\": \"博尔塔拉蒙古自治州\"},\n" +
            "      {\"key\": 652800, \"label\": \"巴音郭楞蒙古自治州\"},\n" +
            "      {\"key\": 652900, \"label\": \"阿克苏地区\"},\n" +
            "      {\"key\": 653000, \"label\": \"克孜勒苏柯尔克孜自治州\"},\n" +
            "      {\"key\": 653100, \"label\": \"喀什地区\"},\n" +
            "      {\"key\": 653200, \"label\": \"和田地区\"},\n" +
            "      {\"key\": 654000, \"label\": \"伊犁哈萨克自治州\"},\n" +
            "      {\"key\": 654200, \"label\": \"塔城地区\"},\n" +
            "      {\"key\": 654300, \"label\": \"阿勒泰地区\"}\n" +
            "    ]\n" +
            "  },\n" +
            "  \"district\": {\n" +
            "    \"110100\": [\n" +
            "      {\"key\": 110101, \"label\": \"东城区\"},\n" +
            "      {\"key\": 110102, \"label\": \"西城区\"},\n" +
            "      {\"key\": 110105, \"label\": \"朝阳区\"},\n" +
            "      {\"key\": 110106, \"label\": \"丰台区\"},\n" +
            "      {\"key\": 110107, \"label\": \"石景山区\"},\n" +
            "      {\"key\": 110108, \"label\": \"海淀区\"},\n" +
            "      {\"key\": 110109, \"label\": \"门头沟区\"},\n" +
            "      {\"key\": 110111, \"label\": \"房山区\"},\n" +
            "      {\"key\": 110112, \"label\": \"通州区\"},\n" +
            "      {\"key\": 110113, \"label\": \"顺义区\"},\n" +
            "      {\"key\": 110114, \"label\": \"昌平区\"},\n" +
            "      {\"key\": 110115, \"label\": \"大兴区\"},\n" +
            "      {\"key\": 110116, \"label\": \"怀柔区\"},\n" +
            "      {\"key\": 110117, \"label\": \"平谷区\"},\n" +
            "      {\"key\": 110118, \"label\": \"密云区\"},\n" +
            "      {\"key\": 110119, \"label\": \"延庆区\"}\n" +
            "    ],\n" +
            "    \"120100\": [\n" +
            "      {\"key\": 120101, \"label\": \"和平区\"},\n" +
            "      {\"key\": 120102, \"label\": \"河东区\"},\n" +
            "      {\"key\": 120103, \"label\": \"河西区\"},\n" +
            "      {\"key\": 120104, \"label\": \"南开区\"},\n" +
            "      {\"key\": 120105, \"label\": \"河北区\"},\n" +
            "      {\"key\": 120106, \"label\": \"红桥区\"},\n" +
            "      {\"key\": 120110, \"label\": \"东丽区\"},\n" +
            "      {\"key\": 120111, \"label\": \"西青区\"},\n" +
            "      {\"key\": 120112, \"label\": \"津南区\"},\n" +
            "      {\"key\": 120113, \"label\": \"北辰区\"},\n" +
            "      {\"key\": 120114, \"label\": \"武清区\"},\n" +
            "      {\"key\": 120115, \"label\": \"宝坻区\"},\n" +
            "      {\"key\": 120116, \"label\": \"滨海新区\"},\n" +
            "      {\"key\": 120117, \"label\": \"宁河区\"},\n" +
            "      {\"key\": 120118, \"label\": \"静海区\"},\n" +
            "      {\"key\": 120119, \"label\": \"蓟州区\"}\n" +
            "    ],\n" +
            "    \"130100\": [\n" +
            "      {\"key\": 130101, \"label\": \"石家庄市市辖区\"},\n" +
            "      {\"key\": 130102, \"label\": \"长安区\"},\n" +
            "      {\"key\": 130104, \"label\": \"桥西区\"},\n" +
            "      {\"key\": 130105, \"label\": \"新华区\"},\n" +
            "      {\"key\": 130107, \"label\": \"井陉矿区\"},\n" +
            "      {\"key\": 130108, \"label\": \"裕华区\"},\n" +
            "      {\"key\": 130109, \"label\": \"藁城区\"},\n" +
            "      {\"key\": 130110, \"label\": \"鹿泉区\"},\n" +
            "      {\"key\": 130111, \"label\": \"栾城区\"},\n" +
            "      {\"key\": 130121, \"label\": \"井陉县\"},\n" +
            "      {\"key\": 130123, \"label\": \"正定县\"},\n" +
            "      {\"key\": 130125, \"label\": \"行唐县\"},\n" +
            "      {\"key\": 130126, \"label\": \"灵寿县\"},\n" +
            "      {\"key\": 130127, \"label\": \"高邑县\"},\n" +
            "      {\"key\": 130128, \"label\": \"深泽县\"},\n" +
            "      {\"key\": 130129, \"label\": \"赞皇县\"},\n" +
            "      {\"key\": 130130, \"label\": \"无极县\"},\n" +
            "      {\"key\": 130131, \"label\": \"平山县\"},\n" +
            "      {\"key\": 130132, \"label\": \"元氏县\"},\n" +
            "      {\"key\": 130133, \"label\": \"赵县\"},\n" +
            "      {\"key\": 130181, \"label\": \"辛集市\"},\n" +
            "      {\"key\": 130183, \"label\": \"晋州市\"},\n" +
            "      {\"key\": 130184, \"label\": \"新乐市\"}\n" +
            "    ],\n" +
            "    \"130200\": [\n" +
            "      {\"key\": 130201, \"label\": \"唐山市市辖区\"},\n" +
            "      {\"key\": 130202, \"label\": \"路南区\"},\n" +
            "      {\"key\": 130203, \"label\": \"路北区\"},\n" +
            "      {\"key\": 130204, \"label\": \"古冶区\"},\n" +
            "      {\"key\": 130205, \"label\": \"开平区\"},\n" +
            "      {\"key\": 130207, \"label\": \"丰南区\"},\n" +
            "      {\"key\": 130208, \"label\": \"丰润区\"},\n" +
            "      {\"key\": 130209, \"label\": \"曹妃甸区\"},\n" +
            "      {\"key\": 130284, \"label\": \"滦州市\"},\n" +
            "      {\"key\": 130224, \"label\": \"滦南县\"},\n" +
            "      {\"key\": 130225, \"label\": \"乐亭县\"},\n" +
            "      {\"key\": 130227, \"label\": \"迁西县\"},\n" +
            "      {\"key\": 130229, \"label\": \"玉田县\"},\n" +
            "      {\"key\": 130281, \"label\": \"遵化市\"},\n" +
            "      {\"key\": 130283, \"label\": \"迁安市\"}\n" +
            "    ],\n" +
            "    \"130300\": [\n" +
            "      {\"key\": 130301, \"label\": \"秦皇岛市市辖区\"},\n" +
            "      {\"key\": 130302, \"label\": \"海港区\"},\n" +
            "      {\"key\": 130303, \"label\": \"山海关区\"},\n" +
            "      {\"key\": 130304, \"label\": \"北戴河区\"},\n" +
            "      {\"key\": 130306, \"label\": \"抚宁区\"},\n" +
            "      {\"key\": 130321, \"label\": \"青龙满族自治县\"},\n" +
            "      {\"key\": 130322, \"label\": \"昌黎县\"},\n" +
            "      {\"key\": 130324, \"label\": \"卢龙县\"}\n" +
            "    ],\n" +
            "    \"130400\": [\n" +
            "      {\"key\": 130401, \"label\": \"邯郸市市辖区\"},\n" +
            "      {\"key\": 130402, \"label\": \"邯山区\"},\n" +
            "      {\"key\": 130403, \"label\": \"丛台区\"},\n" +
            "      {\"key\": 130404, \"label\": \"复兴区\"},\n" +
            "      {\"key\": 130406, \"label\": \"峰峰矿区\"},\n" +
            "      {\"key\": 130407, \"label\": \"肥乡区\"},\n" +
            "      {\"key\": 130408, \"label\": \"永年区\"},\n" +
            "      {\"key\": 130423, \"label\": \"临漳县\"},\n" +
            "      {\"key\": 130424, \"label\": \"成安县\"},\n" +
            "      {\"key\": 130425, \"label\": \"大名县\"},\n" +
            "      {\"key\": 130426, \"label\": \"涉县\"},\n" +
            "      {\"key\": 130427, \"label\": \"磁县\"},\n" +
            "      {\"key\": 130430, \"label\": \"邱县\"},\n" +
            "      {\"key\": 130431, \"label\": \"鸡泽县\"},\n" +
            "      {\"key\": 130432, \"label\": \"广平县\"},\n" +
            "      {\"key\": 130433, \"label\": \"馆陶县\"},\n" +
            "      {\"key\": 130434, \"label\": \"魏县\"},\n" +
            "      {\"key\": 130435, \"label\": \"曲周县\"},\n" +
            "      {\"key\": 130481, \"label\": \"武安市\"}\n" +
            "    ],\n" +
            "    \"130500\": [\n" +
            "      {\"key\": 130501, \"label\": \"邢台市市辖区\"},\n" +
            "      {\"key\": 130502, \"label\": \"桥东区\"},\n" +
            "      {\"key\": 130503, \"label\": \"桥西区\"},\n" +
            "      {\"key\": 130521, \"label\": \"邢台县\"},\n" +
            "      {\"key\": 130522, \"label\": \"临城县\"},\n" +
            "      {\"key\": 130523, \"label\": \"内丘县\"},\n" +
            "      {\"key\": 130524, \"label\": \"柏乡县\"},\n" +
            "      {\"key\": 130525, \"label\": \"隆尧县\"},\n" +
            "      {\"key\": 130526, \"label\": \"任县\"},\n" +
            "      {\"key\": 130527, \"label\": \"南和县\"},\n" +
            "      {\"key\": 130528, \"label\": \"宁晋县\"},\n" +
            "      {\"key\": 130529, \"label\": \"巨鹿县\"},\n" +
            "      {\"key\": 130530, \"label\": \"新河县\"},\n" +
            "      {\"key\": 130531, \"label\": \"广宗县\"},\n" +
            "      {\"key\": 130532, \"label\": \"平乡县\"},\n" +
            "      {\"key\": 130533, \"label\": \"威县\"},\n" +
            "      {\"key\": 130534, \"label\": \"清河县\"},\n" +
            "      {\"key\": 130535, \"label\": \"临西县\"},\n" +
            "      {\"key\": 130581, \"label\": \"南宫市\"},\n" +
            "      {\"key\": 130582, \"label\": \"沙河市\"}\n" +
            "    ],\n" +
            "    \"130600\": [\n" +
            "      {\"key\": 130601, \"label\": \"保定市市辖区\"},\n" +
            "      {\"key\": 130602, \"label\": \"竞秀区\"},\n" +
            "      {\"key\": 130606, \"label\": \"莲池区\"},\n" +
            "      {\"key\": 130607, \"label\": \"满城区\"},\n" +
            "      {\"key\": 130608, \"label\": \"清苑区\"},\n" +
            "      {\"key\": 130609, \"label\": \"徐水区\"},\n" +
            "      {\"key\": 130623, \"label\": \"涞水县\"},\n" +
            "      {\"key\": 130624, \"label\": \"阜平县\"},\n" +
            "      {\"key\": 130626, \"label\": \"定兴县\"},\n" +
            "      {\"key\": 130627, \"label\": \"唐县\"},\n" +
            "      {\"key\": 130628, \"label\": \"高阳县\"},\n" +
            "      {\"key\": 130629, \"label\": \"容城县\"},\n" +
            "      {\"key\": 130630, \"label\": \"涞源县\"},\n" +
            "      {\"key\": 130631, \"label\": \"望都县\"},\n" +
            "      {\"key\": 130632, \"label\": \"安新县\"},\n" +
            "      {\"key\": 130633, \"label\": \"易县\"},\n" +
            "      {\"key\": 130634, \"label\": \"曲阳县\"},\n" +
            "      {\"key\": 130635, \"label\": \"蠡县\"},\n" +
            "      {\"key\": 130636, \"label\": \"顺平县\"},\n" +
            "      {\"key\": 130637, \"label\": \"博野县\"},\n" +
            "      {\"key\": 130638, \"label\": \"雄县\"},\n" +
            "      {\"key\": 130681, \"label\": \"涿州市\"},\n" +
            "      {\"key\": 130682, \"label\": \"定州市\"},\n" +
            "      {\"key\": 130683, \"label\": \"安国市\"},\n" +
            "      {\"key\": 130684, \"label\": \"高碑店市\"}\n" +
            "    ],\n" +
            "    \"130700\": [\n" +
            "      {\"key\": 130701, \"label\": \"张家口市市辖区\"},\n" +
            "      {\"key\": 130702, \"label\": \"桥东区\"},\n" +
            "      {\"key\": 130703, \"label\": \"桥西区\"},\n" +
            "      {\"key\": 130705, \"label\": \"宣化区\"},\n" +
            "      {\"key\": 130706, \"label\": \"下花园区\"},\n" +
            "      {\"key\": 130708, \"label\": \"万全区\"},\n" +
            "      {\"key\": 130709, \"label\": \"崇礼区\"},\n" +
            "      {\"key\": 130722, \"label\": \"张北县\"},\n" +
            "      {\"key\": 130723, \"label\": \"康保县\"},\n" +
            "      {\"key\": 130724, \"label\": \"沽源县\"},\n" +
            "      {\"key\": 130725, \"label\": \"尚义县\"},\n" +
            "      {\"key\": 130726, \"label\": \"蔚县\"},\n" +
            "      {\"key\": 130727, \"label\": \"阳原县\"},\n" +
            "      {\"key\": 130728, \"label\": \"怀安县\"},\n" +
            "      {\"key\": 130730, \"label\": \"怀来县\"},\n" +
            "      {\"key\": 130731, \"label\": \"涿鹿县\"},\n" +
            "      {\"key\": 130732, \"label\": \"赤城县\"}\n" +
            "    ],\n" +
            "    \"130800\": [\n" +
            "      {\"key\": 130801, \"label\": \"承德市市辖区\"},\n" +
            "      {\"key\": 130802, \"label\": \"双桥区\"},\n" +
            "      {\"key\": 130803, \"label\": \"双滦区\"},\n" +
            "      {\"key\": 130804, \"label\": \"鹰手营子矿区\"},\n" +
            "      {\"key\": 130821, \"label\": \"承德县\"},\n" +
            "      {\"key\": 130822, \"label\": \"兴隆县\"},\n" +
            "      {\"key\": 130824, \"label\": \"滦平县\"},\n" +
            "      {\"key\": 130825, \"label\": \"隆化县\"},\n" +
            "      {\"key\": 130826, \"label\": \"丰宁满族自治县\"},\n" +
            "      {\"key\": 130827, \"label\": \"宽城满族自治县\"},\n" +
            "      {\"key\": 130828, \"label\": \"围场满族蒙古族自治县\"},\n" +
            "      {\"key\": 130881, \"label\": \"平泉市\"}\n" +
            "    ],\n" +
            "    \"130900\": [\n" +
            "      {\"key\": 130901, \"label\": \"沧州市市辖区\"},\n" +
            "      {\"key\": 130902, \"label\": \"新华区\"},\n" +
            "      {\"key\": 130903, \"label\": \"运河区\"},\n" +
            "      {\"key\": 130921, \"label\": \"沧县\"},\n" +
            "      {\"key\": 130922, \"label\": \"青县\"},\n" +
            "      {\"key\": 130923, \"label\": \"东光县\"},\n" +
            "      {\"key\": 130924, \"label\": \"海兴县\"},\n" +
            "      {\"key\": 130925, \"label\": \"盐山县\"},\n" +
            "      {\"key\": 130926, \"label\": \"肃宁县\"},\n" +
            "      {\"key\": 130927, \"label\": \"南皮县\"},\n" +
            "      {\"key\": 130928, \"label\": \"吴桥县\"},\n" +
            "      {\"key\": 130929, \"label\": \"献县\"},\n" +
            "      {\"key\": 130930, \"label\": \"孟村回族自治县\"},\n" +
            "      {\"key\": 130981, \"label\": \"泊头市\"},\n" +
            "      {\"key\": 130982, \"label\": \"任丘市\"},\n" +
            "      {\"key\": 130983, \"label\": \"黄骅市\"},\n" +
            "      {\"key\": 130984, \"label\": \"河间市\"}\n" +
            "    ],\n" +
            "    \"131000\": [\n" +
            "      {\"key\": 131001, \"label\": \"廊坊市市辖区\"},\n" +
            "      {\"key\": 131002, \"label\": \"安次区\"},\n" +
            "      {\"key\": 131003, \"label\": \"广阳区\"},\n" +
            "      {\"key\": 131022, \"label\": \"固安县\"},\n" +
            "      {\"key\": 131023, \"label\": \"永清县\"},\n" +
            "      {\"key\": 131024, \"label\": \"香河县\"},\n" +
            "      {\"key\": 131025, \"label\": \"大城县\"},\n" +
            "      {\"key\": 131026, \"label\": \"文安县\"},\n" +
            "      {\"key\": 131028, \"label\": \"大厂回族自治县\"},\n" +
            "      {\"key\": 131081, \"label\": \"霸州市\"},\n" +
            "      {\"key\": 131082, \"label\": \"三河市\"}\n" +
            "    ],\n" +
            "    \"131100\": [\n" +
            "      {\"key\": 131101, \"label\": \"衡水市市辖区\"},\n" +
            "      {\"key\": 131102, \"label\": \"桃城区\"},\n" +
            "      {\"key\": 131103, \"label\": \"冀州区\"},\n" +
            "      {\"key\": 131121, \"label\": \"枣强县\"},\n" +
            "      {\"key\": 131122, \"label\": \"武邑县\"},\n" +
            "      {\"key\": 131123, \"label\": \"武强县\"},\n" +
            "      {\"key\": 131124, \"label\": \"饶阳县\"},\n" +
            "      {\"key\": 131125, \"label\": \"安平县\"},\n" +
            "      {\"key\": 131126, \"label\": \"故城县\"},\n" +
            "      {\"key\": 131127, \"label\": \"景县\"},\n" +
            "      {\"key\": 131128, \"label\": \"阜城县\"},\n" +
            "      {\"key\": 131182, \"label\": \"深州市\"}\n" +
            "    ],\n" +
            "    \"140100\": [\n" +
            "      {\"key\": 140101, \"label\": \"太原市市辖区\"},\n" +
            "      {\"key\": 140105, \"label\": \"小店区\"},\n" +
            "      {\"key\": 140106, \"label\": \"迎泽区\"},\n" +
            "      {\"key\": 140107, \"label\": \"杏花岭区\"},\n" +
            "      {\"key\": 140108, \"label\": \"尖草坪区\"},\n" +
            "      {\"key\": 140109, \"label\": \"万柏林区\"},\n" +
            "      {\"key\": 140110, \"label\": \"晋源区\"},\n" +
            "      {\"key\": 140121, \"label\": \"清徐县\"},\n" +
            "      {\"key\": 140122, \"label\": \"阳曲县\"},\n" +
            "      {\"key\": 140123, \"label\": \"娄烦县\"},\n" +
            "      {\"key\": 140181, \"label\": \"古交市\"}\n" +
            "    ],\n" +
            "    \"140200\": [\n" +
            "      {\"key\": 140201, \"label\": \"大同市市辖区\"},\n" +
            "      {\"key\": 140213, \"label\": \"平城区\"},\n" +
            "      {\"key\": 140214, \"label\": \"云冈区\"},\n" +
            "      {\"key\": 140212, \"label\": \"新荣区\"},\n" +
            "      {\"key\": 140221, \"label\": \"阳高县\"},\n" +
            "      {\"key\": 140222, \"label\": \"天镇县\"},\n" +
            "      {\"key\": 140223, \"label\": \"广灵县\"},\n" +
            "      {\"key\": 140224, \"label\": \"灵丘县\"},\n" +
            "      {\"key\": 140225, \"label\": \"浑源县\"},\n" +
            "      {\"key\": 140226, \"label\": \"左云县\"},\n" +
            "      {\"key\": 140215, \"label\": \"云州区\"}\n" +
            "    ],\n" +
            "    \"140300\": [\n" +
            "      {\"key\": 140301, \"label\": \"阳泉市市辖区\"},\n" +
            "      {\"key\": 140302, \"label\": \"城区\"},\n" +
            "      {\"key\": 140303, \"label\": \"矿区\"},\n" +
            "      {\"key\": 140311, \"label\": \"郊区\"},\n" +
            "      {\"key\": 140321, \"label\": \"平定县\"},\n" +
            "      {\"key\": 140322, \"label\": \"盂县\"}\n" +
            "    ],\n" +
            "    \"140400\": [\n" +
            "      {\"key\": 140401, \"label\": \"长治市市辖区\"},\n" +
            "      {\"key\": 140403, \"label\": \"潞州区\"},\n" +
            "      {\"key\": 140404, \"label\": \"上党区\"},\n" +
            "      {\"key\": 140423, \"label\": \"襄垣县\"},\n" +
            "      {\"key\": 140405, \"label\": \"屯留区\"},\n" +
            "      {\"key\": 140425, \"label\": \"平顺县\"},\n" +
            "      {\"key\": 140426, \"label\": \"黎城县\"},\n" +
            "      {\"key\": 140427, \"label\": \"壶关县\"},\n" +
            "      {\"key\": 140428, \"label\": \"长子县\"},\n" +
            "      {\"key\": 140429, \"label\": \"武乡县\"},\n" +
            "      {\"key\": 140430, \"label\": \"沁县\"},\n" +
            "      {\"key\": 140431, \"label\": \"沁源县\"},\n" +
            "      {\"key\": 140406, \"label\": \"潞城区\"}\n" +
            "    ],\n" +
            "    \"140500\": [\n" +
            "      {\"key\": 140501, \"label\": \"晋城市市辖区\"},\n" +
            "      {\"key\": 140502, \"label\": \"城区\"},\n" +
            "      {\"key\": 140521, \"label\": \"沁水县\"},\n" +
            "      {\"key\": 140522, \"label\": \"阳城县\"},\n" +
            "      {\"key\": 140524, \"label\": \"陵川县\"},\n" +
            "      {\"key\": 140525, \"label\": \"泽州县\"},\n" +
            "      {\"key\": 140581, \"label\": \"高平市\"}\n" +
            "    ],\n" +
            "    \"140600\": [\n" +
            "      {\"key\": 140601, \"label\": \"朔州市市辖区\"},\n" +
            "      {\"key\": 140602, \"label\": \"朔城区\"},\n" +
            "      {\"key\": 140603, \"label\": \"平鲁区\"},\n" +
            "      {\"key\": 140621, \"label\": \"山阴县\"},\n" +
            "      {\"key\": 140622, \"label\": \"应县\"},\n" +
            "      {\"key\": 140623, \"label\": \"右玉县\"},\n" +
            "      {\"key\": 140681, \"label\": \"怀仁市\"}\n" +
            "    ],\n" +
            "    \"140700\": [\n" +
            "      {\"key\": 140701, \"label\": \"晋中市市辖区\"},\n" +
            "      {\"key\": 140702, \"label\": \"榆次区\"},\n" +
            "      {\"key\": 140721, \"label\": \"榆社县\"},\n" +
            "      {\"key\": 140722, \"label\": \"左权县\"},\n" +
            "      {\"key\": 140723, \"label\": \"和顺县\"},\n" +
            "      {\"key\": 140724, \"label\": \"昔阳县\"},\n" +
            "      {\"key\": 140725, \"label\": \"寿阳县\"},\n" +
            "      {\"key\": 140726, \"label\": \"太谷县\"},\n" +
            "      {\"key\": 140727, \"label\": \"祁县\"},\n" +
            "      {\"key\": 140728, \"label\": \"平遥县\"},\n" +
            "      {\"key\": 140729, \"label\": \"灵石县\"},\n" +
            "      {\"key\": 140781, \"label\": \"介休市\"}\n" +
            "    ],\n" +
            "    \"140800\": [\n" +
            "      {\"key\": 140801, \"label\": \"运城市市辖区\"},\n" +
            "      {\"key\": 140802, \"label\": \"盐湖区\"},\n" +
            "      {\"key\": 140821, \"label\": \"临猗县\"},\n" +
            "      {\"key\": 140822, \"label\": \"万荣县\"},\n" +
            "      {\"key\": 140823, \"label\": \"闻喜县\"},\n" +
            "      {\"key\": 140824, \"label\": \"稷山县\"},\n" +
            "      {\"key\": 140825, \"label\": \"新绛县\"},\n" +
            "      {\"key\": 140826, \"label\": \"绛县\"},\n" +
            "      {\"key\": 140827, \"label\": \"垣曲县\"},\n" +
            "      {\"key\": 140828, \"label\": \"夏县\"},\n" +
            "      {\"key\": 140829, \"label\": \"平陆县\"},\n" +
            "      {\"key\": 140830, \"label\": \"芮城县\"},\n" +
            "      {\"key\": 140881, \"label\": \"永济市\"},\n" +
            "      {\"key\": 140882, \"label\": \"河津市\"}\n" +
            "    ],\n" +
            "    \"140900\": [\n" +
            "      {\"key\": 140901, \"label\": \"忻州市市辖区\"},\n" +
            "      {\"key\": 140902, \"label\": \"忻府区\"},\n" +
            "      {\"key\": 140921, \"label\": \"定襄县\"},\n" +
            "      {\"key\": 140922, \"label\": \"五台县\"},\n" +
            "      {\"key\": 140923, \"label\": \"代县\"},\n" +
            "      {\"key\": 140924, \"label\": \"繁峙县\"},\n" +
            "      {\"key\": 140925, \"label\": \"宁武县\"},\n" +
            "      {\"key\": 140926, \"label\": \"静乐县\"},\n" +
            "      {\"key\": 140927, \"label\": \"神池县\"},\n" +
            "      {\"key\": 140928, \"label\": \"五寨县\"},\n" +
            "      {\"key\": 140929, \"label\": \"岢岚县\"},\n" +
            "      {\"key\": 140930, \"label\": \"河曲县\"},\n" +
            "      {\"key\": 140931, \"label\": \"保德县\"},\n" +
            "      {\"key\": 140932, \"label\": \"偏关县\"},\n" +
            "      {\"key\": 140981, \"label\": \"原平市\"}\n" +
            "    ],\n" +
            "    \"141000\": [\n" +
            "      {\"key\": 141001, \"label\": \"临汾市市辖区\"},\n" +
            "      {\"key\": 141002, \"label\": \"尧都区\"},\n" +
            "      {\"key\": 141021, \"label\": \"曲沃县\"},\n" +
            "      {\"key\": 141022, \"label\": \"翼城县\"},\n" +
            "      {\"key\": 141023, \"label\": \"襄汾县\"},\n" +
            "      {\"key\": 141024, \"label\": \"洪洞县\"},\n" +
            "      {\"key\": 141025, \"label\": \"古县\"},\n" +
            "      {\"key\": 141026, \"label\": \"安泽县\"},\n" +
            "      {\"key\": 141027, \"label\": \"浮山县\"},\n" +
            "      {\"key\": 141028, \"label\": \"吉县\"},\n" +
            "      {\"key\": 141029, \"label\": \"乡宁县\"},\n" +
            "      {\"key\": 141030, \"label\": \"大宁县\"},\n" +
            "      {\"key\": 141031, \"label\": \"隰县\"},\n" +
            "      {\"key\": 141032, \"label\": \"永和县\"},\n" +
            "      {\"key\": 141033, \"label\": \"蒲县\"},\n" +
            "      {\"key\": 141034, \"label\": \"汾西县\"},\n" +
            "      {\"key\": 141081, \"label\": \"侯马市\"},\n" +
            "      {\"key\": 141082, \"label\": \"霍州市\"}\n" +
            "    ],\n" +
            "    \"141100\": [\n" +
            "      {\"key\": 141101, \"label\": \"吕梁市市辖区\"},\n" +
            "      {\"key\": 141102, \"label\": \"离石区\"},\n" +
            "      {\"key\": 141121, \"label\": \"文水县\"},\n" +
            "      {\"key\": 141122, \"label\": \"交城县\"},\n" +
            "      {\"key\": 141123, \"label\": \"兴县\"},\n" +
            "      {\"key\": 141124, \"label\": \"临县\"},\n" +
            "      {\"key\": 141125, \"label\": \"柳林县\"},\n" +
            "      {\"key\": 141126, \"label\": \"石楼县\"},\n" +
            "      {\"key\": 141127, \"label\": \"岚县\"},\n" +
            "      {\"key\": 141128, \"label\": \"方山县\"},\n" +
            "      {\"key\": 141129, \"label\": \"中阳县\"},\n" +
            "      {\"key\": 141130, \"label\": \"交口县\"},\n" +
            "      {\"key\": 141181, \"label\": \"孝义市\"},\n" +
            "      {\"key\": 141182, \"label\": \"汾阳市\"}\n" +
            "    ],\n" +
            "    \"150100\": [\n" +
            "      {\"key\": 150101, \"label\": \"呼和浩特市市辖区\"},\n" +
            "      {\"key\": 150102, \"label\": \"新城区\"},\n" +
            "      {\"key\": 150103, \"label\": \"回民区\"},\n" +
            "      {\"key\": 150104, \"label\": \"玉泉区\"},\n" +
            "      {\"key\": 150105, \"label\": \"赛罕区\"},\n" +
            "      {\"key\": 150121, \"label\": \"土默特左旗\"},\n" +
            "      {\"key\": 150122, \"label\": \"托克托县\"},\n" +
            "      {\"key\": 150123, \"label\": \"和林格尔县\"},\n" +
            "      {\"key\": 150124, \"label\": \"清水河县\"},\n" +
            "      {\"key\": 150125, \"label\": \"武川县\"}\n" +
            "    ],\n" +
            "    \"150200\": [\n" +
            "      {\"key\": 150201, \"label\": \"包头市市辖区\"},\n" +
            "      {\"key\": 150202, \"label\": \"东河区\"},\n" +
            "      {\"key\": 150203, \"label\": \"昆都仑区\"},\n" +
            "      {\"key\": 150204, \"label\": \"青山区\"},\n" +
            "      {\"key\": 150205, \"label\": \"石拐区\"},\n" +
            "      {\"key\": 150206, \"label\": \"白云鄂博矿区\"},\n" +
            "      {\"key\": 150207, \"label\": \"九原区\"},\n" +
            "      {\"key\": 150221, \"label\": \"土默特右旗\"},\n" +
            "      {\"key\": 150222, \"label\": \"固阳县\"},\n" +
            "      {\"key\": 150223, \"label\": \"达尔罕茂明安联合旗\"}\n" +
            "    ],\n" +
            "    \"150300\": [\n" +
            "      {\"key\": 150301, \"label\": \"乌海市市辖区\"},\n" +
            "      {\"key\": 150302, \"label\": \"海勃湾区\"},\n" +
            "      {\"key\": 150303, \"label\": \"海南区\"},\n" +
            "      {\"key\": 150304, \"label\": \"乌达区\"}\n" +
            "    ],\n" +
            "    \"150400\": [\n" +
            "      {\"key\": 150401, \"label\": \"赤峰市市辖区\"},\n" +
            "      {\"key\": 150402, \"label\": \"红山区\"},\n" +
            "      {\"key\": 150403, \"label\": \"元宝山区\"},\n" +
            "      {\"key\": 150404, \"label\": \"松山区\"},\n" +
            "      {\"key\": 150421, \"label\": \"阿鲁科尔沁旗\"},\n" +
            "      {\"key\": 150422, \"label\": \"巴林左旗\"},\n" +
            "      {\"key\": 150423, \"label\": \"巴林右旗\"},\n" +
            "      {\"key\": 150424, \"label\": \"林西县\"},\n" +
            "      {\"key\": 150425, \"label\": \"克什克腾旗\"},\n" +
            "      {\"key\": 150426, \"label\": \"翁牛特旗\"},\n" +
            "      {\"key\": 150428, \"label\": \"喀喇沁旗\"},\n" +
            "      {\"key\": 150429, \"label\": \"宁城县\"},\n" +
            "      {\"key\": 150430, \"label\": \"敖汉旗\"}\n" +
            "    ],\n" +
            "    \"150500\": [\n" +
            "      {\"key\": 150501, \"label\": \"通辽市市辖区\"},\n" +
            "      {\"key\": 150502, \"label\": \"科尔沁区\"},\n" +
            "      {\"key\": 150521, \"label\": \"科尔沁左翼中旗\"},\n" +
            "      {\"key\": 150522, \"label\": \"科尔沁左翼后旗\"},\n" +
            "      {\"key\": 150523, \"label\": \"开鲁县\"},\n" +
            "      {\"key\": 150524, \"label\": \"库伦旗\"},\n" +
            "      {\"key\": 150525, \"label\": \"奈曼旗\"},\n" +
            "      {\"key\": 150526, \"label\": \"扎鲁特旗\"},\n" +
            "      {\"key\": 150581, \"label\": \"霍林郭勒市\"}\n" +
            "    ],\n" +
            "    \"150600\": [\n" +
            "      {\"key\": 150601, \"label\": \"鄂尔多斯市市辖区\"},\n" +
            "      {\"key\": 150602, \"label\": \"东胜区\"},\n" +
            "      {\"key\": 150603, \"label\": \"康巴什区\"},\n" +
            "      {\"key\": 150621, \"label\": \"达拉特旗\"},\n" +
            "      {\"key\": 150622, \"label\": \"准格尔旗\"},\n" +
            "      {\"key\": 150623, \"label\": \"鄂托克前旗\"},\n" +
            "      {\"key\": 150624, \"label\": \"鄂托克旗\"},\n" +
            "      {\"key\": 150625, \"label\": \"杭锦旗\"},\n" +
            "      {\"key\": 150626, \"label\": \"乌审旗\"},\n" +
            "      {\"key\": 150627, \"label\": \"伊金霍洛旗\"}\n" +
            "    ],\n" +
            "    \"150700\": [\n" +
            "      {\"key\": 150701, \"label\": \"呼伦贝尔市市辖区\"},\n" +
            "      {\"key\": 150702, \"label\": \"海拉尔区\"},\n" +
            "      {\"key\": 150703, \"label\": \"扎赉诺尔区\"},\n" +
            "      {\"key\": 150721, \"label\": \"阿荣旗\"},\n" +
            "      {\"key\": 150722, \"label\": \"莫力达瓦达斡尔族自治旗\"},\n" +
            "      {\"key\": 150723, \"label\": \"鄂伦春自治旗\"},\n" +
            "      {\"key\": 150724, \"label\": \"鄂温克族自治旗\"},\n" +
            "      {\"key\": 150725, \"label\": \"陈巴尔虎旗\"},\n" +
            "      {\"key\": 150726, \"label\": \"新巴尔虎左旗\"},\n" +
            "      {\"key\": 150727, \"label\": \"新巴尔虎右旗\"},\n" +
            "      {\"key\": 150781, \"label\": \"满洲里市\"},\n" +
            "      {\"key\": 150782, \"label\": \"牙克石市\"},\n" +
            "      {\"key\": 150783, \"label\": \"扎兰屯市\"},\n" +
            "      {\"key\": 150784, \"label\": \"额尔古纳市\"},\n" +
            "      {\"key\": 150785, \"label\": \"根河市\"}\n" +
            "    ],\n" +
            "    \"150800\": [\n" +
            "      {\"key\": 150801, \"label\": \"巴彦淖尔市市辖区\"},\n" +
            "      {\"key\": 150802, \"label\": \"临河区\"},\n" +
            "      {\"key\": 150821, \"label\": \"五原县\"},\n" +
            "      {\"key\": 150822, \"label\": \"磴口县\"},\n" +
            "      {\"key\": 150823, \"label\": \"乌拉特前旗\"},\n" +
            "      {\"key\": 150824, \"label\": \"乌拉特中旗\"},\n" +
            "      {\"key\": 150825, \"label\": \"乌拉特后旗\"},\n" +
            "      {\"key\": 150826, \"label\": \"杭锦后旗\"}\n" +
            "    ],\n" +
            "    \"150900\": [\n" +
            "      {\"key\": 150901, \"label\": \"乌兰察布市市辖区\"},\n" +
            "      {\"key\": 150902, \"label\": \"集宁区\"},\n" +
            "      {\"key\": 150921, \"label\": \"卓资县\"},\n" +
            "      {\"key\": 150922, \"label\": \"化德县\"},\n" +
            "      {\"key\": 150923, \"label\": \"商都县\"},\n" +
            "      {\"key\": 150924, \"label\": \"兴和县\"},\n" +
            "      {\"key\": 150925, \"label\": \"凉城县\"},\n" +
            "      {\"key\": 150926, \"label\": \"察哈尔右翼前旗\"},\n" +
            "      {\"key\": 150927, \"label\": \"察哈尔右翼中旗\"},\n" +
            "      {\"key\": 150928, \"label\": \"察哈尔右翼后旗\"},\n" +
            "      {\"key\": 150929, \"label\": \"四子王旗\"},\n" +
            "      {\"key\": 150981, \"label\": \"丰镇市\"}\n" +
            "    ],\n" +
            "    \"152200\": [\n" +
            "      {\"key\": 152201, \"label\": \"乌兰浩特市\"},\n" +
            "      {\"key\": 152202, \"label\": \"阿尔山市\"},\n" +
            "      {\"key\": 152221, \"label\": \"科尔沁右翼前旗\"},\n" +
            "      {\"key\": 152222, \"label\": \"科尔沁右翼中旗\"},\n" +
            "      {\"key\": 152223, \"label\": \"扎赉特旗\"},\n" +
            "      {\"key\": 152224, \"label\": \"突泉县\"}\n" +
            "    ],\n" +
            "    \"152500\": [\n" +
            "      {\"key\": 152501, \"label\": \"二连浩特市\"},\n" +
            "      {\"key\": 152502, \"label\": \"锡林浩特市\"},\n" +
            "      {\"key\": 152522, \"label\": \"阿巴嘎旗\"},\n" +
            "      {\"key\": 152523, \"label\": \"苏尼特左旗\"},\n" +
            "      {\"key\": 152524, \"label\": \"苏尼特右旗\"},\n" +
            "      {\"key\": 152525, \"label\": \"东乌珠穆沁旗\"},\n" +
            "      {\"key\": 152526, \"label\": \"西乌珠穆沁旗\"},\n" +
            "      {\"key\": 152527, \"label\": \"太仆寺旗\"},\n" +
            "      {\"key\": 152528, \"label\": \"镶黄旗\"},\n" +
            "      {\"key\": 152529, \"label\": \"正镶白旗\"},\n" +
            "      {\"key\": 152530, \"label\": \"正蓝旗\"},\n" +
            "      {\"key\": 152531, \"label\": \"多伦县\"}\n" +
            "    ],\n" +
            "    \"152900\": [\n" +
            "      {\"key\": 152921, \"label\": \"阿拉善左旗\"},\n" +
            "      {\"key\": 152922, \"label\": \"阿拉善右旗\"},\n" +
            "      {\"key\": 152923, \"label\": \"额济纳旗\"}\n" +
            "    ],\n" +
            "    \"210100\": [\n" +
            "      {\"key\": 210101, \"label\": \"沈阳市市辖区\"},\n" +
            "      {\"key\": 210102, \"label\": \"和平区\"},\n" +
            "      {\"key\": 210103, \"label\": \"沈河区\"},\n" +
            "      {\"key\": 210104, \"label\": \"大东区\"},\n" +
            "      {\"key\": 210105, \"label\": \"皇姑区\"},\n" +
            "      {\"key\": 210106, \"label\": \"铁西区\"},\n" +
            "      {\"key\": 210111, \"label\": \"苏家屯区\"},\n" +
            "      {\"key\": 210112, \"label\": \"浑南区\"},\n" +
            "      {\"key\": 210113, \"label\": \"沈北新区\"},\n" +
            "      {\"key\": 210114, \"label\": \"于洪区\"},\n" +
            "      {\"key\": 210115, \"label\": \"辽中区\"},\n" +
            "      {\"key\": 210123, \"label\": \"康平县\"},\n" +
            "      {\"key\": 210124, \"label\": \"法库县\"},\n" +
            "      {\"key\": 210181, \"label\": \"新民市\"}\n" +
            "    ],\n" +
            "    \"210200\": [\n" +
            "      {\"key\": 210201, \"label\": \"大连市市辖区\"},\n" +
            "      {\"key\": 210202, \"label\": \"中山区\"},\n" +
            "      {\"key\": 210203, \"label\": \"西岗区\"},\n" +
            "      {\"key\": 210204, \"label\": \"沙河口区\"},\n" +
            "      {\"key\": 210211, \"label\": \"甘井子区\"},\n" +
            "      {\"key\": 210212, \"label\": \"旅顺口区\"},\n" +
            "      {\"key\": 210213, \"label\": \"金州区\"},\n" +
            "      {\"key\": 210214, \"label\": \"普兰店区\"},\n" +
            "      {\"key\": 210224, \"label\": \"长海县\"},\n" +
            "      {\"key\": 210281, \"label\": \"瓦房店市\"},\n" +
            "      {\"key\": 210283, \"label\": \"庄河市\"}\n" +
            "    ],\n" +
            "    \"210300\": [\n" +
            "      {\"key\": 210301, \"label\": \"鞍山市市辖区\"},\n" +
            "      {\"key\": 210302, \"label\": \"铁东区\"},\n" +
            "      {\"key\": 210303, \"label\": \"铁西区\"},\n" +
            "      {\"key\": 210304, \"label\": \"立山区\"},\n" +
            "      {\"key\": 210311, \"label\": \"千山区\"},\n" +
            "      {\"key\": 210321, \"label\": \"台安县\"},\n" +
            "      {\"key\": 210323, \"label\": \"岫岩满族自治县\"},\n" +
            "      {\"key\": 210381, \"label\": \"海城市\"}\n" +
            "    ],\n" +
            "    \"210400\": [\n" +
            "      {\"key\": 210401, \"label\": \"抚顺市市辖区\"},\n" +
            "      {\"key\": 210402, \"label\": \"新抚区\"},\n" +
            "      {\"key\": 210403, \"label\": \"东洲区\"},\n" +
            "      {\"key\": 210404, \"label\": \"望花区\"},\n" +
            "      {\"key\": 210411, \"label\": \"顺城区\"},\n" +
            "      {\"key\": 210421, \"label\": \"抚顺县\"},\n" +
            "      {\"key\": 210422, \"label\": \"新宾满族自治县\"},\n" +
            "      {\"key\": 210423, \"label\": \"清原满族自治县\"}\n" +
            "    ],\n" +
            "    \"210500\": [\n" +
            "      {\"key\": 210501, \"label\": \"本溪市市辖区\"},\n" +
            "      {\"key\": 210502, \"label\": \"平山区\"},\n" +
            "      {\"key\": 210503, \"label\": \"溪湖区\"},\n" +
            "      {\"key\": 210504, \"label\": \"明山区\"},\n" +
            "      {\"key\": 210505, \"label\": \"南芬区\"},\n" +
            "      {\"key\": 210521, \"label\": \"本溪满族自治县\"},\n" +
            "      {\"key\": 210522, \"label\": \"桓仁满族自治县\"}\n" +
            "    ],\n" +
            "    \"210600\": [\n" +
            "      {\"key\": 210601, \"label\": \"丹东市市辖区\"},\n" +
            "      {\"key\": 210602, \"label\": \"元宝区\"},\n" +
            "      {\"key\": 210603, \"label\": \"振兴区\"},\n" +
            "      {\"key\": 210604, \"label\": \"振安区\"},\n" +
            "      {\"key\": 210624, \"label\": \"宽甸满族自治县\"},\n" +
            "      {\"key\": 210681, \"label\": \"东港市\"},\n" +
            "      {\"key\": 210682, \"label\": \"凤城市\"}\n" +
            "    ],\n" +
            "    \"210700\": [\n" +
            "      {\"key\": 210701, \"label\": \"锦州市市辖区\"},\n" +
            "      {\"key\": 210702, \"label\": \"古塔区\"},\n" +
            "      {\"key\": 210703, \"label\": \"凌河区\"},\n" +
            "      {\"key\": 210711, \"label\": \"太和区\"},\n" +
            "      {\"key\": 210726, \"label\": \"黑山县\"},\n" +
            "      {\"key\": 210727, \"label\": \"义县\"},\n" +
            "      {\"key\": 210781, \"label\": \"凌海市\"},\n" +
            "      {\"key\": 210782, \"label\": \"北镇市\"}\n" +
            "    ],\n" +
            "    \"210800\": [\n" +
            "      {\"key\": 210801, \"label\": \"营口市市辖区\"},\n" +
            "      {\"key\": 210802, \"label\": \"站前区\"},\n" +
            "      {\"key\": 210803, \"label\": \"西市区\"},\n" +
            "      {\"key\": 210804, \"label\": \"鲅鱼圈区\"},\n" +
            "      {\"key\": 210811, \"label\": \"老边区\"},\n" +
            "      {\"key\": 210881, \"label\": \"盖州市\"},\n" +
            "      {\"key\": 210882, \"label\": \"大石桥市\"}\n" +
            "    ],\n" +
            "    \"210900\": [\n" +
            "      {\"key\": 210901, \"label\": \"阜新市市辖区\"},\n" +
            "      {\"key\": 210902, \"label\": \"海州区\"},\n" +
            "      {\"key\": 210903, \"label\": \"新邱区\"},\n" +
            "      {\"key\": 210904, \"label\": \"太平区\"},\n" +
            "      {\"key\": 210905, \"label\": \"清河门区\"},\n" +
            "      {\"key\": 210911, \"label\": \"细河区\"},\n" +
            "      {\"key\": 210921, \"label\": \"阜新蒙古族自治县\"},\n" +
            "      {\"key\": 210922, \"label\": \"彰武县\"}\n" +
            "    ],\n" +
            "    \"211000\": [\n" +
            "      {\"key\": 211001, \"label\": \"辽阳市市辖区\"},\n" +
            "      {\"key\": 211002, \"label\": \"白塔区\"},\n" +
            "      {\"key\": 211003, \"label\": \"文圣区\"},\n" +
            "      {\"key\": 211004, \"label\": \"宏伟区\"},\n" +
            "      {\"key\": 211005, \"label\": \"弓长岭区\"},\n" +
            "      {\"key\": 211011, \"label\": \"太子河区\"},\n" +
            "      {\"key\": 211021, \"label\": \"辽阳县\"},\n" +
            "      {\"key\": 211081, \"label\": \"灯塔市\"}\n" +
            "    ],\n" +
            "    \"211100\": [\n" +
            "      {\"key\": 211101, \"label\": \"盘锦市市辖区\"},\n" +
            "      {\"key\": 211102, \"label\": \"双台子区\"},\n" +
            "      {\"key\": 211103, \"label\": \"兴隆台区\"},\n" +
            "      {\"key\": 211104, \"label\": \"大洼区\"},\n" +
            "      {\"key\": 211122, \"label\": \"盘山县\"}\n" +
            "    ],\n" +
            "    \"211200\": [\n" +
            "      {\"key\": 211201, \"label\": \"铁岭市市辖区\"},\n" +
            "      {\"key\": 211202, \"label\": \"银州区\"},\n" +
            "      {\"key\": 211204, \"label\": \"清河区\"},\n" +
            "      {\"key\": 211221, \"label\": \"铁岭县\"},\n" +
            "      {\"key\": 211223, \"label\": \"西丰县\"},\n" +
            "      {\"key\": 211224, \"label\": \"昌图县\"},\n" +
            "      {\"key\": 211281, \"label\": \"调兵山市\"},\n" +
            "      {\"key\": 211282, \"label\": \"开原市\"}\n" +
            "    ],\n" +
            "    \"211300\": [\n" +
            "      {\"key\": 211301, \"label\": \"朝阳市市辖区\"},\n" +
            "      {\"key\": 211302, \"label\": \"双塔区\"},\n" +
            "      {\"key\": 211303, \"label\": \"龙城区\"},\n" +
            "      {\"key\": 211321, \"label\": \"朝阳县\"},\n" +
            "      {\"key\": 211322, \"label\": \"建平县\"},\n" +
            "      {\"key\": 211324, \"label\": \"喀喇沁左翼蒙古族自治县\"},\n" +
            "      {\"key\": 211381, \"label\": \"北票市\"},\n" +
            "      {\"key\": 211382, \"label\": \"凌源市\"}\n" +
            "    ],\n" +
            "    \"211400\": [\n" +
            "      {\"key\": 211401, \"label\": \"葫芦岛市市辖区\"},\n" +
            "      {\"key\": 211402, \"label\": \"连山区\"},\n" +
            "      {\"key\": 211403, \"label\": \"龙港区\"},\n" +
            "      {\"key\": 211404, \"label\": \"南票区\"},\n" +
            "      {\"key\": 211421, \"label\": \"绥中县\"},\n" +
            "      {\"key\": 211422, \"label\": \"建昌县\"},\n" +
            "      {\"key\": 211481, \"label\": \"兴城市\"}\n" +
            "    ],\n" +
            "    \"220100\": [\n" +
            "      {\"key\": 220101, \"label\": \"长春市市辖区\"},\n" +
            "      {\"key\": 220102, \"label\": \"南关区\"},\n" +
            "      {\"key\": 220103, \"label\": \"宽城区\"},\n" +
            "      {\"key\": 220104, \"label\": \"朝阳区\"},\n" +
            "      {\"key\": 220105, \"label\": \"二道区\"},\n" +
            "      {\"key\": 220106, \"label\": \"绿园区\"},\n" +
            "      {\"key\": 220112, \"label\": \"双阳区\"},\n" +
            "      {\"key\": 220113, \"label\": \"九台区\"},\n" +
            "      {\"key\": 220122, \"label\": \"农安县\"},\n" +
            "      {\"key\": 220182, \"label\": \"榆树市\"},\n" +
            "      {\"key\": 220183, \"label\": \"德惠市\"}\n" +
            "    ],\n" +
            "    \"220200\": [\n" +
            "      {\"key\": 220201, \"label\": \"吉林市市辖区\"},\n" +
            "      {\"key\": 220202, \"label\": \"昌邑区\"},\n" +
            "      {\"key\": 220203, \"label\": \"龙潭区\"},\n" +
            "      {\"key\": 220204, \"label\": \"船营区\"},\n" +
            "      {\"key\": 220211, \"label\": \"丰满区\"},\n" +
            "      {\"key\": 220221, \"label\": \"永吉县\"},\n" +
            "      {\"key\": 220281, \"label\": \"蛟河市\"},\n" +
            "      {\"key\": 220282, \"label\": \"桦甸市\"},\n" +
            "      {\"key\": 220283, \"label\": \"舒兰市\"},\n" +
            "      {\"key\": 220284, \"label\": \"磐石市\"}\n" +
            "    ],\n" +
            "    \"220300\": [\n" +
            "      {\"key\": 220301, \"label\": \"四平市市辖区\"},\n" +
            "      {\"key\": 220302, \"label\": \"铁西区\"},\n" +
            "      {\"key\": 220303, \"label\": \"铁东区\"},\n" +
            "      {\"key\": 220322, \"label\": \"梨树县\"},\n" +
            "      {\"key\": 220323, \"label\": \"伊通满族自治县\"},\n" +
            "      {\"key\": 220381, \"label\": \"公主岭市\"},\n" +
            "      {\"key\": 220382, \"label\": \"双辽市\"}\n" +
            "    ],\n" +
            "    \"220400\": [\n" +
            "      {\"key\": 220401, \"label\": \"辽源市市辖区\"},\n" +
            "      {\"key\": 220402, \"label\": \"龙山区\"},\n" +
            "      {\"key\": 220403, \"label\": \"西安区\"},\n" +
            "      {\"key\": 220421, \"label\": \"东丰县\"},\n" +
            "      {\"key\": 220422, \"label\": \"东辽县\"}\n" +
            "    ],\n" +
            "    \"220500\": [\n" +
            "      {\"key\": 220501, \"label\": \"通化市市辖区\"},\n" +
            "      {\"key\": 220502, \"label\": \"东昌区\"},\n" +
            "      {\"key\": 220503, \"label\": \"二道江区\"},\n" +
            "      {\"key\": 220521, \"label\": \"通化县\"},\n" +
            "      {\"key\": 220523, \"label\": \"辉南县\"},\n" +
            "      {\"key\": 220524, \"label\": \"柳河县\"},\n" +
            "      {\"key\": 220581, \"label\": \"梅河口市\"},\n" +
            "      {\"key\": 220582, \"label\": \"集安市\"}\n" +
            "    ],\n" +
            "    \"220600\": [\n" +
            "      {\"key\": 220601, \"label\": \"白山市市辖区\"},\n" +
            "      {\"key\": 220602, \"label\": \"浑江区\"},\n" +
            "      {\"key\": 220605, \"label\": \"江源区\"},\n" +
            "      {\"key\": 220621, \"label\": \"抚松县\"},\n" +
            "      {\"key\": 220622, \"label\": \"靖宇县\"},\n" +
            "      {\"key\": 220623, \"label\": \"长白朝鲜族自治县\"},\n" +
            "      {\"key\": 220681, \"label\": \"临江市\"}\n" +
            "    ],\n" +
            "    \"220700\": [\n" +
            "      {\"key\": 220701, \"label\": \"松原市市辖区\"},\n" +
            "      {\"key\": 220702, \"label\": \"宁江区\"},\n" +
            "      {\"key\": 220721, \"label\": \"前郭尔罗斯蒙古族自治县\"},\n" +
            "      {\"key\": 220722, \"label\": \"长岭县\"},\n" +
            "      {\"key\": 220723, \"label\": \"乾安县\"},\n" +
            "      {\"key\": 220781, \"label\": \"扶余市\"}\n" +
            "    ],\n" +
            "    \"220800\": [\n" +
            "      {\"key\": 220801, \"label\": \"白城市市辖区\"},\n" +
            "      {\"key\": 220802, \"label\": \"洮北区\"},\n" +
            "      {\"key\": 220821, \"label\": \"镇赉县\"},\n" +
            "      {\"key\": 220822, \"label\": \"通榆县\"},\n" +
            "      {\"key\": 220881, \"label\": \"洮南市\"},\n" +
            "      {\"key\": 220882, \"label\": \"大安市\"}\n" +
            "    ],\n" +
            "    \"222400\": [\n" +
            "      {\"key\": 222401, \"label\": \"延吉市\"},\n" +
            "      {\"key\": 222402, \"label\": \"图们市\"},\n" +
            "      {\"key\": 222403, \"label\": \"敦化市\"},\n" +
            "      {\"key\": 222404, \"label\": \"珲春市\"},\n" +
            "      {\"key\": 222405, \"label\": \"龙井市\"},\n" +
            "      {\"key\": 222406, \"label\": \"和龙市\"},\n" +
            "      {\"key\": 222424, \"label\": \"汪清县\"},\n" +
            "      {\"key\": 222426, \"label\": \"安图县\"}\n" +
            "    ],\n" +
            "    \"230100\": [\n" +
            "      {\"key\": 230101, \"label\": \"哈尔滨市市辖区\"},\n" +
            "      {\"key\": 230102, \"label\": \"道里区\"},\n" +
            "      {\"key\": 230103, \"label\": \"南岗区\"},\n" +
            "      {\"key\": 230104, \"label\": \"道外区\"},\n" +
            "      {\"key\": 230108, \"label\": \"平房区\"},\n" +
            "      {\"key\": 230109, \"label\": \"松北区\"},\n" +
            "      {\"key\": 230110, \"label\": \"香坊区\"},\n" +
            "      {\"key\": 230111, \"label\": \"呼兰区\"},\n" +
            "      {\"key\": 230112, \"label\": \"阿城区\"},\n" +
            "      {\"key\": 230113, \"label\": \"双城区\"},\n" +
            "      {\"key\": 230123, \"label\": \"依兰县\"},\n" +
            "      {\"key\": 230124, \"label\": \"方正县\"},\n" +
            "      {\"key\": 230125, \"label\": \"宾县\"},\n" +
            "      {\"key\": 230126, \"label\": \"巴彦县\"},\n" +
            "      {\"key\": 230127, \"label\": \"木兰县\"},\n" +
            "      {\"key\": 230128, \"label\": \"通河县\"},\n" +
            "      {\"key\": 230129, \"label\": \"延寿县\"},\n" +
            "      {\"key\": 230183, \"label\": \"尚志市\"},\n" +
            "      {\"key\": 230184, \"label\": \"五常市\"}\n" +
            "    ],\n" +
            "    \"230200\": [\n" +
            "      {\"key\": 230201, \"label\": \"齐齐哈尔市市辖区\"},\n" +
            "      {\"key\": 230202, \"label\": \"龙沙区\"},\n" +
            "      {\"key\": 230203, \"label\": \"建华区\"},\n" +
            "      {\"key\": 230204, \"label\": \"铁锋区\"},\n" +
            "      {\"key\": 230205, \"label\": \"昂昂溪区\"},\n" +
            "      {\"key\": 230206, \"label\": \"富拉尔基区\"},\n" +
            "      {\"key\": 230207, \"label\": \"碾子山区\"},\n" +
            "      {\"key\": 230208, \"label\": \"梅里斯达斡尔族区\"},\n" +
            "      {\"key\": 230221, \"label\": \"龙江县\"},\n" +
            "      {\"key\": 230223, \"label\": \"依安县\"},\n" +
            "      {\"key\": 230224, \"label\": \"泰来县\"},\n" +
            "      {\"key\": 230225, \"label\": \"甘南县\"},\n" +
            "      {\"key\": 230227, \"label\": \"富裕县\"},\n" +
            "      {\"key\": 230229, \"label\": \"克山县\"},\n" +
            "      {\"key\": 230230, \"label\": \"克东县\"},\n" +
            "      {\"key\": 230231, \"label\": \"拜泉县\"},\n" +
            "      {\"key\": 230281, \"label\": \"讷河市\"}\n" +
            "    ],\n" +
            "    \"230300\": [\n" +
            "      {\"key\": 230301, \"label\": \"鸡西市市辖区\"},\n" +
            "      {\"key\": 230302, \"label\": \"鸡冠区\"},\n" +
            "      {\"key\": 230303, \"label\": \"恒山区\"},\n" +
            "      {\"key\": 230304, \"label\": \"滴道区\"},\n" +
            "      {\"key\": 230305, \"label\": \"梨树区\"},\n" +
            "      {\"key\": 230306, \"label\": \"城子河区\"},\n" +
            "      {\"key\": 230307, \"label\": \"麻山区\"},\n" +
            "      {\"key\": 230321, \"label\": \"鸡东县\"},\n" +
            "      {\"key\": 230381, \"label\": \"虎林市\"},\n" +
            "      {\"key\": 230382, \"label\": \"密山市\"}\n" +
            "    ],\n" +
            "    \"230400\": [\n" +
            "      {\"key\": 230401, \"label\": \"鹤岗市市辖区\"},\n" +
            "      {\"key\": 230402, \"label\": \"向阳区\"},\n" +
            "      {\"key\": 230403, \"label\": \"工农区\"},\n" +
            "      {\"key\": 230404, \"label\": \"南山区\"},\n" +
            "      {\"key\": 230405, \"label\": \"兴安区\"},\n" +
            "      {\"key\": 230406, \"label\": \"东山区\"},\n" +
            "      {\"key\": 230407, \"label\": \"兴山区\"},\n" +
            "      {\"key\": 230421, \"label\": \"萝北县\"},\n" +
            "      {\"key\": 230422, \"label\": \"绥滨县\"}\n" +
            "    ],\n" +
            "    \"230500\": [\n" +
            "      {\"key\": 230501, \"label\": \"双鸭山市市辖区\"},\n" +
            "      {\"key\": 230502, \"label\": \"尖山区\"},\n" +
            "      {\"key\": 230503, \"label\": \"岭东区\"},\n" +
            "      {\"key\": 230505, \"label\": \"四方台区\"},\n" +
            "      {\"key\": 230506, \"label\": \"宝山区\"},\n" +
            "      {\"key\": 230521, \"label\": \"集贤县\"},\n" +
            "      {\"key\": 230522, \"label\": \"友谊县\"},\n" +
            "      {\"key\": 230523, \"label\": \"宝清县\"},\n" +
            "      {\"key\": 230524, \"label\": \"饶河县\"}\n" +
            "    ],\n" +
            "    \"230600\": [\n" +
            "      {\"key\": 230601, \"label\": \"大庆市市辖区\"},\n" +
            "      {\"key\": 230602, \"label\": \"萨尔图区\"},\n" +
            "      {\"key\": 230603, \"label\": \"龙凤区\"},\n" +
            "      {\"key\": 230604, \"label\": \"让胡路区\"},\n" +
            "      {\"key\": 230605, \"label\": \"红岗区\"},\n" +
            "      {\"key\": 230606, \"label\": \"大同区\"},\n" +
            "      {\"key\": 230621, \"label\": \"肇州县\"},\n" +
            "      {\"key\": 230622, \"label\": \"肇源县\"},\n" +
            "      {\"key\": 230623, \"label\": \"林甸县\"},\n" +
            "      {\"key\": 230624, \"label\": \"杜尔伯特蒙古族自治县\"}\n" +
            "    ],\n" +
            "    \"230700\": [\n" +
            "      {\"key\": 230701, \"label\": \"伊春市市辖区\"},\n" +
            "      {\"key\": 230702, \"label\": \"伊春区\"},\n" +
            "      {\"key\": 230703, \"label\": \"南岔区\"},\n" +
            "      {\"key\": 230704, \"label\": \"友好区\"},\n" +
            "      {\"key\": 230705, \"label\": \"西林区\"},\n" +
            "      {\"key\": 230706, \"label\": \"翠峦区\"},\n" +
            "      {\"key\": 230707, \"label\": \"新青区\"},\n" +
            "      {\"key\": 230708, \"label\": \"美溪区\"},\n" +
            "      {\"key\": 230709, \"label\": \"金山屯区\"},\n" +
            "      {\"key\": 230710, \"label\": \"五营区\"},\n" +
            "      {\"key\": 230711, \"label\": \"乌马河区\"},\n" +
            "      {\"key\": 230712, \"label\": \"汤旺河区\"},\n" +
            "      {\"key\": 230713, \"label\": \"带岭区\"},\n" +
            "      {\"key\": 230714, \"label\": \"乌伊岭区\"},\n" +
            "      {\"key\": 230715, \"label\": \"红星区\"},\n" +
            "      {\"key\": 230716, \"label\": \"上甘岭区\"},\n" +
            "      {\"key\": 230722, \"label\": \"嘉荫县\"},\n" +
            "      {\"key\": 230781, \"label\": \"铁力市\"}\n" +
            "    ],\n" +
            "    \"230800\": [\n" +
            "      {\"key\": 230801, \"label\": \"佳木斯市市辖区\"},\n" +
            "      {\"key\": 230803, \"label\": \"向阳区\"},\n" +
            "      {\"key\": 230804, \"label\": \"前进区\"},\n" +
            "      {\"key\": 230805, \"label\": \"东风区\"},\n" +
            "      {\"key\": 230811, \"label\": \"郊区\"},\n" +
            "      {\"key\": 230822, \"label\": \"桦南县\"},\n" +
            "      {\"key\": 230826, \"label\": \"桦川县\"},\n" +
            "      {\"key\": 230828, \"label\": \"汤原县\"},\n" +
            "      {\"key\": 230881, \"label\": \"同江市\"},\n" +
            "      {\"key\": 230882, \"label\": \"富锦市\"},\n" +
            "      {\"key\": 230883, \"label\": \"抚远市\"}\n" +
            "    ],\n" +
            "    \"230900\": [\n" +
            "      {\"key\": 230901, \"label\": \"七台河市市辖区\"},\n" +
            "      {\"key\": 230902, \"label\": \"新兴区\"},\n" +
            "      {\"key\": 230903, \"label\": \"桃山区\"},\n" +
            "      {\"key\": 230904, \"label\": \"茄子河区\"},\n" +
            "      {\"key\": 230921, \"label\": \"勃利县\"}\n" +
            "    ],\n" +
            "    \"231000\": [\n" +
            "      {\"key\": 231001, \"label\": \"牡丹江市市辖区\"},\n" +
            "      {\"key\": 231002, \"label\": \"东安区\"},\n" +
            "      {\"key\": 231003, \"label\": \"阳明区\"},\n" +
            "      {\"key\": 231004, \"label\": \"爱民区\"},\n" +
            "      {\"key\": 231005, \"label\": \"西安区\"},\n" +
            "      {\"key\": 231025, \"label\": \"林口县\"},\n" +
            "      {\"key\": 231081, \"label\": \"绥芬河市\"},\n" +
            "      {\"key\": 231083, \"label\": \"海林市\"},\n" +
            "      {\"key\": 231084, \"label\": \"宁安市\"},\n" +
            "      {\"key\": 231085, \"label\": \"穆棱市\"},\n" +
            "      {\"key\": 231086, \"label\": \"东宁市\"}\n" +
            "    ],\n" +
            "    \"231100\": [\n" +
            "      {\"key\": 231101, \"label\": \"黑河市市辖区\"},\n" +
            "      {\"key\": 231102, \"label\": \"爱辉区\"},\n" +
            "      {\"key\": 231121, \"label\": \"嫩江县\"},\n" +
            "      {\"key\": 231123, \"label\": \"逊克县\"},\n" +
            "      {\"key\": 231124, \"label\": \"孙吴县\"},\n" +
            "      {\"key\": 231181, \"label\": \"北安市\"},\n" +
            "      {\"key\": 231182, \"label\": \"五大连池市\"}\n" +
            "    ],\n" +
            "    \"231200\": [\n" +
            "      {\"key\": 231201, \"label\": \"绥化市市辖区\"},\n" +
            "      {\"key\": 231202, \"label\": \"北林区\"},\n" +
            "      {\"key\": 231221, \"label\": \"望奎县\"},\n" +
            "      {\"key\": 231222, \"label\": \"兰西县\"},\n" +
            "      {\"key\": 231223, \"label\": \"青冈县\"},\n" +
            "      {\"key\": 231224, \"label\": \"庆安县\"},\n" +
            "      {\"key\": 231225, \"label\": \"明水县\"},\n" +
            "      {\"key\": 231226, \"label\": \"绥棱县\"},\n" +
            "      {\"key\": 231281, \"label\": \"安达市\"},\n" +
            "      {\"key\": 231282, \"label\": \"肇东市\"},\n" +
            "      {\"key\": 231283, \"label\": \"海伦市\"}\n" +
            "    ],\n" +
            "    \"232700\": [\n" +
            "      {\"key\": 232718, \"label\": \"加格达奇区\"},\n" +
            "      {\"key\": 232721, \"label\": \"呼玛县\"},\n" +
            "      {\"key\": 232722, \"label\": \"塔河县\"},\n" +
            "      {\"key\": 232701, \"label\": \"漠河市\"}\n" +
            "    ],\n" +
            "    \"310100\": [\n" +
            "      {\"key\": 310101, \"label\": \"黄浦区\"},\n" +
            "      {\"key\": 310104, \"label\": \"徐汇区\"},\n" +
            "      {\"key\": 310105, \"label\": \"长宁区\"},\n" +
            "      {\"key\": 310106, \"label\": \"静安区\"},\n" +
            "      {\"key\": 310107, \"label\": \"普陀区\"},\n" +
            "      {\"key\": 310109, \"label\": \"虹口区\"},\n" +
            "      {\"key\": 310110, \"label\": \"杨浦区\"},\n" +
            "      {\"key\": 310112, \"label\": \"闵行区\"},\n" +
            "      {\"key\": 310113, \"label\": \"宝山区\"},\n" +
            "      {\"key\": 310114, \"label\": \"嘉定区\"},\n" +
            "      {\"key\": 310115, \"label\": \"浦东新区\"},\n" +
            "      {\"key\": 310116, \"label\": \"金山区\"},\n" +
            "      {\"key\": 310117, \"label\": \"松江区\"},\n" +
            "      {\"key\": 310118, \"label\": \"青浦区\"},\n" +
            "      {\"key\": 310120, \"label\": \"奉贤区\"},\n" +
            "      {\"key\": 310151, \"label\": \"崇明区\"}\n" +
            "    ],\n" +
            "    \"320100\": [\n" +
            "      {\"key\": 320101, \"label\": \"南京市市辖区\"},\n" +
            "      {\"key\": 320102, \"label\": \"玄武区\"},\n" +
            "      {\"key\": 320104, \"label\": \"秦淮区\"},\n" +
            "      {\"key\": 320105, \"label\": \"建邺区\"},\n" +
            "      {\"key\": 320106, \"label\": \"鼓楼区\"},\n" +
            "      {\"key\": 320111, \"label\": \"浦口区\"},\n" +
            "      {\"key\": 320113, \"label\": \"栖霞区\"},\n" +
            "      {\"key\": 320114, \"label\": \"雨花台区\"},\n" +
            "      {\"key\": 320115, \"label\": \"江宁区\"},\n" +
            "      {\"key\": 320116, \"label\": \"六合区\"},\n" +
            "      {\"key\": 320117, \"label\": \"溧水区\"},\n" +
            "      {\"key\": 320118, \"label\": \"高淳区\"}\n" +
            "    ],\n" +
            "    \"320200\": [\n" +
            "      {\"key\": 320201, \"label\": \"无锡市市辖区\"},\n" +
            "      {\"key\": 320205, \"label\": \"锡山区\"},\n" +
            "      {\"key\": 320206, \"label\": \"惠山区\"},\n" +
            "      {\"key\": 320211, \"label\": \"滨湖区\"},\n" +
            "      {\"key\": 320213, \"label\": \"梁溪区\"},\n" +
            "      {\"key\": 320214, \"label\": \"新吴区\"},\n" +
            "      {\"key\": 320281, \"label\": \"江阴市\"},\n" +
            "      {\"key\": 320282, \"label\": \"宜兴市\"}\n" +
            "    ],\n" +
            "    \"320300\": [\n" +
            "      {\"key\": 320301, \"label\": \"徐州市市辖区\"},\n" +
            "      {\"key\": 320302, \"label\": \"鼓楼区\"},\n" +
            "      {\"key\": 320303, \"label\": \"云龙区\"},\n" +
            "      {\"key\": 320305, \"label\": \"贾汪区\"},\n" +
            "      {\"key\": 320311, \"label\": \"泉山区\"},\n" +
            "      {\"key\": 320312, \"label\": \"铜山区\"},\n" +
            "      {\"key\": 320321, \"label\": \"丰县\"},\n" +
            "      {\"key\": 320322, \"label\": \"沛县\"},\n" +
            "      {\"key\": 320324, \"label\": \"睢宁县\"},\n" +
            "      {\"key\": 320381, \"label\": \"新沂市\"},\n" +
            "      {\"key\": 320382, \"label\": \"邳州市\"}\n" +
            "    ],\n" +
            "    \"320400\": [\n" +
            "      {\"key\": 320401, \"label\": \"常州市市辖区\"},\n" +
            "      {\"key\": 320402, \"label\": \"天宁区\"},\n" +
            "      {\"key\": 320404, \"label\": \"钟楼区\"},\n" +
            "      {\"key\": 320411, \"label\": \"新北区\"},\n" +
            "      {\"key\": 320412, \"label\": \"武进区\"},\n" +
            "      {\"key\": 320413, \"label\": \"金坛区\"},\n" +
            "      {\"key\": 320481, \"label\": \"溧阳市\"}\n" +
            "    ],\n" +
            "    \"320500\": [\n" +
            "      {\"key\": 320501, \"label\": \"苏州市市辖区\"},\n" +
            "      {\"key\": 320505, \"label\": \"虎丘区\"},\n" +
            "      {\"key\": 320506, \"label\": \"吴中区\"},\n" +
            "      {\"key\": 320507, \"label\": \"相城区\"},\n" +
            "      {\"key\": 320508, \"label\": \"姑苏区\"},\n" +
            "      {\"key\": 320509, \"label\": \"吴江区\"},\n" +
            "      {\"key\": 320571, \"label\": \"苏州工业园区\"},\n" +
            "      {\"key\": 320581, \"label\": \"常熟市\"},\n" +
            "      {\"key\": 320582, \"label\": \"张家港市\"},\n" +
            "      {\"key\": 320583, \"label\": \"昆山市\"},\n" +
            "      {\"key\": 320585, \"label\": \"太仓市\"}\n" +
            "    ],\n" +
            "    \"320600\": [\n" +
            "      {\"key\": 320601, \"label\": \"南通市市辖区\"},\n" +
            "      {\"key\": 320602, \"label\": \"崇川区\"},\n" +
            "      {\"key\": 320611, \"label\": \"港闸区\"},\n" +
            "      {\"key\": 320612, \"label\": \"通州区\"},\n" +
            "      {\"key\": 320685, \"label\": \"海安市\"},\n" +
            "      {\"key\": 320623, \"label\": \"如东县\"},\n" +
            "      {\"key\": 320681, \"label\": \"启东市\"},\n" +
            "      {\"key\": 320682, \"label\": \"如皋市\"},\n" +
            "      {\"key\": 320684, \"label\": \"海门市\"}\n" +
            "    ],\n" +
            "    \"320700\": [\n" +
            "      {\"key\": 320701, \"label\": \"连云港市市辖区\"},\n" +
            "      {\"key\": 320703, \"label\": \"连云区\"},\n" +
            "      {\"key\": 320706, \"label\": \"海州区\"},\n" +
            "      {\"key\": 320707, \"label\": \"赣榆区\"},\n" +
            "      {\"key\": 320722, \"label\": \"东海县\"},\n" +
            "      {\"key\": 320723, \"label\": \"灌云县\"},\n" +
            "      {\"key\": 320724, \"label\": \"灌南县\"}\n" +
            "    ],\n" +
            "    \"320800\": [\n" +
            "      {\"key\": 320801, \"label\": \"淮安市市辖区\"},\n" +
            "      {\"key\": 320803, \"label\": \"淮安区\"},\n" +
            "      {\"key\": 320804, \"label\": \"淮阴区\"},\n" +
            "      {\"key\": 320812, \"label\": \"清江浦区\"},\n" +
            "      {\"key\": 320813, \"label\": \"洪泽区\"},\n" +
            "      {\"key\": 320826, \"label\": \"涟水县\"},\n" +
            "      {\"key\": 320830, \"label\": \"盱眙县\"},\n" +
            "      {\"key\": 320831, \"label\": \"金湖县\"}\n" +
            "    ],\n" +
            "    \"320900\": [\n" +
            "      {\"key\": 320901, \"label\": \"盐城市市辖区\"},\n" +
            "      {\"key\": 320902, \"label\": \"亭湖区\"},\n" +
            "      {\"key\": 320903, \"label\": \"盐都区\"},\n" +
            "      {\"key\": 320904, \"label\": \"大丰区\"},\n" +
            "      {\"key\": 320921, \"label\": \"响水县\"},\n" +
            "      {\"key\": 320922, \"label\": \"滨海县\"},\n" +
            "      {\"key\": 320923, \"label\": \"阜宁县\"},\n" +
            "      {\"key\": 320924, \"label\": \"射阳县\"},\n" +
            "      {\"key\": 320925, \"label\": \"建湖县\"},\n" +
            "      {\"key\": 320981, \"label\": \"东台市\"}\n" +
            "    ],\n" +
            "    \"321000\": [\n" +
            "      {\"key\": 321001, \"label\": \"扬州市市辖区\"},\n" +
            "      {\"key\": 321002, \"label\": \"广陵区\"},\n" +
            "      {\"key\": 321003, \"label\": \"邗江区\"},\n" +
            "      {\"key\": 321012, \"label\": \"江都区\"},\n" +
            "      {\"key\": 321023, \"label\": \"宝应县\"},\n" +
            "      {\"key\": 321081, \"label\": \"仪征市\"},\n" +
            "      {\"key\": 321084, \"label\": \"高邮市\"}\n" +
            "    ],\n" +
            "    \"321100\": [\n" +
            "      {\"key\": 321101, \"label\": \"镇江市市辖区\"},\n" +
            "      {\"key\": 321102, \"label\": \"京口区\"},\n" +
            "      {\"key\": 321111, \"label\": \"润州区\"},\n" +
            "      {\"key\": 321112, \"label\": \"丹徒区\"},\n" +
            "      {\"key\": 321181, \"label\": \"丹阳市\"},\n" +
            "      {\"key\": 321182, \"label\": \"扬中市\"},\n" +
            "      {\"key\": 321183, \"label\": \"句容市\"}\n" +
            "    ],\n" +
            "    \"321200\": [\n" +
            "      {\"key\": 321201, \"label\": \"泰州市市辖区\"},\n" +
            "      {\"key\": 321202, \"label\": \"海陵区\"},\n" +
            "      {\"key\": 321203, \"label\": \"高港区\"},\n" +
            "      {\"key\": 321204, \"label\": \"姜堰区\"},\n" +
            "      {\"key\": 321281, \"label\": \"兴化市\"},\n" +
            "      {\"key\": 321282, \"label\": \"靖江市\"},\n" +
            "      {\"key\": 321283, \"label\": \"泰兴市\"}\n" +
            "    ],\n" +
            "    \"321300\": [\n" +
            "      {\"key\": 321301, \"label\": \"宿迁市市辖区\"},\n" +
            "      {\"key\": 321302, \"label\": \"宿城区\"},\n" +
            "      {\"key\": 321311, \"label\": \"宿豫区\"},\n" +
            "      {\"key\": 321322, \"label\": \"沭阳县\"},\n" +
            "      {\"key\": 321323, \"label\": \"泗阳县\"},\n" +
            "      {\"key\": 321324, \"label\": \"泗洪县\"}\n" +
            "    ],\n" +
            "    \"330100\": [\n" +
            "      {\"key\": 330101, \"label\": \"杭州市市辖区\"},\n" +
            "      {\"key\": 330102, \"label\": \"上城区\"},\n" +
            "      {\"key\": 330103, \"label\": \"下城区\"},\n" +
            "      {\"key\": 330104, \"label\": \"江干区\"},\n" +
            "      {\"key\": 330105, \"label\": \"拱墅区\"},\n" +
            "      {\"key\": 330106, \"label\": \"西湖区\"},\n" +
            "      {\"key\": 330108, \"label\": \"滨江区\"},\n" +
            "      {\"key\": 330109, \"label\": \"萧山区\"},\n" +
            "      {\"key\": 330110, \"label\": \"余杭区\"},\n" +
            "      {\"key\": 330111, \"label\": \"富阳区\"},\n" +
            "      {\"key\": 330112, \"label\": \"临安区\"},\n" +
            "      {\"key\": 330122, \"label\": \"桐庐县\"},\n" +
            "      {\"key\": 330127, \"label\": \"淳安县\"},\n" +
            "      {\"key\": 330182, \"label\": \"建德市\"}\n" +
            "    ],\n" +
            "    \"330200\": [\n" +
            "      {\"key\": 330201, \"label\": \"宁波市市辖区\"},\n" +
            "      {\"key\": 330203, \"label\": \"海曙区\"},\n" +
            "      {\"key\": 330205, \"label\": \"江北区\"},\n" +
            "      {\"key\": 330206, \"label\": \"北仑区\"},\n" +
            "      {\"key\": 330211, \"label\": \"镇海区\"},\n" +
            "      {\"key\": 330212, \"label\": \"鄞州区\"},\n" +
            "      {\"key\": 330213, \"label\": \"奉化区\"},\n" +
            "      {\"key\": 330225, \"label\": \"象山县\"},\n" +
            "      {\"key\": 330226, \"label\": \"宁海县\"},\n" +
            "      {\"key\": 330281, \"label\": \"余姚市\"},\n" +
            "      {\"key\": 330282, \"label\": \"慈溪市\"}\n" +
            "    ],\n" +
            "    \"330300\": [\n" +
            "      {\"key\": 330301, \"label\": \"温州市市辖区\"},\n" +
            "      {\"key\": 330302, \"label\": \"鹿城区\"},\n" +
            "      {\"key\": 330303, \"label\": \"龙湾区\"},\n" +
            "      {\"key\": 330304, \"label\": \"瓯海区\"},\n" +
            "      {\"key\": 330305, \"label\": \"洞头区\"},\n" +
            "      {\"key\": 330324, \"label\": \"永嘉县\"},\n" +
            "      {\"key\": 330326, \"label\": \"平阳县\"},\n" +
            "      {\"key\": 330327, \"label\": \"苍南县\"},\n" +
            "      {\"key\": 330328, \"label\": \"文成县\"},\n" +
            "      {\"key\": 330329, \"label\": \"泰顺县\"},\n" +
            "      {\"key\": 330381, \"label\": \"瑞安市\"},\n" +
            "      {\"key\": 330382, \"label\": \"乐清市\"}\n" +
            "    ],\n" +
            "    \"330400\": [\n" +
            "      {\"key\": 330401, \"label\": \"嘉兴市市辖区\"},\n" +
            "      {\"key\": 330402, \"label\": \"南湖区\"},\n" +
            "      {\"key\": 330411, \"label\": \"秀洲区\"},\n" +
            "      {\"key\": 330421, \"label\": \"嘉善县\"},\n" +
            "      {\"key\": 330424, \"label\": \"海盐县\"},\n" +
            "      {\"key\": 330481, \"label\": \"海宁市\"},\n" +
            "      {\"key\": 330482, \"label\": \"平湖市\"},\n" +
            "      {\"key\": 330483, \"label\": \"桐乡市\"}\n" +
            "    ],\n" +
            "    \"330500\": [\n" +
            "      {\"key\": 330501, \"label\": \"湖州市市辖区\"},\n" +
            "      {\"key\": 330502, \"label\": \"吴兴区\"},\n" +
            "      {\"key\": 330503, \"label\": \"南浔区\"},\n" +
            "      {\"key\": 330521, \"label\": \"德清县\"},\n" +
            "      {\"key\": 330522, \"label\": \"长兴县\"},\n" +
            "      {\"key\": 330523, \"label\": \"安吉县\"}\n" +
            "    ],\n" +
            "    \"330600\": [\n" +
            "      {\"key\": 330601, \"label\": \"绍兴市市辖区\"},\n" +
            "      {\"key\": 330602, \"label\": \"越城区\"},\n" +
            "      {\"key\": 330603, \"label\": \"柯桥区\"},\n" +
            "      {\"key\": 330604, \"label\": \"上虞区\"},\n" +
            "      {\"key\": 330624, \"label\": \"新昌县\"},\n" +
            "      {\"key\": 330681, \"label\": \"诸暨市\"},\n" +
            "      {\"key\": 330683, \"label\": \"嵊州市\"}\n" +
            "    ],\n" +
            "    \"330700\": [\n" +
            "      {\"key\": 330701, \"label\": \"金华市市辖区\"},\n" +
            "      {\"key\": 330702, \"label\": \"婺城区\"},\n" +
            "      {\"key\": 330703, \"label\": \"金东区\"},\n" +
            "      {\"key\": 330723, \"label\": \"武义县\"},\n" +
            "      {\"key\": 330726, \"label\": \"浦江县\"},\n" +
            "      {\"key\": 330727, \"label\": \"磐安县\"},\n" +
            "      {\"key\": 330781, \"label\": \"兰溪市\"},\n" +
            "      {\"key\": 330782, \"label\": \"义乌市\"},\n" +
            "      {\"key\": 330783, \"label\": \"东阳市\"},\n" +
            "      {\"key\": 330784, \"label\": \"永康市\"}\n" +
            "    ],\n" +
            "    \"330800\": [\n" +
            "      {\"key\": 330801, \"label\": \"衢州市市辖区\"},\n" +
            "      {\"key\": 330802, \"label\": \"柯城区\"},\n" +
            "      {\"key\": 330803, \"label\": \"衢江区\"},\n" +
            "      {\"key\": 330822, \"label\": \"常山县\"},\n" +
            "      {\"key\": 330824, \"label\": \"开化县\"},\n" +
            "      {\"key\": 330825, \"label\": \"龙游县\"},\n" +
            "      {\"key\": 330881, \"label\": \"江山市\"}\n" +
            "    ],\n" +
            "    \"330900\": [\n" +
            "      {\"key\": 330901, \"label\": \"舟山市市辖区\"},\n" +
            "      {\"key\": 330902, \"label\": \"定海区\"},\n" +
            "      {\"key\": 330903, \"label\": \"普陀区\"},\n" +
            "      {\"key\": 330921, \"label\": \"岱山县\"},\n" +
            "      {\"key\": 330922, \"label\": \"嵊泗县\"}\n" +
            "    ],\n" +
            "    \"331000\": [\n" +
            "      {\"key\": 331001, \"label\": \"台州市市辖区\"},\n" +
            "      {\"key\": 331002, \"label\": \"椒江区\"},\n" +
            "      {\"key\": 331003, \"label\": \"黄岩区\"},\n" +
            "      {\"key\": 331004, \"label\": \"路桥区\"},\n" +
            "      {\"key\": 331022, \"label\": \"三门县\"},\n" +
            "      {\"key\": 331023, \"label\": \"天台县\"},\n" +
            "      {\"key\": 331024, \"label\": \"仙居县\"},\n" +
            "      {\"key\": 331081, \"label\": \"温岭市\"},\n" +
            "      {\"key\": 331082, \"label\": \"临海市\"},\n" +
            "      {\"key\": 331083, \"label\": \"玉环市\"}\n" +
            "    ],\n" +
            "    \"331100\": [\n" +
            "      {\"key\": 331101, \"label\": \"丽水市市辖区\"},\n" +
            "      {\"key\": 331102, \"label\": \"莲都区\"},\n" +
            "      {\"key\": 331121, \"label\": \"青田县\"},\n" +
            "      {\"key\": 331122, \"label\": \"缙云县\"},\n" +
            "      {\"key\": 331123, \"label\": \"遂昌县\"},\n" +
            "      {\"key\": 331124, \"label\": \"松阳县\"},\n" +
            "      {\"key\": 331125, \"label\": \"云和县\"},\n" +
            "      {\"key\": 331126, \"label\": \"庆元县\"},\n" +
            "      {\"key\": 331127, \"label\": \"景宁畲族自治县\"},\n" +
            "      {\"key\": 331181, \"label\": \"龙泉市\"}\n" +
            "    ],\n" +
            "    \"340100\": [\n" +
            "      {\"key\": 340101, \"label\": \"合肥市市辖区\"},\n" +
            "      {\"key\": 340102, \"label\": \"瑶海区\"},\n" +
            "      {\"key\": 340103, \"label\": \"庐阳区\"},\n" +
            "      {\"key\": 340104, \"label\": \"蜀山区\"},\n" +
            "      {\"key\": 340111, \"label\": \"包河区\"},\n" +
            "      {\"key\": 340121, \"label\": \"长丰县\"},\n" +
            "      {\"key\": 340122, \"label\": \"肥东县\"},\n" +
            "      {\"key\": 340123, \"label\": \"肥西县\"},\n" +
            "      {\"key\": 340124, \"label\": \"庐江县\"},\n" +
            "      {\"key\": 340181, \"label\": \"巢湖市\"}\n" +
            "    ],\n" +
            "    \"340200\": [\n" +
            "      {\"key\": 340201, \"label\": \"芜湖市市辖区\"},\n" +
            "      {\"key\": 340202, \"label\": \"镜湖区\"},\n" +
            "      {\"key\": 340203, \"label\": \"弋江区\"},\n" +
            "      {\"key\": 340207, \"label\": \"鸠江区\"},\n" +
            "      {\"key\": 340208, \"label\": \"三山区\"},\n" +
            "      {\"key\": 340221, \"label\": \"芜湖县\"},\n" +
            "      {\"key\": 340222, \"label\": \"繁昌县\"},\n" +
            "      {\"key\": 340223, \"label\": \"南陵县\"},\n" +
            "      {\"key\": 340225, \"label\": \"无为县\"}\n" +
            "    ],\n" +
            "    \"340300\": [\n" +
            "      {\"key\": 340301, \"label\": \"蚌埠市市辖区\"},\n" +
            "      {\"key\": 340302, \"label\": \"龙子湖区\"},\n" +
            "      {\"key\": 340303, \"label\": \"蚌山区\"},\n" +
            "      {\"key\": 340304, \"label\": \"禹会区\"},\n" +
            "      {\"key\": 340311, \"label\": \"淮上区\"},\n" +
            "      {\"key\": 340321, \"label\": \"怀远县\"},\n" +
            "      {\"key\": 340322, \"label\": \"五河县\"},\n" +
            "      {\"key\": 340323, \"label\": \"固镇县\"}\n" +
            "    ],\n" +
            "    \"340400\": [\n" +
            "      {\"key\": 340401, \"label\": \"淮南市市辖区\"},\n" +
            "      {\"key\": 340402, \"label\": \"大通区\"},\n" +
            "      {\"key\": 340403, \"label\": \"田家庵区\"},\n" +
            "      {\"key\": 340404, \"label\": \"谢家集区\"},\n" +
            "      {\"key\": 340405, \"label\": \"八公山区\"},\n" +
            "      {\"key\": 340406, \"label\": \"潘集区\"},\n" +
            "      {\"key\": 340421, \"label\": \"凤台县\"},\n" +
            "      {\"key\": 340422, \"label\": \"寿县\"}\n" +
            "    ],\n" +
            "    \"340500\": [\n" +
            "      {\"key\": 340501, \"label\": \"马鞍山市市辖区\"},\n" +
            "      {\"key\": 340503, \"label\": \"花山区\"},\n" +
            "      {\"key\": 340504, \"label\": \"雨山区\"},\n" +
            "      {\"key\": 340506, \"label\": \"博望区\"},\n" +
            "      {\"key\": 340521, \"label\": \"当涂县\"},\n" +
            "      {\"key\": 340522, \"label\": \"含山县\"},\n" +
            "      {\"key\": 340523, \"label\": \"和县\"}\n" +
            "    ],\n" +
            "    \"340600\": [\n" +
            "      {\"key\": 340601, \"label\": \"淮北市市辖区\"},\n" +
            "      {\"key\": 340602, \"label\": \"杜集区\"},\n" +
            "      {\"key\": 340603, \"label\": \"相山区\"},\n" +
            "      {\"key\": 340604, \"label\": \"烈山区\"},\n" +
            "      {\"key\": 340621, \"label\": \"濉溪县\"}\n" +
            "    ],\n" +
            "    \"340700\": [\n" +
            "      {\"key\": 340701, \"label\": \"铜陵市市辖区\"},\n" +
            "      {\"key\": 340705, \"label\": \"铜官区\"},\n" +
            "      {\"key\": 340706, \"label\": \"义安区\"},\n" +
            "      {\"key\": 340711, \"label\": \"郊区\"},\n" +
            "      {\"key\": 340722, \"label\": \"枞阳县\"}\n" +
            "    ],\n" +
            "    \"340800\": [\n" +
            "      {\"key\": 340801, \"label\": \"安庆市市辖区\"},\n" +
            "      {\"key\": 340802, \"label\": \"迎江区\"},\n" +
            "      {\"key\": 340803, \"label\": \"大观区\"},\n" +
            "      {\"key\": 340811, \"label\": \"宜秀区\"},\n" +
            "      {\"key\": 340822, \"label\": \"怀宁县\"},\n" +
            "      {\"key\": 340882, \"label\": \"潜山市\"},\n" +
            "      {\"key\": 340825, \"label\": \"太湖县\"},\n" +
            "      {\"key\": 340826, \"label\": \"宿松县\"},\n" +
            "      {\"key\": 340827, \"label\": \"望江县\"},\n" +
            "      {\"key\": 340828, \"label\": \"岳西县\"},\n" +
            "      {\"key\": 340881, \"label\": \"桐城市\"}\n" +
            "    ],\n" +
            "    \"341000\": [\n" +
            "      {\"key\": 341001, \"label\": \"黄山市市辖区\"},\n" +
            "      {\"key\": 341002, \"label\": \"屯溪区\"},\n" +
            "      {\"key\": 341003, \"label\": \"黄山区\"},\n" +
            "      {\"key\": 341004, \"label\": \"徽州区\"},\n" +
            "      {\"key\": 341021, \"label\": \"歙县\"},\n" +
            "      {\"key\": 341022, \"label\": \"休宁县\"},\n" +
            "      {\"key\": 341023, \"label\": \"黟县\"},\n" +
            "      {\"key\": 341024, \"label\": \"祁门县\"}\n" +
            "    ],\n" +
            "    \"341100\": [\n" +
            "      {\"key\": 341101, \"label\": \"滁州市市辖区\"},\n" +
            "      {\"key\": 341102, \"label\": \"琅琊区\"},\n" +
            "      {\"key\": 341103, \"label\": \"南谯区\"},\n" +
            "      {\"key\": 341122, \"label\": \"来安县\"},\n" +
            "      {\"key\": 341124, \"label\": \"全椒县\"},\n" +
            "      {\"key\": 341125, \"label\": \"定远县\"},\n" +
            "      {\"key\": 341126, \"label\": \"凤阳县\"},\n" +
            "      {\"key\": 341181, \"label\": \"天长市\"},\n" +
            "      {\"key\": 341182, \"label\": \"明光市\"}\n" +
            "    ],\n" +
            "    \"341200\": [\n" +
            "      {\"key\": 341201, \"label\": \"阜阳市市辖区\"},\n" +
            "      {\"key\": 341202, \"label\": \"颍州区\"},\n" +
            "      {\"key\": 341203, \"label\": \"颍东区\"},\n" +
            "      {\"key\": 341204, \"label\": \"颍泉区\"},\n" +
            "      {\"key\": 341221, \"label\": \"临泉县\"},\n" +
            "      {\"key\": 341222, \"label\": \"太和县\"},\n" +
            "      {\"key\": 341225, \"label\": \"阜南县\"},\n" +
            "      {\"key\": 341226, \"label\": \"颍上县\"},\n" +
            "      {\"key\": 341282, \"label\": \"界首市\"}\n" +
            "    ],\n" +
            "    \"341300\": [\n" +
            "      {\"key\": 341301, \"label\": \"宿州市市辖区\"},\n" +
            "      {\"key\": 341302, \"label\": \"埇桥区\"},\n" +
            "      {\"key\": 341321, \"label\": \"砀山县\"},\n" +
            "      {\"key\": 341322, \"label\": \"萧县\"},\n" +
            "      {\"key\": 341323, \"label\": \"灵璧县\"},\n" +
            "      {\"key\": 341324, \"label\": \"泗县\"}\n" +
            "    ],\n" +
            "    \"341500\": [\n" +
            "      {\"key\": 341501, \"label\": \"六安市市辖区\"},\n" +
            "      {\"key\": 341502, \"label\": \"金安区\"},\n" +
            "      {\"key\": 341503, \"label\": \"裕安区\"},\n" +
            "      {\"key\": 341504, \"label\": \"叶集区\"},\n" +
            "      {\"key\": 341522, \"label\": \"霍邱县\"},\n" +
            "      {\"key\": 341523, \"label\": \"舒城县\"},\n" +
            "      {\"key\": 341524, \"label\": \"金寨县\"},\n" +
            "      {\"key\": 341525, \"label\": \"霍山县\"}\n" +
            "    ],\n" +
            "    \"341600\": [\n" +
            "      {\"key\": 341601, \"label\": \"亳州市市辖区\"},\n" +
            "      {\"key\": 341602, \"label\": \"谯城区\"},\n" +
            "      {\"key\": 341621, \"label\": \"涡阳县\"},\n" +
            "      {\"key\": 341622, \"label\": \"蒙城县\"},\n" +
            "      {\"key\": 341623, \"label\": \"利辛县\"}\n" +
            "    ],\n" +
            "    \"341700\": [\n" +
            "      {\"key\": 341701, \"label\": \"池州市市辖区\"},\n" +
            "      {\"key\": 341702, \"label\": \"贵池区\"},\n" +
            "      {\"key\": 341721, \"label\": \"东至县\"},\n" +
            "      {\"key\": 341722, \"label\": \"石台县\"},\n" +
            "      {\"key\": 341723, \"label\": \"青阳县\"}\n" +
            "    ],\n" +
            "    \"341800\": [\n" +
            "      {\"key\": 341801, \"label\": \"宣城市市辖区\"},\n" +
            "      {\"key\": 341802, \"label\": \"宣州区\"},\n" +
            "      {\"key\": 341821, \"label\": \"郎溪县\"},\n" +
            "      {\"key\": 341822, \"label\": \"广德县\"},\n" +
            "      {\"key\": 341823, \"label\": \"泾县\"},\n" +
            "      {\"key\": 341824, \"label\": \"绩溪县\"},\n" +
            "      {\"key\": 341825, \"label\": \"旌德县\"},\n" +
            "      {\"key\": 341881, \"label\": \"宁国市\"}\n" +
            "    ],\n" +
            "    \"350100\": [\n" +
            "      {\"key\": 350101, \"label\": \"福州市市辖区\"},\n" +
            "      {\"key\": 350102, \"label\": \"鼓楼区\"},\n" +
            "      {\"key\": 350103, \"label\": \"台江区\"},\n" +
            "      {\"key\": 350104, \"label\": \"仓山区\"},\n" +
            "      {\"key\": 350105, \"label\": \"马尾区\"},\n" +
            "      {\"key\": 350111, \"label\": \"晋安区\"},\n" +
            "      {\"key\": 350112, \"label\": \"长乐区\"},\n" +
            "      {\"key\": 350121, \"label\": \"闽侯县\"},\n" +
            "      {\"key\": 350122, \"label\": \"连江县\"},\n" +
            "      {\"key\": 350123, \"label\": \"罗源县\"},\n" +
            "      {\"key\": 350124, \"label\": \"闽清县\"},\n" +
            "      {\"key\": 350125, \"label\": \"永泰县\"},\n" +
            "      {\"key\": 350128, \"label\": \"平潭县\"},\n" +
            "      {\"key\": 350181, \"label\": \"福清市\"}\n" +
            "    ],\n" +
            "    \"350200\": [\n" +
            "      {\"key\": 350201, \"label\": \"厦门市市辖区\"},\n" +
            "      {\"key\": 350203, \"label\": \"思明区\"},\n" +
            "      {\"key\": 350205, \"label\": \"海沧区\"},\n" +
            "      {\"key\": 350206, \"label\": \"湖里区\"},\n" +
            "      {\"key\": 350211, \"label\": \"集美区\"},\n" +
            "      {\"key\": 350212, \"label\": \"同安区\"},\n" +
            "      {\"key\": 350213, \"label\": \"翔安区\"}\n" +
            "    ],\n" +
            "    \"350300\": [\n" +
            "      {\"key\": 350301, \"label\": \"莆田市市辖区\"},\n" +
            "      {\"key\": 350302, \"label\": \"城厢区\"},\n" +
            "      {\"key\": 350303, \"label\": \"涵江区\"},\n" +
            "      {\"key\": 350304, \"label\": \"荔城区\"},\n" +
            "      {\"key\": 350305, \"label\": \"秀屿区\"},\n" +
            "      {\"key\": 350322, \"label\": \"仙游县\"}\n" +
            "    ],\n" +
            "    \"350400\": [\n" +
            "      {\"key\": 350401, \"label\": \"三明市市辖区\"},\n" +
            "      {\"key\": 350402, \"label\": \"梅列区\"},\n" +
            "      {\"key\": 350403, \"label\": \"三元区\"},\n" +
            "      {\"key\": 350421, \"label\": \"明溪县\"},\n" +
            "      {\"key\": 350423, \"label\": \"清流县\"},\n" +
            "      {\"key\": 350424, \"label\": \"宁化县\"},\n" +
            "      {\"key\": 350425, \"label\": \"大田县\"},\n" +
            "      {\"key\": 350426, \"label\": \"尤溪县\"},\n" +
            "      {\"key\": 350427, \"label\": \"沙县\"},\n" +
            "      {\"key\": 350428, \"label\": \"将乐县\"},\n" +
            "      {\"key\": 350429, \"label\": \"泰宁县\"},\n" +
            "      {\"key\": 350430, \"label\": \"建宁县\"},\n" +
            "      {\"key\": 350481, \"label\": \"永安市\"}\n" +
            "    ],\n" +
            "    \"350500\": [\n" +
            "      {\"key\": 350501, \"label\": \"泉州市市辖区\"},\n" +
            "      {\"key\": 350502, \"label\": \"鲤城区\"},\n" +
            "      {\"key\": 350503, \"label\": \"丰泽区\"},\n" +
            "      {\"key\": 350504, \"label\": \"洛江区\"},\n" +
            "      {\"key\": 350505, \"label\": \"泉港区\"},\n" +
            "      {\"key\": 350521, \"label\": \"惠安县\"},\n" +
            "      {\"key\": 350524, \"label\": \"安溪县\"},\n" +
            "      {\"key\": 350525, \"label\": \"永春县\"},\n" +
            "      {\"key\": 350526, \"label\": \"德化县\"},\n" +
            "      {\"key\": 350527, \"label\": \"金门县\"},\n" +
            "      {\"key\": 350581, \"label\": \"石狮市\"},\n" +
            "      {\"key\": 350582, \"label\": \"晋江市\"},\n" +
            "      {\"key\": 350583, \"label\": \"南安市\"}\n" +
            "    ],\n" +
            "    \"350600\": [\n" +
            "      {\"key\": 350601, \"label\": \"漳州市市辖区\"},\n" +
            "      {\"key\": 350602, \"label\": \"芗城区\"},\n" +
            "      {\"key\": 350603, \"label\": \"龙文区\"},\n" +
            "      {\"key\": 350622, \"label\": \"云霄县\"},\n" +
            "      {\"key\": 350623, \"label\": \"漳浦县\"},\n" +
            "      {\"key\": 350624, \"label\": \"诏安县\"},\n" +
            "      {\"key\": 350625, \"label\": \"长泰县\"},\n" +
            "      {\"key\": 350626, \"label\": \"东山县\"},\n" +
            "      {\"key\": 350627, \"label\": \"南靖县\"},\n" +
            "      {\"key\": 350628, \"label\": \"平和县\"},\n" +
            "      {\"key\": 350629, \"label\": \"华安县\"},\n" +
            "      {\"key\": 350681, \"label\": \"龙海市\"}\n" +
            "    ],\n" +
            "    \"350700\": [\n" +
            "      {\"key\": 350701, \"label\": \"南平市市辖区\"},\n" +
            "      {\"key\": 350702, \"label\": \"延平区\"},\n" +
            "      {\"key\": 350703, \"label\": \"建阳区\"},\n" +
            "      {\"key\": 350721, \"label\": \"顺昌县\"},\n" +
            "      {\"key\": 350722, \"label\": \"浦城县\"},\n" +
            "      {\"key\": 350723, \"label\": \"光泽县\"},\n" +
            "      {\"key\": 350724, \"label\": \"松溪县\"},\n" +
            "      {\"key\": 350725, \"label\": \"政和县\"},\n" +
            "      {\"key\": 350781, \"label\": \"邵武市\"},\n" +
            "      {\"key\": 350782, \"label\": \"武夷山市\"},\n" +
            "      {\"key\": 350783, \"label\": \"建瓯市\"}\n" +
            "    ],\n" +
            "    \"350800\": [\n" +
            "      {\"key\": 350801, \"label\": \"龙岩市市辖区\"},\n" +
            "      {\"key\": 350802, \"label\": \"新罗区\"},\n" +
            "      {\"key\": 350803, \"label\": \"永定区\"},\n" +
            "      {\"key\": 350821, \"label\": \"长汀县\"},\n" +
            "      {\"key\": 350823, \"label\": \"上杭县\"},\n" +
            "      {\"key\": 350824, \"label\": \"武平县\"},\n" +
            "      {\"key\": 350825, \"label\": \"连城县\"},\n" +
            "      {\"key\": 350881, \"label\": \"漳平市\"}\n" +
            "    ],\n" +
            "    \"350900\": [\n" +
            "      {\"key\": 350901, \"label\": \"宁德市市辖区\"},\n" +
            "      {\"key\": 350902, \"label\": \"蕉城区\"},\n" +
            "      {\"key\": 350921, \"label\": \"霞浦县\"},\n" +
            "      {\"key\": 350922, \"label\": \"古田县\"},\n" +
            "      {\"key\": 350923, \"label\": \"屏南县\"},\n" +
            "      {\"key\": 350924, \"label\": \"寿宁县\"},\n" +
            "      {\"key\": 350925, \"label\": \"周宁县\"},\n" +
            "      {\"key\": 350926, \"label\": \"柘荣县\"},\n" +
            "      {\"key\": 350981, \"label\": \"福安市\"},\n" +
            "      {\"key\": 350982, \"label\": \"福鼎市\"}\n" +
            "    ],\n" +
            "    \"360100\": [\n" +
            "      {\"key\": 360101, \"label\": \"南昌市市辖区\"},\n" +
            "      {\"key\": 360102, \"label\": \"东湖区\"},\n" +
            "      {\"key\": 360103, \"label\": \"西湖区\"},\n" +
            "      {\"key\": 360104, \"label\": \"青云谱区\"},\n" +
            "      {\"key\": 360105, \"label\": \"湾里区\"},\n" +
            "      {\"key\": 360111, \"label\": \"青山湖区\"},\n" +
            "      {\"key\": 360112, \"label\": \"新建区\"},\n" +
            "      {\"key\": 360121, \"label\": \"南昌县\"},\n" +
            "      {\"key\": 360123, \"label\": \"安义县\"},\n" +
            "      {\"key\": 360124, \"label\": \"进贤县\"}\n" +
            "    ],\n" +
            "    \"360200\": [\n" +
            "      {\"key\": 360201, \"label\": \"景德镇市市辖区\"},\n" +
            "      {\"key\": 360202, \"label\": \"昌江区\"},\n" +
            "      {\"key\": 360203, \"label\": \"珠山区\"},\n" +
            "      {\"key\": 360222, \"label\": \"浮梁县\"},\n" +
            "      {\"key\": 360281, \"label\": \"乐平市\"}\n" +
            "    ],\n" +
            "    \"360300\": [\n" +
            "      {\"key\": 360301, \"label\": \"萍乡市市辖区\"},\n" +
            "      {\"key\": 360302, \"label\": \"安源区\"},\n" +
            "      {\"key\": 360313, \"label\": \"湘东区\"},\n" +
            "      {\"key\": 360321, \"label\": \"莲花县\"},\n" +
            "      {\"key\": 360322, \"label\": \"上栗县\"},\n" +
            "      {\"key\": 360323, \"label\": \"芦溪县\"}\n" +
            "    ],\n" +
            "    \"360400\": [\n" +
            "      {\"key\": 360401, \"label\": \"九江市市辖区\"},\n" +
            "      {\"key\": 360402, \"label\": \"濂溪区\"},\n" +
            "      {\"key\": 360403, \"label\": \"浔阳区\"},\n" +
            "      {\"key\": 360404, \"label\": \"柴桑区\"},\n" +
            "      {\"key\": 360423, \"label\": \"武宁县\"},\n" +
            "      {\"key\": 360424, \"label\": \"修水县\"},\n" +
            "      {\"key\": 360425, \"label\": \"永修县\"},\n" +
            "      {\"key\": 360426, \"label\": \"德安县\"},\n" +
            "      {\"key\": 360428, \"label\": \"都昌县\"},\n" +
            "      {\"key\": 360429, \"label\": \"湖口县\"},\n" +
            "      {\"key\": 360430, \"label\": \"彭泽县\"},\n" +
            "      {\"key\": 360481, \"label\": \"瑞昌市\"},\n" +
            "      {\"key\": 360482, \"label\": \"共青城市\"},\n" +
            "      {\"key\": 360483, \"label\": \"庐山市\"}\n" +
            "    ],\n" +
            "    \"360500\": [\n" +
            "      {\"key\": 360501, \"label\": \"新余市市辖区\"},\n" +
            "      {\"key\": 360502, \"label\": \"渝水区\"},\n" +
            "      {\"key\": 360521, \"label\": \"分宜县\"}\n" +
            "    ],\n" +
            "    \"360600\": [\n" +
            "      {\"key\": 360601, \"label\": \"鹰潭市市辖区\"},\n" +
            "      {\"key\": 360602, \"label\": \"月湖区\"},\n" +
            "      {\"key\": 360603, \"label\": \"余江区\"},\n" +
            "      {\"key\": 360681, \"label\": \"贵溪市\"}\n" +
            "    ],\n" +
            "    \"360700\": [\n" +
            "      {\"key\": 360701, \"label\": \"赣州市市辖区\"},\n" +
            "      {\"key\": 360702, \"label\": \"章贡区\"},\n" +
            "      {\"key\": 360703, \"label\": \"南康区\"},\n" +
            "      {\"key\": 360704, \"label\": \"赣县区\"},\n" +
            "      {\"key\": 360722, \"label\": \"信丰县\"},\n" +
            "      {\"key\": 360723, \"label\": \"大余县\"},\n" +
            "      {\"key\": 360724, \"label\": \"上犹县\"},\n" +
            "      {\"key\": 360725, \"label\": \"崇义县\"},\n" +
            "      {\"key\": 360726, \"label\": \"安远县\"},\n" +
            "      {\"key\": 360727, \"label\": \"龙南县\"},\n" +
            "      {\"key\": 360728, \"label\": \"定南县\"},\n" +
            "      {\"key\": 360729, \"label\": \"全南县\"},\n" +
            "      {\"key\": 360730, \"label\": \"宁都县\"},\n" +
            "      {\"key\": 360731, \"label\": \"于都县\"},\n" +
            "      {\"key\": 360732, \"label\": \"兴国县\"},\n" +
            "      {\"key\": 360733, \"label\": \"会昌县\"},\n" +
            "      {\"key\": 360734, \"label\": \"寻乌县\"},\n" +
            "      {\"key\": 360735, \"label\": \"石城县\"},\n" +
            "      {\"key\": 360781, \"label\": \"瑞金市\"}\n" +
            "    ],\n" +
            "    \"360800\": [\n" +
            "      {\"key\": 360801, \"label\": \"吉安市市辖区\"},\n" +
            "      {\"key\": 360802, \"label\": \"吉州区\"},\n" +
            "      {\"key\": 360803, \"label\": \"青原区\"},\n" +
            "      {\"key\": 360821, \"label\": \"吉安县\"},\n" +
            "      {\"key\": 360822, \"label\": \"吉水县\"},\n" +
            "      {\"key\": 360823, \"label\": \"峡江县\"},\n" +
            "      {\"key\": 360824, \"label\": \"新干县\"},\n" +
            "      {\"key\": 360825, \"label\": \"永丰县\"},\n" +
            "      {\"key\": 360826, \"label\": \"泰和县\"},\n" +
            "      {\"key\": 360827, \"label\": \"遂川县\"},\n" +
            "      {\"key\": 360828, \"label\": \"万安县\"},\n" +
            "      {\"key\": 360829, \"label\": \"安福县\"},\n" +
            "      {\"key\": 360830, \"label\": \"永新县\"},\n" +
            "      {\"key\": 360881, \"label\": \"井冈山市\"}\n" +
            "    ],\n" +
            "    \"360900\": [\n" +
            "      {\"key\": 360901, \"label\": \"宜春市市辖区\"},\n" +
            "      {\"key\": 360902, \"label\": \"袁州区\"},\n" +
            "      {\"key\": 360921, \"label\": \"奉新县\"},\n" +
            "      {\"key\": 360922, \"label\": \"万载县\"},\n" +
            "      {\"key\": 360923, \"label\": \"上高县\"},\n" +
            "      {\"key\": 360924, \"label\": \"宜丰县\"},\n" +
            "      {\"key\": 360925, \"label\": \"靖安县\"},\n" +
            "      {\"key\": 360926, \"label\": \"铜鼓县\"},\n" +
            "      {\"key\": 360981, \"label\": \"丰城市\"},\n" +
            "      {\"key\": 360982, \"label\": \"樟树市\"},\n" +
            "      {\"key\": 360983, \"label\": \"高安市\"}\n" +
            "    ],\n" +
            "    \"361000\": [\n" +
            "      {\"key\": 361001, \"label\": \"抚州市市辖区\"},\n" +
            "      {\"key\": 361002, \"label\": \"临川区\"},\n" +
            "      {\"key\": 361003, \"label\": \"东乡区\"},\n" +
            "      {\"key\": 361021, \"label\": \"南城县\"},\n" +
            "      {\"key\": 361022, \"label\": \"黎川县\"},\n" +
            "      {\"key\": 361023, \"label\": \"南丰县\"},\n" +
            "      {\"key\": 361024, \"label\": \"崇仁县\"},\n" +
            "      {\"key\": 361025, \"label\": \"乐安县\"},\n" +
            "      {\"key\": 361026, \"label\": \"宜黄县\"},\n" +
            "      {\"key\": 361027, \"label\": \"金溪县\"},\n" +
            "      {\"key\": 361028, \"label\": \"资溪县\"},\n" +
            "      {\"key\": 361030, \"label\": \"广昌县\"}\n" +
            "    ],\n" +
            "    \"361100\": [\n" +
            "      {\"key\": 361101, \"label\": \"上饶市市辖区\"},\n" +
            "      {\"key\": 361102, \"label\": \"信州区\"},\n" +
            "      {\"key\": 361103, \"label\": \"广丰区\"},\n" +
            "      {\"key\": 361121, \"label\": \"上饶县\"},\n" +
            "      {\"key\": 361123, \"label\": \"玉山县\"},\n" +
            "      {\"key\": 361124, \"label\": \"铅山县\"},\n" +
            "      {\"key\": 361125, \"label\": \"横峰县\"},\n" +
            "      {\"key\": 361126, \"label\": \"弋阳县\"},\n" +
            "      {\"key\": 361127, \"label\": \"余干县\"},\n" +
            "      {\"key\": 361128, \"label\": \"鄱阳县\"},\n" +
            "      {\"key\": 361129, \"label\": \"万年县\"},\n" +
            "      {\"key\": 361130, \"label\": \"婺源县\"},\n" +
            "      {\"key\": 361181, \"label\": \"德兴市\"}\n" +
            "    ],\n" +
            "    \"370100\": [\n" +
            "      {\"key\": 370101, \"label\": \"济南市市辖区\"},\n" +
            "      {\"key\": 370102, \"label\": \"历下区\"},\n" +
            "      {\"key\": 370103, \"label\": \"市中区\"},\n" +
            "      {\"key\": 370104, \"label\": \"槐荫区\"},\n" +
            "      {\"key\": 370105, \"label\": \"天桥区\"},\n" +
            "      {\"key\": 370112, \"label\": \"历城区\"},\n" +
            "      {\"key\": 370113, \"label\": \"长清区\"},\n" +
            "      {\"key\": 370114, \"label\": \"章丘区\"},\n" +
            "      {\"key\": 370124, \"label\": \"平阴县\"},\n" +
            "      {\"key\": 370115, \"label\": \"济阳区\"},\n" +
            "      {\"key\": 370126, \"label\": \"商河县\"},\n" +
            "      {\"key\": 370116, \"label\": \"莱芜区\"},\n" +
            "      {\"key\": 370117, \"label\": \"钢城区\"}\n" +
            "    ],\n" +
            "    \"370200\": [\n" +
            "      {\"key\": 370201, \"label\": \"青岛市市辖区\"},\n" +
            "      {\"key\": 370202, \"label\": \"市南区\"},\n" +
            "      {\"key\": 370203, \"label\": \"市北区\"},\n" +
            "      {\"key\": 370211, \"label\": \"黄岛区\"},\n" +
            "      {\"key\": 370212, \"label\": \"崂山区\"},\n" +
            "      {\"key\": 370213, \"label\": \"李沧区\"},\n" +
            "      {\"key\": 370214, \"label\": \"城阳区\"},\n" +
            "      {\"key\": 370215, \"label\": \"即墨区\"},\n" +
            "      {\"key\": 370281, \"label\": \"胶州市\"},\n" +
            "      {\"key\": 370283, \"label\": \"平度市\"},\n" +
            "      {\"key\": 370285, \"label\": \"莱西市\"}\n" +
            "    ],\n" +
            "    \"370300\": [\n" +
            "      {\"key\": 370301, \"label\": \"淄博市市辖区\"},\n" +
            "      {\"key\": 370302, \"label\": \"淄川区\"},\n" +
            "      {\"key\": 370303, \"label\": \"张店区\"},\n" +
            "      {\"key\": 370304, \"label\": \"博山区\"},\n" +
            "      {\"key\": 370305, \"label\": \"临淄区\"},\n" +
            "      {\"key\": 370306, \"label\": \"周村区\"},\n" +
            "      {\"key\": 370321, \"label\": \"桓台县\"},\n" +
            "      {\"key\": 370322, \"label\": \"高青县\"},\n" +
            "      {\"key\": 370323, \"label\": \"沂源县\"}\n" +
            "    ],\n" +
            "    \"370400\": [\n" +
            "      {\"key\": 370401, \"label\": \"枣庄市市辖区\"},\n" +
            "      {\"key\": 370402, \"label\": \"市中区\"},\n" +
            "      {\"key\": 370403, \"label\": \"薛城区\"},\n" +
            "      {\"key\": 370404, \"label\": \"峄城区\"},\n" +
            "      {\"key\": 370405, \"label\": \"台儿庄区\"},\n" +
            "      {\"key\": 370406, \"label\": \"山亭区\"},\n" +
            "      {\"key\": 370481, \"label\": \"滕州市\"}\n" +
            "    ],\n" +
            "    \"370500\": [\n" +
            "      {\"key\": 370501, \"label\": \"东营市市辖区\"},\n" +
            "      {\"key\": 370502, \"label\": \"东营区\"},\n" +
            "      {\"key\": 370503, \"label\": \"河口区\"},\n" +
            "      {\"key\": 370505, \"label\": \"垦利区\"},\n" +
            "      {\"key\": 370522, \"label\": \"利津县\"},\n" +
            "      {\"key\": 370523, \"label\": \"广饶县\"}\n" +
            "    ],\n" +
            "    \"370600\": [\n" +
            "      {\"key\": 370601, \"label\": \"烟台市市辖区\"},\n" +
            "      {\"key\": 370602, \"label\": \"芝罘区\"},\n" +
            "      {\"key\": 370611, \"label\": \"福山区\"},\n" +
            "      {\"key\": 370612, \"label\": \"牟平区\"},\n" +
            "      {\"key\": 370613, \"label\": \"莱山区\"},\n" +
            "      {\"key\": 370634, \"label\": \"长岛县\"},\n" +
            "      {\"key\": 370681, \"label\": \"龙口市\"},\n" +
            "      {\"key\": 370682, \"label\": \"莱阳市\"},\n" +
            "      {\"key\": 370683, \"label\": \"莱州市\"},\n" +
            "      {\"key\": 370684, \"label\": \"蓬莱市\"},\n" +
            "      {\"key\": 370685, \"label\": \"招远市\"},\n" +
            "      {\"key\": 370686, \"label\": \"栖霞市\"},\n" +
            "      {\"key\": 370687, \"label\": \"海阳市\"}\n" +
            "    ],\n" +
            "    \"370700\": [\n" +
            "      {\"key\": 370701, \"label\": \"潍坊市市辖区\"},\n" +
            "      {\"key\": 370702, \"label\": \"潍城区\"},\n" +
            "      {\"key\": 370703, \"label\": \"寒亭区\"},\n" +
            "      {\"key\": 370704, \"label\": \"坊子区\"},\n" +
            "      {\"key\": 370705, \"label\": \"奎文区\"},\n" +
            "      {\"key\": 370724, \"label\": \"临朐县\"},\n" +
            "      {\"key\": 370725, \"label\": \"昌乐县\"},\n" +
            "      {\"key\": 370781, \"label\": \"青州市\"},\n" +
            "      {\"key\": 370782, \"label\": \"诸城市\"},\n" +
            "      {\"key\": 370783, \"label\": \"寿光市\"},\n" +
            "      {\"key\": 370784, \"label\": \"安丘市\"},\n" +
            "      {\"key\": 370785, \"label\": \"高密市\"},\n" +
            "      {\"key\": 370786, \"label\": \"昌邑市\"}\n" +
            "    ],\n" +
            "    \"370800\": [\n" +
            "      {\"key\": 370801, \"label\": \"济宁市市辖区\"},\n" +
            "      {\"key\": 370811, \"label\": \"任城区\"},\n" +
            "      {\"key\": 370812, \"label\": \"兖州区\"},\n" +
            "      {\"key\": 370826, \"label\": \"微山县\"},\n" +
            "      {\"key\": 370827, \"label\": \"鱼台县\"},\n" +
            "      {\"key\": 370828, \"label\": \"金乡县\"},\n" +
            "      {\"key\": 370829, \"label\": \"嘉祥县\"},\n" +
            "      {\"key\": 370830, \"label\": \"汶上县\"},\n" +
            "      {\"key\": 370831, \"label\": \"泗水县\"},\n" +
            "      {\"key\": 370832, \"label\": \"梁山县\"},\n" +
            "      {\"key\": 370881, \"label\": \"曲阜市\"},\n" +
            "      {\"key\": 370883, \"label\": \"邹城市\"}\n" +
            "    ],\n" +
            "    \"370900\": [\n" +
            "      {\"key\": 370901, \"label\": \"泰安市市辖区\"},\n" +
            "      {\"key\": 370902, \"label\": \"泰山区\"},\n" +
            "      {\"key\": 370911, \"label\": \"岱岳区\"},\n" +
            "      {\"key\": 370921, \"label\": \"宁阳县\"},\n" +
            "      {\"key\": 370923, \"label\": \"东平县\"},\n" +
            "      {\"key\": 370982, \"label\": \"新泰市\"},\n" +
            "      {\"key\": 370983, \"label\": \"肥城市\"}\n" +
            "    ],\n" +
            "    \"371000\": [\n" +
            "      {\"key\": 371001, \"label\": \"威海市市辖区\"},\n" +
            "      {\"key\": 371002, \"label\": \"环翠区\"},\n" +
            "      {\"key\": 371003, \"label\": \"文登区\"},\n" +
            "      {\"key\": 371082, \"label\": \"荣成市\"},\n" +
            "      {\"key\": 371083, \"label\": \"乳山市\"}\n" +
            "    ],\n" +
            "    \"371100\": [\n" +
            "      {\"key\": 371101, \"label\": \"日照市市辖区\"},\n" +
            "      {\"key\": 371102, \"label\": \"东港区\"},\n" +
            "      {\"key\": 371103, \"label\": \"岚山区\"},\n" +
            "      {\"key\": 371121, \"label\": \"五莲县\"},\n" +
            "      {\"key\": 371122, \"label\": \"莒县\"}\n" +
            "    ],\n" +
            "    \"371300\": [\n" +
            "      {\"key\": 371301, \"label\": \"临沂市市辖区\"},\n" +
            "      {\"key\": 371302, \"label\": \"兰山区\"},\n" +
            "      {\"key\": 371311, \"label\": \"罗庄区\"},\n" +
            "      {\"key\": 371312, \"label\": \"河东区\"},\n" +
            "      {\"key\": 371321, \"label\": \"沂南县\"},\n" +
            "      {\"key\": 371322, \"label\": \"郯城县\"},\n" +
            "      {\"key\": 371323, \"label\": \"沂水县\"},\n" +
            "      {\"key\": 371324, \"label\": \"兰陵县\"},\n" +
            "      {\"key\": 371325, \"label\": \"费县\"},\n" +
            "      {\"key\": 371326, \"label\": \"平邑县\"},\n" +
            "      {\"key\": 371327, \"label\": \"莒南县\"},\n" +
            "      {\"key\": 371328, \"label\": \"蒙阴县\"},\n" +
            "      {\"key\": 371329, \"label\": \"临沭县\"}\n" +
            "    ],\n" +
            "    \"371400\": [\n" +
            "      {\"key\": 371401, \"label\": \"德州市市辖区\"},\n" +
            "      {\"key\": 371402, \"label\": \"德城区\"},\n" +
            "      {\"key\": 371403, \"label\": \"陵城区\"},\n" +
            "      {\"key\": 371422, \"label\": \"宁津县\"},\n" +
            "      {\"key\": 371423, \"label\": \"庆云县\"},\n" +
            "      {\"key\": 371424, \"label\": \"临邑县\"},\n" +
            "      {\"key\": 371425, \"label\": \"齐河县\"},\n" +
            "      {\"key\": 371426, \"label\": \"平原县\"},\n" +
            "      {\"key\": 371427, \"label\": \"夏津县\"},\n" +
            "      {\"key\": 371428, \"label\": \"武城县\"},\n" +
            "      {\"key\": 371481, \"label\": \"乐陵市\"},\n" +
            "      {\"key\": 371482, \"label\": \"禹城市\"}\n" +
            "    ],\n" +
            "    \"371500\": [\n" +
            "      {\"key\": 371501, \"label\": \"聊城市市辖区\"},\n" +
            "      {\"key\": 371502, \"label\": \"东昌府区\"},\n" +
            "      {\"key\": 371521, \"label\": \"阳谷县\"},\n" +
            "      {\"key\": 371522, \"label\": \"莘县\"},\n" +
            "      {\"key\": 371523, \"label\": \"茌平县\"},\n" +
            "      {\"key\": 371524, \"label\": \"东阿县\"},\n" +
            "      {\"key\": 371525, \"label\": \"冠县\"},\n" +
            "      {\"key\": 371526, \"label\": \"高唐县\"},\n" +
            "      {\"key\": 371581, \"label\": \"临清市\"}\n" +
            "    ],\n" +
            "    \"371600\": [\n" +
            "      {\"key\": 371601, \"label\": \"滨州市市辖区\"},\n" +
            "      {\"key\": 371602, \"label\": \"滨城区\"},\n" +
            "      {\"key\": 371603, \"label\": \"沾化区\"},\n" +
            "      {\"key\": 371621, \"label\": \"惠民县\"},\n" +
            "      {\"key\": 371622, \"label\": \"阳信县\"},\n" +
            "      {\"key\": 371623, \"label\": \"无棣县\"},\n" +
            "      {\"key\": 371625, \"label\": \"博兴县\"},\n" +
            "      {\"key\": 371681, \"label\": \"邹平市\"}\n" +
            "    ],\n" +
            "    \"371700\": [\n" +
            "      {\"key\": 371701, \"label\": \"菏泽市市辖区\"},\n" +
            "      {\"key\": 371702, \"label\": \"牡丹区\"},\n" +
            "      {\"key\": 371703, \"label\": \"定陶区\"},\n" +
            "      {\"key\": 371721, \"label\": \"曹县\"},\n" +
            "      {\"key\": 371722, \"label\": \"单县\"},\n" +
            "      {\"key\": 371723, \"label\": \"成武县\"},\n" +
            "      {\"key\": 371724, \"label\": \"巨野县\"},\n" +
            "      {\"key\": 371725, \"label\": \"郓城县\"},\n" +
            "      {\"key\": 371726, \"label\": \"鄄城县\"},\n" +
            "      {\"key\": 371728, \"label\": \"东明县\"}\n" +
            "    ],\n" +
            "    \"410100\": [\n" +
            "      {\"key\": 410101, \"label\": \"郑州市市辖区\"},\n" +
            "      {\"key\": 410102, \"label\": \"中原区\"},\n" +
            "      {\"key\": 410103, \"label\": \"二七区\"},\n" +
            "      {\"key\": 410104, \"label\": \"管城回族区\"},\n" +
            "      {\"key\": 410105, \"label\": \"金水区\"},\n" +
            "      {\"key\": 410106, \"label\": \"上街区\"},\n" +
            "      {\"key\": 410108, \"label\": \"惠济区\"},\n" +
            "      {\"key\": 410122, \"label\": \"中牟县\"},\n" +
            "      {\"key\": 410181, \"label\": \"巩义市\"},\n" +
            "      {\"key\": 410182, \"label\": \"荥阳市\"},\n" +
            "      {\"key\": 410183, \"label\": \"新密市\"},\n" +
            "      {\"key\": 410184, \"label\": \"新郑市\"},\n" +
            "      {\"key\": 410185, \"label\": \"登封市\"}\n" +
            "    ],\n" +
            "    \"410200\": [\n" +
            "      {\"key\": 410201, \"label\": \"开封市市辖区\"},\n" +
            "      {\"key\": 410202, \"label\": \"龙亭区\"},\n" +
            "      {\"key\": 410203, \"label\": \"顺河回族区\"},\n" +
            "      {\"key\": 410204, \"label\": \"鼓楼区\"},\n" +
            "      {\"key\": 410205, \"label\": \"禹王台区\"},\n" +
            "      {\"key\": 410212, \"label\": \"祥符区\"},\n" +
            "      {\"key\": 410221, \"label\": \"杞县\"},\n" +
            "      {\"key\": 410222, \"label\": \"通许县\"},\n" +
            "      {\"key\": 410223, \"label\": \"尉氏县\"},\n" +
            "      {\"key\": 410225, \"label\": \"兰考县\"}\n" +
            "    ],\n" +
            "    \"410300\": [\n" +
            "      {\"key\": 410301, \"label\": \"洛阳市市辖区\"},\n" +
            "      {\"key\": 410302, \"label\": \"老城区\"},\n" +
            "      {\"key\": 410303, \"label\": \"西工区\"},\n" +
            "      {\"key\": 410304, \"label\": \"瀍河回族区\"},\n" +
            "      {\"key\": 410305, \"label\": \"涧西区\"},\n" +
            "      {\"key\": 410306, \"label\": \"吉利区\"},\n" +
            "      {\"key\": 410311, \"label\": \"洛龙区\"},\n" +
            "      {\"key\": 410322, \"label\": \"孟津县\"},\n" +
            "      {\"key\": 410323, \"label\": \"新安县\"},\n" +
            "      {\"key\": 410324, \"label\": \"栾川县\"},\n" +
            "      {\"key\": 410325, \"label\": \"嵩县\"},\n" +
            "      {\"key\": 410326, \"label\": \"汝阳县\"},\n" +
            "      {\"key\": 410327, \"label\": \"宜阳县\"},\n" +
            "      {\"key\": 410328, \"label\": \"洛宁县\"},\n" +
            "      {\"key\": 410329, \"label\": \"伊川县\"},\n" +
            "      {\"key\": 410381, \"label\": \"偃师市\"}\n" +
            "    ],\n" +
            "    \"410400\": [\n" +
            "      {\"key\": 410401, \"label\": \"平顶山市市辖区\"},\n" +
            "      {\"key\": 410402, \"label\": \"新华区\"},\n" +
            "      {\"key\": 410403, \"label\": \"卫东区\"},\n" +
            "      {\"key\": 410404, \"label\": \"石龙区\"},\n" +
            "      {\"key\": 410411, \"label\": \"湛河区\"},\n" +
            "      {\"key\": 410421, \"label\": \"宝丰县\"},\n" +
            "      {\"key\": 410422, \"label\": \"叶县\"},\n" +
            "      {\"key\": 410423, \"label\": \"鲁山县\"},\n" +
            "      {\"key\": 410425, \"label\": \"郏县\"},\n" +
            "      {\"key\": 410481, \"label\": \"舞钢市\"},\n" +
            "      {\"key\": 410482, \"label\": \"汝州市\"}\n" +
            "    ],\n" +
            "    \"410500\": [\n" +
            "      {\"key\": 410501, \"label\": \"安阳市市辖区\"},\n" +
            "      {\"key\": 410502, \"label\": \"文峰区\"},\n" +
            "      {\"key\": 410503, \"label\": \"北关区\"},\n" +
            "      {\"key\": 410505, \"label\": \"殷都区\"},\n" +
            "      {\"key\": 410506, \"label\": \"龙安区\"},\n" +
            "      {\"key\": 410522, \"label\": \"安阳县\"},\n" +
            "      {\"key\": 410523, \"label\": \"汤阴县\"},\n" +
            "      {\"key\": 410526, \"label\": \"滑县\"},\n" +
            "      {\"key\": 410527, \"label\": \"内黄县\"},\n" +
            "      {\"key\": 410581, \"label\": \"林州市\"}\n" +
            "    ],\n" +
            "    \"410600\": [\n" +
            "      {\"key\": 410601, \"label\": \"鹤壁市市辖区\"},\n" +
            "      {\"key\": 410602, \"label\": \"鹤山区\"},\n" +
            "      {\"key\": 410603, \"label\": \"山城区\"},\n" +
            "      {\"key\": 410611, \"label\": \"淇滨区\"},\n" +
            "      {\"key\": 410621, \"label\": \"浚县\"},\n" +
            "      {\"key\": 410622, \"label\": \"淇县\"}\n" +
            "    ],\n" +
            "    \"410700\": [\n" +
            "      {\"key\": 410701, \"label\": \"新乡市市辖区\"},\n" +
            "      {\"key\": 410702, \"label\": \"红旗区\"},\n" +
            "      {\"key\": 410703, \"label\": \"卫滨区\"},\n" +
            "      {\"key\": 410704, \"label\": \"凤泉区\"},\n" +
            "      {\"key\": 410711, \"label\": \"牧野区\"},\n" +
            "      {\"key\": 410721, \"label\": \"新乡县\"},\n" +
            "      {\"key\": 410724, \"label\": \"获嘉县\"},\n" +
            "      {\"key\": 410725, \"label\": \"原阳县\"},\n" +
            "      {\"key\": 410726, \"label\": \"延津县\"},\n" +
            "      {\"key\": 410727, \"label\": \"封丘县\"},\n" +
            "      {\"key\": 410728, \"label\": \"长垣县\"},\n" +
            "      {\"key\": 410781, \"label\": \"卫辉市\"},\n" +
            "      {\"key\": 410782, \"label\": \"辉县市\"}\n" +
            "    ],\n" +
            "    \"410800\": [\n" +
            "      {\"key\": 410801, \"label\": \"焦作市市辖区\"},\n" +
            "      {\"key\": 410802, \"label\": \"解放区\"},\n" +
            "      {\"key\": 410803, \"label\": \"中站区\"},\n" +
            "      {\"key\": 410804, \"label\": \"马村区\"},\n" +
            "      {\"key\": 410811, \"label\": \"山阳区\"},\n" +
            "      {\"key\": 410821, \"label\": \"修武县\"},\n" +
            "      {\"key\": 410822, \"label\": \"博爱县\"},\n" +
            "      {\"key\": 410823, \"label\": \"武陟县\"},\n" +
            "      {\"key\": 410825, \"label\": \"温县\"},\n" +
            "      {\"key\": 410882, \"label\": \"沁阳市\"},\n" +
            "      {\"key\": 410883, \"label\": \"孟州市\"}\n" +
            "    ],\n" +
            "    \"410900\": [\n" +
            "      {\"key\": 410901, \"label\": \"濮阳市市辖区\"},\n" +
            "      {\"key\": 410902, \"label\": \"华龙区\"},\n" +
            "      {\"key\": 410922, \"label\": \"清丰县\"},\n" +
            "      {\"key\": 410923, \"label\": \"南乐县\"},\n" +
            "      {\"key\": 410926, \"label\": \"范县\"},\n" +
            "      {\"key\": 410927, \"label\": \"台前县\"},\n" +
            "      {\"key\": 410928, \"label\": \"濮阳县\"}\n" +
            "    ],\n" +
            "    \"411000\": [\n" +
            "      {\"key\": 411001, \"label\": \"许昌市市辖区\"},\n" +
            "      {\"key\": 411002, \"label\": \"魏都区\"},\n" +
            "      {\"key\": 411003, \"label\": \"建安区\"},\n" +
            "      {\"key\": 411024, \"label\": \"鄢陵县\"},\n" +
            "      {\"key\": 411025, \"label\": \"襄城县\"},\n" +
            "      {\"key\": 411081, \"label\": \"禹州市\"},\n" +
            "      {\"key\": 411082, \"label\": \"长葛市\"}\n" +
            "    ],\n" +
            "    \"411100\": [\n" +
            "      {\"key\": 411101, \"label\": \"漯河市市辖区\"},\n" +
            "      {\"key\": 411102, \"label\": \"源汇区\"},\n" +
            "      {\"key\": 411103, \"label\": \"郾城区\"},\n" +
            "      {\"key\": 411104, \"label\": \"召陵区\"},\n" +
            "      {\"key\": 411121, \"label\": \"舞阳县\"},\n" +
            "      {\"key\": 411122, \"label\": \"临颍县\"}\n" +
            "    ],\n" +
            "    \"411200\": [\n" +
            "      {\"key\": 411201, \"label\": \"三门峡市市辖区\"},\n" +
            "      {\"key\": 411202, \"label\": \"湖滨区\"},\n" +
            "      {\"key\": 411203, \"label\": \"陕州区\"},\n" +
            "      {\"key\": 411221, \"label\": \"渑池县\"},\n" +
            "      {\"key\": 411224, \"label\": \"卢氏县\"},\n" +
            "      {\"key\": 411281, \"label\": \"义马市\"},\n" +
            "      {\"key\": 411282, \"label\": \"灵宝市\"}\n" +
            "    ],\n" +
            "    \"411300\": [\n" +
            "      {\"key\": 411301, \"label\": \"南阳市市辖区\"},\n" +
            "      {\"key\": 411302, \"label\": \"宛城区\"},\n" +
            "      {\"key\": 411303, \"label\": \"卧龙区\"},\n" +
            "      {\"key\": 411321, \"label\": \"南召县\"},\n" +
            "      {\"key\": 411322, \"label\": \"方城县\"},\n" +
            "      {\"key\": 411323, \"label\": \"西峡县\"},\n" +
            "      {\"key\": 411324, \"label\": \"镇平县\"},\n" +
            "      {\"key\": 411325, \"label\": \"内乡县\"},\n" +
            "      {\"key\": 411326, \"label\": \"淅川县\"},\n" +
            "      {\"key\": 411327, \"label\": \"社旗县\"},\n" +
            "      {\"key\": 411328, \"label\": \"唐河县\"},\n" +
            "      {\"key\": 411329, \"label\": \"新野县\"},\n" +
            "      {\"key\": 411330, \"label\": \"桐柏县\"},\n" +
            "      {\"key\": 411381, \"label\": \"邓州市\"}\n" +
            "    ],\n" +
            "    \"411400\": [\n" +
            "      {\"key\": 411401, \"label\": \"商丘市市辖区\"},\n" +
            "      {\"key\": 411402, \"label\": \"梁园区\"},\n" +
            "      {\"key\": 411403, \"label\": \"睢阳区\"},\n" +
            "      {\"key\": 411421, \"label\": \"民权县\"},\n" +
            "      {\"key\": 411422, \"label\": \"睢县\"},\n" +
            "      {\"key\": 411423, \"label\": \"宁陵县\"},\n" +
            "      {\"key\": 411424, \"label\": \"柘城县\"},\n" +
            "      {\"key\": 411425, \"label\": \"虞城县\"},\n" +
            "      {\"key\": 411426, \"label\": \"夏邑县\"},\n" +
            "      {\"key\": 411481, \"label\": \"永城市\"}\n" +
            "    ],\n" +
            "    \"411500\": [\n" +
            "      {\"key\": 411501, \"label\": \"信阳市市辖区\"},\n" +
            "      {\"key\": 411502, \"label\": \"浉河区\"},\n" +
            "      {\"key\": 411503, \"label\": \"平桥区\"},\n" +
            "      {\"key\": 411521, \"label\": \"罗山县\"},\n" +
            "      {\"key\": 411522, \"label\": \"光山县\"},\n" +
            "      {\"key\": 411523, \"label\": \"新县\"},\n" +
            "      {\"key\": 411524, \"label\": \"商城县\"},\n" +
            "      {\"key\": 411525, \"label\": \"固始县\"},\n" +
            "      {\"key\": 411526, \"label\": \"潢川县\"},\n" +
            "      {\"key\": 411527, \"label\": \"淮滨县\"},\n" +
            "      {\"key\": 411528, \"label\": \"息县\"}\n" +
            "    ],\n" +
            "    \"411600\": [\n" +
            "      {\"key\": 411601, \"label\": \"周口市市辖区\"},\n" +
            "      {\"key\": 411602, \"label\": \"川汇区\"},\n" +
            "      {\"key\": 411621, \"label\": \"扶沟县\"},\n" +
            "      {\"key\": 411622, \"label\": \"西华县\"},\n" +
            "      {\"key\": 411623, \"label\": \"商水县\"},\n" +
            "      {\"key\": 411624, \"label\": \"沈丘县\"},\n" +
            "      {\"key\": 411625, \"label\": \"郸城县\"},\n" +
            "      {\"key\": 411626, \"label\": \"淮阳县\"},\n" +
            "      {\"key\": 411627, \"label\": \"太康县\"},\n" +
            "      {\"key\": 411628, \"label\": \"鹿邑县\"},\n" +
            "      {\"key\": 411681, \"label\": \"项城市\"}\n" +
            "    ],\n" +
            "    \"411700\": [\n" +
            "      {\"key\": 411701, \"label\": \"驻马店市市辖区\"},\n" +
            "      {\"key\": 411702, \"label\": \"驿城区\"},\n" +
            "      {\"key\": 411721, \"label\": \"西平县\"},\n" +
            "      {\"key\": 411722, \"label\": \"上蔡县\"},\n" +
            "      {\"key\": 411723, \"label\": \"平舆县\"},\n" +
            "      {\"key\": 411724, \"label\": \"正阳县\"},\n" +
            "      {\"key\": 411725, \"label\": \"确山县\"},\n" +
            "      {\"key\": 411726, \"label\": \"泌阳县\"},\n" +
            "      {\"key\": 411727, \"label\": \"汝南县\"},\n" +
            "      {\"key\": 411728, \"label\": \"遂平县\"},\n" +
            "      {\"key\": 411729, \"label\": \"新蔡县\"}\n" +
            "    ],\n" +
            "    \"419000\": [{\"key\": 419001, \"label\": \"济源市\"}],\n" +
            "    \"420100\": [\n" +
            "      {\"key\": 420101, \"label\": \"武汉市市辖区\"},\n" +
            "      {\"key\": 420102, \"label\": \"江岸区\"},\n" +
            "      {\"key\": 420103, \"label\": \"江汉区\"},\n" +
            "      {\"key\": 420104, \"label\": \"硚口区\"},\n" +
            "      {\"key\": 420105, \"label\": \"汉阳区\"},\n" +
            "      {\"key\": 420106, \"label\": \"武昌区\"},\n" +
            "      {\"key\": 420107, \"label\": \"青山区\"},\n" +
            "      {\"key\": 420111, \"label\": \"洪山区\"},\n" +
            "      {\"key\": 420112, \"label\": \"东西湖区\"},\n" +
            "      {\"key\": 420113, \"label\": \"汉南区\"},\n" +
            "      {\"key\": 420114, \"label\": \"蔡甸区\"},\n" +
            "      {\"key\": 420115, \"label\": \"江夏区\"},\n" +
            "      {\"key\": 420116, \"label\": \"黄陂区\"},\n" +
            "      {\"key\": 420117, \"label\": \"新洲区\"}\n" +
            "    ],\n" +
            "    \"420200\": [\n" +
            "      {\"key\": 420201, \"label\": \"黄石市市辖区\"},\n" +
            "      {\"key\": 420202, \"label\": \"黄石港区\"},\n" +
            "      {\"key\": 420203, \"label\": \"西塞山区\"},\n" +
            "      {\"key\": 420204, \"label\": \"下陆区\"},\n" +
            "      {\"key\": 420205, \"label\": \"铁山区\"},\n" +
            "      {\"key\": 420222, \"label\": \"阳新县\"},\n" +
            "      {\"key\": 420281, \"label\": \"大冶市\"}\n" +
            "    ],\n" +
            "    \"420300\": [\n" +
            "      {\"key\": 420301, \"label\": \"十堰市市辖区\"},\n" +
            "      {\"key\": 420302, \"label\": \"茅箭区\"},\n" +
            "      {\"key\": 420303, \"label\": \"张湾区\"},\n" +
            "      {\"key\": 420304, \"label\": \"郧阳区\"},\n" +
            "      {\"key\": 420322, \"label\": \"郧西县\"},\n" +
            "      {\"key\": 420323, \"label\": \"竹山县\"},\n" +
            "      {\"key\": 420324, \"label\": \"竹溪县\"},\n" +
            "      {\"key\": 420325, \"label\": \"房县\"},\n" +
            "      {\"key\": 420381, \"label\": \"丹江口市\"}\n" +
            "    ],\n" +
            "    \"420500\": [\n" +
            "      {\"key\": 420501, \"label\": \"宜昌市市辖区\"},\n" +
            "      {\"key\": 420502, \"label\": \"西陵区\"},\n" +
            "      {\"key\": 420503, \"label\": \"伍家岗区\"},\n" +
            "      {\"key\": 420504, \"label\": \"点军区\"},\n" +
            "      {\"key\": 420505, \"label\": \"猇亭区\"},\n" +
            "      {\"key\": 420506, \"label\": \"夷陵区\"},\n" +
            "      {\"key\": 420525, \"label\": \"远安县\"},\n" +
            "      {\"key\": 420526, \"label\": \"兴山县\"},\n" +
            "      {\"key\": 420527, \"label\": \"秭归县\"},\n" +
            "      {\"key\": 420528, \"label\": \"长阳土家族自治县\"},\n" +
            "      {\"key\": 420529, \"label\": \"五峰土家族自治县\"},\n" +
            "      {\"key\": 420581, \"label\": \"宜都市\"},\n" +
            "      {\"key\": 420582, \"label\": \"当阳市\"},\n" +
            "      {\"key\": 420583, \"label\": \"枝江市\"}\n" +
            "    ],\n" +
            "    \"420600\": [\n" +
            "      {\"key\": 420601, \"label\": \"襄阳市市辖区\"},\n" +
            "      {\"key\": 420602, \"label\": \"襄城区\"},\n" +
            "      {\"key\": 420606, \"label\": \"樊城区\"},\n" +
            "      {\"key\": 420607, \"label\": \"襄州区\"},\n" +
            "      {\"key\": 420624, \"label\": \"南漳县\"},\n" +
            "      {\"key\": 420625, \"label\": \"谷城县\"},\n" +
            "      {\"key\": 420626, \"label\": \"保康县\"},\n" +
            "      {\"key\": 420682, \"label\": \"老河口市\"},\n" +
            "      {\"key\": 420683, \"label\": \"枣阳市\"},\n" +
            "      {\"key\": 420684, \"label\": \"宜城市\"}\n" +
            "    ],\n" +
            "    \"420700\": [\n" +
            "      {\"key\": 420701, \"label\": \"鄂州市市辖区\"},\n" +
            "      {\"key\": 420702, \"label\": \"梁子湖区\"},\n" +
            "      {\"key\": 420703, \"label\": \"华容区\"},\n" +
            "      {\"key\": 420704, \"label\": \"鄂城区\"}\n" +
            "    ],\n" +
            "    \"420800\": [\n" +
            "      {\"key\": 420801, \"label\": \"荆门市市辖区\"},\n" +
            "      {\"key\": 420802, \"label\": \"东宝区\"},\n" +
            "      {\"key\": 420804, \"label\": \"掇刀区\"},\n" +
            "      {\"key\": 420882, \"label\": \"京山市\"},\n" +
            "      {\"key\": 420822, \"label\": \"沙洋县\"},\n" +
            "      {\"key\": 420881, \"label\": \"钟祥市\"}\n" +
            "    ],\n" +
            "    \"420900\": [\n" +
            "      {\"key\": 420901, \"label\": \"孝感市市辖区\"},\n" +
            "      {\"key\": 420902, \"label\": \"孝南区\"},\n" +
            "      {\"key\": 420921, \"label\": \"孝昌县\"},\n" +
            "      {\"key\": 420922, \"label\": \"大悟县\"},\n" +
            "      {\"key\": 420923, \"label\": \"云梦县\"},\n" +
            "      {\"key\": 420981, \"label\": \"应城市\"},\n" +
            "      {\"key\": 420982, \"label\": \"安陆市\"},\n" +
            "      {\"key\": 420984, \"label\": \"汉川市\"}\n" +
            "    ],\n" +
            "    \"421000\": [\n" +
            "      {\"key\": 421001, \"label\": \"荆州市市辖区\"},\n" +
            "      {\"key\": 421002, \"label\": \"沙市区\"},\n" +
            "      {\"key\": 421003, \"label\": \"荆州区\"},\n" +
            "      {\"key\": 421022, \"label\": \"公安县\"},\n" +
            "      {\"key\": 421023, \"label\": \"监利县\"},\n" +
            "      {\"key\": 421024, \"label\": \"江陵县\"},\n" +
            "      {\"key\": 421081, \"label\": \"石首市\"},\n" +
            "      {\"key\": 421083, \"label\": \"洪湖市\"},\n" +
            "      {\"key\": 421087, \"label\": \"松滋市\"}\n" +
            "    ],\n" +
            "    \"421100\": [\n" +
            "      {\"key\": 421101, \"label\": \"黄冈市市辖区\"},\n" +
            "      {\"key\": 421102, \"label\": \"黄州区\"},\n" +
            "      {\"key\": 421121, \"label\": \"团风县\"},\n" +
            "      {\"key\": 421122, \"label\": \"红安县\"},\n" +
            "      {\"key\": 421123, \"label\": \"罗田县\"},\n" +
            "      {\"key\": 421124, \"label\": \"英山县\"},\n" +
            "      {\"key\": 421125, \"label\": \"浠水县\"},\n" +
            "      {\"key\": 421126, \"label\": \"蕲春县\"},\n" +
            "      {\"key\": 421127, \"label\": \"黄梅县\"},\n" +
            "      {\"key\": 421181, \"label\": \"麻城市\"},\n" +
            "      {\"key\": 421182, \"label\": \"武穴市\"}\n" +
            "    ],\n" +
            "    \"421200\": [\n" +
            "      {\"key\": 421201, \"label\": \"咸宁市市辖区\"},\n" +
            "      {\"key\": 421202, \"label\": \"咸安区\"},\n" +
            "      {\"key\": 421221, \"label\": \"嘉鱼县\"},\n" +
            "      {\"key\": 421222, \"label\": \"通城县\"},\n" +
            "      {\"key\": 421223, \"label\": \"崇阳县\"},\n" +
            "      {\"key\": 421224, \"label\": \"通山县\"},\n" +
            "      {\"key\": 421281, \"label\": \"赤壁市\"}\n" +
            "    ],\n" +
            "    \"421300\": [\n" +
            "      {\"key\": 421301, \"label\": \"随州市市辖区\"},\n" +
            "      {\"key\": 421303, \"label\": \"曾都区\"},\n" +
            "      {\"key\": 421321, \"label\": \"随县\"},\n" +
            "      {\"key\": 421381, \"label\": \"广水市\"}\n" +
            "    ],\n" +
            "    \"422800\": [\n" +
            "      {\"key\": 422801, \"label\": \"恩施市\"},\n" +
            "      {\"key\": 422802, \"label\": \"利川市\"},\n" +
            "      {\"key\": 422822, \"label\": \"建始县\"},\n" +
            "      {\"key\": 422823, \"label\": \"巴东县\"},\n" +
            "      {\"key\": 422825, \"label\": \"宣恩县\"},\n" +
            "      {\"key\": 422826, \"label\": \"咸丰县\"},\n" +
            "      {\"key\": 422827, \"label\": \"来凤县\"},\n" +
            "      {\"key\": 422828, \"label\": \"鹤峰县\"}\n" +
            "    ],\n" +
            "    \"429000\": [\n" +
            "      {\"key\": 429004, \"label\": \"仙桃市\"},\n" +
            "      {\"key\": 429005, \"label\": \"潜江市\"},\n" +
            "      {\"key\": 429006, \"label\": \"天门市\"},\n" +
            "      {\"key\": 429021, \"label\": \"神农架林区\"}\n" +
            "    ],\n" +
            "    \"430100\": [\n" +
            "      {\"key\": 430101, \"label\": \"长沙市市辖区\"},\n" +
            "      {\"key\": 430102, \"label\": \"芙蓉区\"},\n" +
            "      {\"key\": 430103, \"label\": \"天心区\"},\n" +
            "      {\"key\": 430104, \"label\": \"岳麓区\"},\n" +
            "      {\"key\": 430105, \"label\": \"开福区\"},\n" +
            "      {\"key\": 430111, \"label\": \"雨花区\"},\n" +
            "      {\"key\": 430112, \"label\": \"望城区\"},\n" +
            "      {\"key\": 430121, \"label\": \"长沙县\"},\n" +
            "      {\"key\": 430181, \"label\": \"浏阳市\"},\n" +
            "      {\"key\": 430182, \"label\": \"宁乡市\"}\n" +
            "    ],\n" +
            "    \"430200\": [\n" +
            "      {\"key\": 430201, \"label\": \"株洲市市辖区\"},\n" +
            "      {\"key\": 430202, \"label\": \"荷塘区\"},\n" +
            "      {\"key\": 430203, \"label\": \"芦淞区\"},\n" +
            "      {\"key\": 430204, \"label\": \"石峰区\"},\n" +
            "      {\"key\": 430211, \"label\": \"天元区\"},\n" +
            "      {\"key\": 430212, \"label\": \"渌口区\"},\n" +
            "      {\"key\": 430223, \"label\": \"攸县\"},\n" +
            "      {\"key\": 430224, \"label\": \"茶陵县\"},\n" +
            "      {\"key\": 430225, \"label\": \"炎陵县\"},\n" +
            "      {\"key\": 430281, \"label\": \"醴陵市\"}\n" +
            "    ],\n" +
            "    \"430300\": [\n" +
            "      {\"key\": 430301, \"label\": \"湘潭市市辖区\"},\n" +
            "      {\"key\": 430302, \"label\": \"雨湖区\"},\n" +
            "      {\"key\": 430304, \"label\": \"岳塘区\"},\n" +
            "      {\"key\": 430321, \"label\": \"湘潭县\"},\n" +
            "      {\"key\": 430381, \"label\": \"湘乡市\"},\n" +
            "      {\"key\": 430382, \"label\": \"韶山市\"}\n" +
            "    ],\n" +
            "    \"430400\": [\n" +
            "      {\"key\": 430401, \"label\": \"衡阳市市辖区\"},\n" +
            "      {\"key\": 430405, \"label\": \"珠晖区\"},\n" +
            "      {\"key\": 430406, \"label\": \"雁峰区\"},\n" +
            "      {\"key\": 430407, \"label\": \"石鼓区\"},\n" +
            "      {\"key\": 430408, \"label\": \"蒸湘区\"},\n" +
            "      {\"key\": 430412, \"label\": \"南岳区\"},\n" +
            "      {\"key\": 430421, \"label\": \"衡阳县\"},\n" +
            "      {\"key\": 430422, \"label\": \"衡南县\"},\n" +
            "      {\"key\": 430423, \"label\": \"衡山县\"},\n" +
            "      {\"key\": 430424, \"label\": \"衡东县\"},\n" +
            "      {\"key\": 430426, \"label\": \"祁东县\"},\n" +
            "      {\"key\": 430481, \"label\": \"耒阳市\"},\n" +
            "      {\"key\": 430482, \"label\": \"常宁市\"}\n" +
            "    ],\n" +
            "    \"430500\": [\n" +
            "      {\"key\": 430501, \"label\": \"邵阳市市辖区\"},\n" +
            "      {\"key\": 430502, \"label\": \"双清区\"},\n" +
            "      {\"key\": 430503, \"label\": \"大祥区\"},\n" +
            "      {\"key\": 430511, \"label\": \"北塔区\"},\n" +
            "      {\"key\": 430521, \"label\": \"邵东县\"},\n" +
            "      {\"key\": 430522, \"label\": \"新邵县\"},\n" +
            "      {\"key\": 430523, \"label\": \"邵阳县\"},\n" +
            "      {\"key\": 430524, \"label\": \"隆回县\"},\n" +
            "      {\"key\": 430525, \"label\": \"洞口县\"},\n" +
            "      {\"key\": 430527, \"label\": \"绥宁县\"},\n" +
            "      {\"key\": 430528, \"label\": \"新宁县\"},\n" +
            "      {\"key\": 430529, \"label\": \"城步苗族自治县\"},\n" +
            "      {\"key\": 430581, \"label\": \"武冈市\"}\n" +
            "    ],\n" +
            "    \"430600\": [\n" +
            "      {\"key\": 430601, \"label\": \"岳阳市市辖区\"},\n" +
            "      {\"key\": 430602, \"label\": \"岳阳楼区\"},\n" +
            "      {\"key\": 430603, \"label\": \"云溪区\"},\n" +
            "      {\"key\": 430611, \"label\": \"君山区\"},\n" +
            "      {\"key\": 430621, \"label\": \"岳阳县\"},\n" +
            "      {\"key\": 430623, \"label\": \"华容县\"},\n" +
            "      {\"key\": 430624, \"label\": \"湘阴县\"},\n" +
            "      {\"key\": 430626, \"label\": \"平江县\"},\n" +
            "      {\"key\": 430681, \"label\": \"汨罗市\"},\n" +
            "      {\"key\": 430682, \"label\": \"临湘市\"}\n" +
            "    ],\n" +
            "    \"430700\": [\n" +
            "      {\"key\": 430701, \"label\": \"常德市市辖区\"},\n" +
            "      {\"key\": 430702, \"label\": \"武陵区\"},\n" +
            "      {\"key\": 430703, \"label\": \"鼎城区\"},\n" +
            "      {\"key\": 430721, \"label\": \"安乡县\"},\n" +
            "      {\"key\": 430722, \"label\": \"汉寿县\"},\n" +
            "      {\"key\": 430723, \"label\": \"澧县\"},\n" +
            "      {\"key\": 430724, \"label\": \"临澧县\"},\n" +
            "      {\"key\": 430725, \"label\": \"桃源县\"},\n" +
            "      {\"key\": 430726, \"label\": \"石门县\"},\n" +
            "      {\"key\": 430781, \"label\": \"津市市\"}\n" +
            "    ],\n" +
            "    \"430800\": [\n" +
            "      {\"key\": 430801, \"label\": \"张家界市市辖区\"},\n" +
            "      {\"key\": 430802, \"label\": \"永定区\"},\n" +
            "      {\"key\": 430811, \"label\": \"武陵源区\"},\n" +
            "      {\"key\": 430821, \"label\": \"慈利县\"},\n" +
            "      {\"key\": 430822, \"label\": \"桑植县\"}\n" +
            "    ],\n" +
            "    \"430900\": [\n" +
            "      {\"key\": 430901, \"label\": \"益阳市市辖区\"},\n" +
            "      {\"key\": 430902, \"label\": \"资阳区\"},\n" +
            "      {\"key\": 430903, \"label\": \"赫山区\"},\n" +
            "      {\"key\": 430921, \"label\": \"南县\"},\n" +
            "      {\"key\": 430922, \"label\": \"桃江县\"},\n" +
            "      {\"key\": 430923, \"label\": \"安化县\"},\n" +
            "      {\"key\": 430981, \"label\": \"沅江市\"}\n" +
            "    ],\n" +
            "    \"431000\": [\n" +
            "      {\"key\": 431001, \"label\": \"郴州市市辖区\"},\n" +
            "      {\"key\": 431002, \"label\": \"北湖区\"},\n" +
            "      {\"key\": 431003, \"label\": \"苏仙区\"},\n" +
            "      {\"key\": 431021, \"label\": \"桂阳县\"},\n" +
            "      {\"key\": 431022, \"label\": \"宜章县\"},\n" +
            "      {\"key\": 431023, \"label\": \"永兴县\"},\n" +
            "      {\"key\": 431024, \"label\": \"嘉禾县\"},\n" +
            "      {\"key\": 431025, \"label\": \"临武县\"},\n" +
            "      {\"key\": 431026, \"label\": \"汝城县\"},\n" +
            "      {\"key\": 431027, \"label\": \"桂东县\"},\n" +
            "      {\"key\": 431028, \"label\": \"安仁县\"},\n" +
            "      {\"key\": 431081, \"label\": \"资兴市\"}\n" +
            "    ],\n" +
            "    \"431100\": [\n" +
            "      {\"key\": 431101, \"label\": \"永州市市辖区\"},\n" +
            "      {\"key\": 431102, \"label\": \"零陵区\"},\n" +
            "      {\"key\": 431103, \"label\": \"冷水滩区\"},\n" +
            "      {\"key\": 431121, \"label\": \"祁阳县\"},\n" +
            "      {\"key\": 431122, \"label\": \"东安县\"},\n" +
            "      {\"key\": 431123, \"label\": \"双牌县\"},\n" +
            "      {\"key\": 431124, \"label\": \"道县\"},\n" +
            "      {\"key\": 431125, \"label\": \"江永县\"},\n" +
            "      {\"key\": 431126, \"label\": \"宁远县\"},\n" +
            "      {\"key\": 431127, \"label\": \"蓝山县\"},\n" +
            "      {\"key\": 431128, \"label\": \"新田县\"},\n" +
            "      {\"key\": 431129, \"label\": \"江华瑶族自治县\"}\n" +
            "    ],\n" +
            "    \"431200\": [\n" +
            "      {\"key\": 431201, \"label\": \"怀化市市辖区\"},\n" +
            "      {\"key\": 431202, \"label\": \"鹤城区\"},\n" +
            "      {\"key\": 431221, \"label\": \"中方县\"},\n" +
            "      {\"key\": 431222, \"label\": \"沅陵县\"},\n" +
            "      {\"key\": 431223, \"label\": \"辰溪县\"},\n" +
            "      {\"key\": 431224, \"label\": \"溆浦县\"},\n" +
            "      {\"key\": 431225, \"label\": \"会同县\"},\n" +
            "      {\"key\": 431226, \"label\": \"麻阳苗族自治县\"},\n" +
            "      {\"key\": 431227, \"label\": \"新晃侗族自治县\"},\n" +
            "      {\"key\": 431228, \"label\": \"芷江侗族自治县\"},\n" +
            "      {\"key\": 431229, \"label\": \"靖州苗族侗族自治县\"},\n" +
            "      {\"key\": 431230, \"label\": \"通道侗族自治县\"},\n" +
            "      {\"key\": 431281, \"label\": \"洪江市\"}\n" +
            "    ],\n" +
            "    \"431300\": [\n" +
            "      {\"key\": 431301, \"label\": \"娄底市市辖区\"},\n" +
            "      {\"key\": 431302, \"label\": \"娄星区\"},\n" +
            "      {\"key\": 431321, \"label\": \"双峰县\"},\n" +
            "      {\"key\": 431322, \"label\": \"新化县\"},\n" +
            "      {\"key\": 431381, \"label\": \"冷水江市\"},\n" +
            "      {\"key\": 431382, \"label\": \"涟源市\"}\n" +
            "    ],\n" +
            "    \"433100\": [\n" +
            "      {\"key\": 433101, \"label\": \"吉首市\"},\n" +
            "      {\"key\": 433122, \"label\": \"泸溪县\"},\n" +
            "      {\"key\": 433123, \"label\": \"凤凰县\"},\n" +
            "      {\"key\": 433124, \"label\": \"花垣县\"},\n" +
            "      {\"key\": 433125, \"label\": \"保靖县\"},\n" +
            "      {\"key\": 433126, \"label\": \"古丈县\"},\n" +
            "      {\"key\": 433127, \"label\": \"永顺县\"},\n" +
            "      {\"key\": 433130, \"label\": \"龙山县\"}\n" +
            "    ],\n" +
            "    \"440100\": [\n" +
            "      {\"key\": 440101, \"label\": \"广州市市辖区\"},\n" +
            "      {\"key\": 440103, \"label\": \"荔湾区\"},\n" +
            "      {\"key\": 440104, \"label\": \"越秀区\"},\n" +
            "      {\"key\": 440105, \"label\": \"海珠区\"},\n" +
            "      {\"key\": 440106, \"label\": \"天河区\"},\n" +
            "      {\"key\": 440111, \"label\": \"白云区\"},\n" +
            "      {\"key\": 440112, \"label\": \"黄埔区\"},\n" +
            "      {\"key\": 440113, \"label\": \"番禺区\"},\n" +
            "      {\"key\": 440114, \"label\": \"花都区\"},\n" +
            "      {\"key\": 440115, \"label\": \"南沙区\"},\n" +
            "      {\"key\": 440117, \"label\": \"从化区\"},\n" +
            "      {\"key\": 440118, \"label\": \"增城区\"}\n" +
            "    ],\n" +
            "    \"440200\": [\n" +
            "      {\"key\": 440201, \"label\": \"韶关市市辖区\"},\n" +
            "      {\"key\": 440203, \"label\": \"武江区\"},\n" +
            "      {\"key\": 440204, \"label\": \"浈江区\"},\n" +
            "      {\"key\": 440205, \"label\": \"曲江区\"},\n" +
            "      {\"key\": 440222, \"label\": \"始兴县\"},\n" +
            "      {\"key\": 440224, \"label\": \"仁化县\"},\n" +
            "      {\"key\": 440229, \"label\": \"翁源县\"},\n" +
            "      {\"key\": 440232, \"label\": \"乳源瑶族自治县\"},\n" +
            "      {\"key\": 440233, \"label\": \"新丰县\"},\n" +
            "      {\"key\": 440281, \"label\": \"乐昌市\"},\n" +
            "      {\"key\": 440282, \"label\": \"南雄市\"}\n" +
            "    ],\n" +
            "    \"440300\": [\n" +
            "      {\"key\": 440301, \"label\": \"深圳市市辖区\"},\n" +
            "      {\"key\": 440303, \"label\": \"罗湖区\"},\n" +
            "      {\"key\": 440304, \"label\": \"福田区\"},\n" +
            "      {\"key\": 440305, \"label\": \"南山区\"},\n" +
            "      {\"key\": 440306, \"label\": \"宝安区\"},\n" +
            "      {\"key\": 440307, \"label\": \"龙岗区\"},\n" +
            "      {\"key\": 440308, \"label\": \"盐田区\"},\n" +
            "      {\"key\": 440309, \"label\": \"龙华区\"},\n" +
            "      {\"key\": 440310, \"label\": \"坪山区\"},\n" +
            "      {\"key\": 440311, \"label\": \"光明区\"}\n" +
            "    ],\n" +
            "    \"440400\": [\n" +
            "      {\"key\": 440401, \"label\": \"珠海市市辖区\"},\n" +
            "      {\"key\": 440402, \"label\": \"香洲区\"},\n" +
            "      {\"key\": 440403, \"label\": \"斗门区\"},\n" +
            "      {\"key\": 440404, \"label\": \"金湾区\"}\n" +
            "    ],\n" +
            "    \"440500\": [\n" +
            "      {\"key\": 440501, \"label\": \"汕头市市辖区\"},\n" +
            "      {\"key\": 440507, \"label\": \"龙湖区\"},\n" +
            "      {\"key\": 440511, \"label\": \"金平区\"},\n" +
            "      {\"key\": 440512, \"label\": \"濠江区\"},\n" +
            "      {\"key\": 440513, \"label\": \"潮阳区\"},\n" +
            "      {\"key\": 440514, \"label\": \"潮南区\"},\n" +
            "      {\"key\": 440515, \"label\": \"澄海区\"},\n" +
            "      {\"key\": 440523, \"label\": \"南澳县\"}\n" +
            "    ],\n" +
            "    \"440600\": [\n" +
            "      {\"key\": 440601, \"label\": \"佛山市市辖区\"},\n" +
            "      {\"key\": 440604, \"label\": \"禅城区\"},\n" +
            "      {\"key\": 440605, \"label\": \"南海区\"},\n" +
            "      {\"key\": 440606, \"label\": \"顺德区\"},\n" +
            "      {\"key\": 440607, \"label\": \"三水区\"},\n" +
            "      {\"key\": 440608, \"label\": \"高明区\"}\n" +
            "    ],\n" +
            "    \"440700\": [\n" +
            "      {\"key\": 440701, \"label\": \"江门市市辖区\"},\n" +
            "      {\"key\": 440703, \"label\": \"蓬江区\"},\n" +
            "      {\"key\": 440704, \"label\": \"江海区\"},\n" +
            "      {\"key\": 440705, \"label\": \"新会区\"},\n" +
            "      {\"key\": 440781, \"label\": \"台山市\"},\n" +
            "      {\"key\": 440783, \"label\": \"开平市\"},\n" +
            "      {\"key\": 440784, \"label\": \"鹤山市\"},\n" +
            "      {\"key\": 440785, \"label\": \"恩平市\"}\n" +
            "    ],\n" +
            "    \"440800\": [\n" +
            "      {\"key\": 440801, \"label\": \"湛江市市辖区\"},\n" +
            "      {\"key\": 440802, \"label\": \"赤坎区\"},\n" +
            "      {\"key\": 440803, \"label\": \"霞山区\"},\n" +
            "      {\"key\": 440804, \"label\": \"坡头区\"},\n" +
            "      {\"key\": 440811, \"label\": \"麻章区\"},\n" +
            "      {\"key\": 440823, \"label\": \"遂溪县\"},\n" +
            "      {\"key\": 440825, \"label\": \"徐闻县\"},\n" +
            "      {\"key\": 440881, \"label\": \"廉江市\"},\n" +
            "      {\"key\": 440882, \"label\": \"雷州市\"},\n" +
            "      {\"key\": 440883, \"label\": \"吴川市\"}\n" +
            "    ],\n" +
            "    \"440900\": [\n" +
            "      {\"key\": 440901, \"label\": \"茂名市市辖区\"},\n" +
            "      {\"key\": 440902, \"label\": \"茂南区\"},\n" +
            "      {\"key\": 440904, \"label\": \"电白区\"},\n" +
            "      {\"key\": 440981, \"label\": \"高州市\"},\n" +
            "      {\"key\": 440982, \"label\": \"化州市\"},\n" +
            "      {\"key\": 440983, \"label\": \"信宜市\"}\n" +
            "    ],\n" +
            "    \"441200\": [\n" +
            "      {\"key\": 441201, \"label\": \"肇庆市市辖区\"},\n" +
            "      {\"key\": 441202, \"label\": \"端州区\"},\n" +
            "      {\"key\": 441203, \"label\": \"鼎湖区\"},\n" +
            "      {\"key\": 441204, \"label\": \"高要区\"},\n" +
            "      {\"key\": 441223, \"label\": \"广宁县\"},\n" +
            "      {\"key\": 441224, \"label\": \"怀集县\"},\n" +
            "      {\"key\": 441225, \"label\": \"封开县\"},\n" +
            "      {\"key\": 441226, \"label\": \"德庆县\"},\n" +
            "      {\"key\": 441284, \"label\": \"四会市\"}\n" +
            "    ],\n" +
            "    \"441300\": [\n" +
            "      {\"key\": 441301, \"label\": \"惠州市市辖区\"},\n" +
            "      {\"key\": 441302, \"label\": \"惠城区\"},\n" +
            "      {\"key\": 441303, \"label\": \"惠阳区\"},\n" +
            "      {\"key\": 441322, \"label\": \"博罗县\"},\n" +
            "      {\"key\": 441323, \"label\": \"惠东县\"},\n" +
            "      {\"key\": 441324, \"label\": \"龙门县\"}\n" +
            "    ],\n" +
            "    \"441400\": [\n" +
            "      {\"key\": 441401, \"label\": \"梅州市市辖区\"},\n" +
            "      {\"key\": 441402, \"label\": \"梅江区\"},\n" +
            "      {\"key\": 441403, \"label\": \"梅县区\"},\n" +
            "      {\"key\": 441422, \"label\": \"大埔县\"},\n" +
            "      {\"key\": 441423, \"label\": \"丰顺县\"},\n" +
            "      {\"key\": 441424, \"label\": \"五华县\"},\n" +
            "      {\"key\": 441426, \"label\": \"平远县\"},\n" +
            "      {\"key\": 441427, \"label\": \"蕉岭县\"},\n" +
            "      {\"key\": 441481, \"label\": \"兴宁市\"}\n" +
            "    ],\n" +
            "    \"441500\": [\n" +
            "      {\"key\": 441501, \"label\": \"汕尾市市辖区\"},\n" +
            "      {\"key\": 441502, \"label\": \"城区\"},\n" +
            "      {\"key\": 441521, \"label\": \"海丰县\"},\n" +
            "      {\"key\": 441523, \"label\": \"陆河县\"},\n" +
            "      {\"key\": 441581, \"label\": \"陆丰市\"}\n" +
            "    ],\n" +
            "    \"441600\": [\n" +
            "      {\"key\": 441601, \"label\": \"河源市市辖区\"},\n" +
            "      {\"key\": 441602, \"label\": \"源城区\"},\n" +
            "      {\"key\": 441621, \"label\": \"紫金县\"},\n" +
            "      {\"key\": 441622, \"label\": \"龙川县\"},\n" +
            "      {\"key\": 441623, \"label\": \"连平县\"},\n" +
            "      {\"key\": 441624, \"label\": \"和平县\"},\n" +
            "      {\"key\": 441625, \"label\": \"东源县\"}\n" +
            "    ],\n" +
            "    \"441700\": [\n" +
            "      {\"key\": 441701, \"label\": \"阳江市市辖区\"},\n" +
            "      {\"key\": 441702, \"label\": \"江城区\"},\n" +
            "      {\"key\": 441704, \"label\": \"阳东区\"},\n" +
            "      {\"key\": 441721, \"label\": \"阳西县\"},\n" +
            "      {\"key\": 441781, \"label\": \"阳春市\"}\n" +
            "    ],\n" +
            "    \"441800\": [\n" +
            "      {\"key\": 441801, \"label\": \"清远市市辖区\"},\n" +
            "      {\"key\": 441802, \"label\": \"清城区\"},\n" +
            "      {\"key\": 441803, \"label\": \"清新区\"},\n" +
            "      {\"key\": 441821, \"label\": \"佛冈县\"},\n" +
            "      {\"key\": 441823, \"label\": \"阳山县\"},\n" +
            "      {\"key\": 441825, \"label\": \"连山壮族瑶族自治县\"},\n" +
            "      {\"key\": 441826, \"label\": \"连南瑶族自治县\"},\n" +
            "      {\"key\": 441881, \"label\": \"英德市\"},\n" +
            "      {\"key\": 441882, \"label\": \"连州市\"}\n" +
            "    ],\n" +
            "    \"442100\": [{\"key\": 442101, \"label\": \"东沙群岛\"}],\n" +
            "    \"445100\": [\n" +
            "      {\"key\": 445101, \"label\": \"潮州市市辖区\"},\n" +
            "      {\"key\": 445102, \"label\": \"湘桥区\"},\n" +
            "      {\"key\": 445103, \"label\": \"潮安区\"},\n" +
            "      {\"key\": 445122, \"label\": \"饶平县\"}\n" +
            "    ],\n" +
            "    \"445200\": [\n" +
            "      {\"key\": 445201, \"label\": \"揭阳市市辖区\"},\n" +
            "      {\"key\": 445202, \"label\": \"榕城区\"},\n" +
            "      {\"key\": 445203, \"label\": \"揭东区\"},\n" +
            "      {\"key\": 445222, \"label\": \"揭西县\"},\n" +
            "      {\"key\": 445224, \"label\": \"惠来县\"},\n" +
            "      {\"key\": 445281, \"label\": \"普宁市\"}\n" +
            "    ],\n" +
            "    \"445300\": [\n" +
            "      {\"key\": 445301, \"label\": \"云浮市市辖区\"},\n" +
            "      {\"key\": 445302, \"label\": \"云城区\"},\n" +
            "      {\"key\": 445303, \"label\": \"云安区\"},\n" +
            "      {\"key\": 445321, \"label\": \"新兴县\"},\n" +
            "      {\"key\": 445322, \"label\": \"郁南县\"},\n" +
            "      {\"key\": 445381, \"label\": \"罗定市\"}\n" +
            "    ],\n" +
            "    \"450100\": [\n" +
            "      {\"key\": 450101, \"label\": \"南宁市市辖区\"},\n" +
            "      {\"key\": 450102, \"label\": \"兴宁区\"},\n" +
            "      {\"key\": 450103, \"label\": \"青秀区\"},\n" +
            "      {\"key\": 450105, \"label\": \"江南区\"},\n" +
            "      {\"key\": 450107, \"label\": \"西乡塘区\"},\n" +
            "      {\"key\": 450108, \"label\": \"良庆区\"},\n" +
            "      {\"key\": 450109, \"label\": \"邕宁区\"},\n" +
            "      {\"key\": 450110, \"label\": \"武鸣区\"},\n" +
            "      {\"key\": 450123, \"label\": \"隆安县\"},\n" +
            "      {\"key\": 450124, \"label\": \"马山县\"},\n" +
            "      {\"key\": 450125, \"label\": \"上林县\"},\n" +
            "      {\"key\": 450126, \"label\": \"宾阳县\"},\n" +
            "      {\"key\": 450127, \"label\": \"横县\"}\n" +
            "    ],\n" +
            "    \"450200\": [\n" +
            "      {\"key\": 450201, \"label\": \"柳州市市辖区\"},\n" +
            "      {\"key\": 450202, \"label\": \"城中区\"},\n" +
            "      {\"key\": 450203, \"label\": \"鱼峰区\"},\n" +
            "      {\"key\": 450204, \"label\": \"柳南区\"},\n" +
            "      {\"key\": 450205, \"label\": \"柳北区\"},\n" +
            "      {\"key\": 450206, \"label\": \"柳江区\"},\n" +
            "      {\"key\": 450222, \"label\": \"柳城县\"},\n" +
            "      {\"key\": 450223, \"label\": \"鹿寨县\"},\n" +
            "      {\"key\": 450224, \"label\": \"融安县\"},\n" +
            "      {\"key\": 450225, \"label\": \"融水苗族自治县\"},\n" +
            "      {\"key\": 450226, \"label\": \"三江侗族自治县\"}\n" +
            "    ],\n" +
            "    \"450300\": [\n" +
            "      {\"key\": 450301, \"label\": \"桂林市市辖区\"},\n" +
            "      {\"key\": 450302, \"label\": \"秀峰区\"},\n" +
            "      {\"key\": 450303, \"label\": \"叠彩区\"},\n" +
            "      {\"key\": 450304, \"label\": \"象山区\"},\n" +
            "      {\"key\": 450305, \"label\": \"七星区\"},\n" +
            "      {\"key\": 450311, \"label\": \"雁山区\"},\n" +
            "      {\"key\": 450312, \"label\": \"临桂区\"},\n" +
            "      {\"key\": 450321, \"label\": \"阳朔县\"},\n" +
            "      {\"key\": 450323, \"label\": \"灵川县\"},\n" +
            "      {\"key\": 450324, \"label\": \"全州县\"},\n" +
            "      {\"key\": 450325, \"label\": \"兴安县\"},\n" +
            "      {\"key\": 450326, \"label\": \"永福县\"},\n" +
            "      {\"key\": 450327, \"label\": \"灌阳县\"},\n" +
            "      {\"key\": 450328, \"label\": \"龙胜各族自治县\"},\n" +
            "      {\"key\": 450329, \"label\": \"资源县\"},\n" +
            "      {\"key\": 450330, \"label\": \"平乐县\"},\n" +
            "      {\"key\": 450381, \"label\": \"荔浦市\"},\n" +
            "      {\"key\": 450332, \"label\": \"恭城瑶族自治县\"}\n" +
            "    ],\n" +
            "    \"450400\": [\n" +
            "      {\"key\": 450401, \"label\": \"梧州市市辖区\"},\n" +
            "      {\"key\": 450403, \"label\": \"万秀区\"},\n" +
            "      {\"key\": 450405, \"label\": \"长洲区\"},\n" +
            "      {\"key\": 450406, \"label\": \"龙圩区\"},\n" +
            "      {\"key\": 450421, \"label\": \"苍梧县\"},\n" +
            "      {\"key\": 450422, \"label\": \"藤县\"},\n" +
            "      {\"key\": 450423, \"label\": \"蒙山县\"},\n" +
            "      {\"key\": 450481, \"label\": \"岑溪市\"}\n" +
            "    ],\n" +
            "    \"450500\": [\n" +
            "      {\"key\": 450501, \"label\": \"北海市市辖区\"},\n" +
            "      {\"key\": 450502, \"label\": \"海城区\"},\n" +
            "      {\"key\": 450503, \"label\": \"银海区\"},\n" +
            "      {\"key\": 450512, \"label\": \"铁山港区\"},\n" +
            "      {\"key\": 450521, \"label\": \"合浦县\"}\n" +
            "    ],\n" +
            "    \"450600\": [\n" +
            "      {\"key\": 450601, \"label\": \"防城港市市辖区\"},\n" +
            "      {\"key\": 450602, \"label\": \"港口区\"},\n" +
            "      {\"key\": 450603, \"label\": \"防城区\"},\n" +
            "      {\"key\": 450621, \"label\": \"上思县\"},\n" +
            "      {\"key\": 450681, \"label\": \"东兴市\"}\n" +
            "    ],\n" +
            "    \"450700\": [\n" +
            "      {\"key\": 450701, \"label\": \"钦州市市辖区\"},\n" +
            "      {\"key\": 450702, \"label\": \"钦南区\"},\n" +
            "      {\"key\": 450703, \"label\": \"钦北区\"},\n" +
            "      {\"key\": 450721, \"label\": \"灵山县\"},\n" +
            "      {\"key\": 450722, \"label\": \"浦北县\"}\n" +
            "    ],\n" +
            "    \"450800\": [\n" +
            "      {\"key\": 450801, \"label\": \"贵港市市辖区\"},\n" +
            "      {\"key\": 450802, \"label\": \"港北区\"},\n" +
            "      {\"key\": 450803, \"label\": \"港南区\"},\n" +
            "      {\"key\": 450804, \"label\": \"覃塘区\"},\n" +
            "      {\"key\": 450821, \"label\": \"平南县\"},\n" +
            "      {\"key\": 450881, \"label\": \"桂平市\"}\n" +
            "    ],\n" +
            "    \"450900\": [\n" +
            "      {\"key\": 450901, \"label\": \"玉林市市辖区\"},\n" +
            "      {\"key\": 450902, \"label\": \"玉州区\"},\n" +
            "      {\"key\": 450903, \"label\": \"福绵区\"},\n" +
            "      {\"key\": 450921, \"label\": \"容县\"},\n" +
            "      {\"key\": 450922, \"label\": \"陆川县\"},\n" +
            "      {\"key\": 450923, \"label\": \"博白县\"},\n" +
            "      {\"key\": 450924, \"label\": \"兴业县\"},\n" +
            "      {\"key\": 450981, \"label\": \"北流市\"}\n" +
            "    ],\n" +
            "    \"451000\": [\n" +
            "      {\"key\": 451001, \"label\": \"百色市市辖区\"},\n" +
            "      {\"key\": 451002, \"label\": \"右江区\"},\n" +
            "      {\"key\": 451021, \"label\": \"田阳县\"},\n" +
            "      {\"key\": 451022, \"label\": \"田东县\"},\n" +
            "      {\"key\": 451023, \"label\": \"平果县\"},\n" +
            "      {\"key\": 451024, \"label\": \"德保县\"},\n" +
            "      {\"key\": 451026, \"label\": \"那坡县\"},\n" +
            "      {\"key\": 451027, \"label\": \"凌云县\"},\n" +
            "      {\"key\": 451028, \"label\": \"乐业县\"},\n" +
            "      {\"key\": 451029, \"label\": \"田林县\"},\n" +
            "      {\"key\": 451030, \"label\": \"西林县\"},\n" +
            "      {\"key\": 451031, \"label\": \"隆林各族自治县\"},\n" +
            "      {\"key\": 451081, \"label\": \"靖西市\"}\n" +
            "    ],\n" +
            "    \"451100\": [\n" +
            "      {\"key\": 451101, \"label\": \"贺州市市辖区\"},\n" +
            "      {\"key\": 451102, \"label\": \"八步区\"},\n" +
            "      {\"key\": 451103, \"label\": \"平桂区\"},\n" +
            "      {\"key\": 451121, \"label\": \"昭平县\"},\n" +
            "      {\"key\": 451122, \"label\": \"钟山县\"},\n" +
            "      {\"key\": 451123, \"label\": \"富川瑶族自治县\"}\n" +
            "    ],\n" +
            "    \"451200\": [\n" +
            "      {\"key\": 451201, \"label\": \"河池市市辖区\"},\n" +
            "      {\"key\": 451202, \"label\": \"金城江区\"},\n" +
            "      {\"key\": 451203, \"label\": \"宜州区\"},\n" +
            "      {\"key\": 451221, \"label\": \"南丹县\"},\n" +
            "      {\"key\": 451222, \"label\": \"天峨县\"},\n" +
            "      {\"key\": 451223, \"label\": \"凤山县\"},\n" +
            "      {\"key\": 451224, \"label\": \"东兰县\"},\n" +
            "      {\"key\": 451225, \"label\": \"罗城仫佬族自治县\"},\n" +
            "      {\"key\": 451226, \"label\": \"环江毛南族自治县\"},\n" +
            "      {\"key\": 451227, \"label\": \"巴马瑶族自治县\"},\n" +
            "      {\"key\": 451228, \"label\": \"都安瑶族自治县\"},\n" +
            "      {\"key\": 451229, \"label\": \"大化瑶族自治县\"}\n" +
            "    ],\n" +
            "    \"451300\": [\n" +
            "      {\"key\": 451301, \"label\": \"来宾市市辖区\"},\n" +
            "      {\"key\": 451302, \"label\": \"兴宾区\"},\n" +
            "      {\"key\": 451321, \"label\": \"忻城县\"},\n" +
            "      {\"key\": 451322, \"label\": \"象州县\"},\n" +
            "      {\"key\": 451323, \"label\": \"武宣县\"},\n" +
            "      {\"key\": 451324, \"label\": \"金秀瑶族自治县\"},\n" +
            "      {\"key\": 451381, \"label\": \"合山市\"}\n" +
            "    ],\n" +
            "    \"451400\": [\n" +
            "      {\"key\": 451401, \"label\": \"崇左市市辖区\"},\n" +
            "      {\"key\": 451402, \"label\": \"江州区\"},\n" +
            "      {\"key\": 451421, \"label\": \"扶绥县\"},\n" +
            "      {\"key\": 451422, \"label\": \"宁明县\"},\n" +
            "      {\"key\": 451423, \"label\": \"龙州县\"},\n" +
            "      {\"key\": 451424, \"label\": \"大新县\"},\n" +
            "      {\"key\": 451425, \"label\": \"天等县\"},\n" +
            "      {\"key\": 451481, \"label\": \"凭祥市\"}\n" +
            "    ],\n" +
            "    \"460100\": [\n" +
            "      {\"key\": 460101, \"label\": \"海口市市辖区\"},\n" +
            "      {\"key\": 460105, \"label\": \"秀英区\"},\n" +
            "      {\"key\": 460106, \"label\": \"龙华区\"},\n" +
            "      {\"key\": 460107, \"label\": \"琼山区\"},\n" +
            "      {\"key\": 460108, \"label\": \"美兰区\"}\n" +
            "    ],\n" +
            "    \"460200\": [\n" +
            "      {\"key\": 460201, \"label\": \"三亚市市辖区\"},\n" +
            "      {\"key\": 460202, \"label\": \"海棠区\"},\n" +
            "      {\"key\": 460203, \"label\": \"吉阳区\"},\n" +
            "      {\"key\": 460204, \"label\": \"天涯区\"},\n" +
            "      {\"key\": 460205, \"label\": \"崖州区\"}\n" +
            "    ],\n" +
            "    \"460300\": [\n" +
            "      {\"key\": 460301, \"label\": \"三沙市市辖区\"},\n" +
            "      {\"key\": 460321, \"label\": \"西沙群岛\"},\n" +
            "      {\"key\": 460322, \"label\": \"南沙群岛\"},\n" +
            "      {\"key\": 460323, \"label\": \"中沙群岛的岛礁及其海域\"}\n" +
            "    ],\n" +
            "    \"469000\": [\n" +
            "      {\"key\": 469001, \"label\": \"五指山市\"},\n" +
            "      {\"key\": 469002, \"label\": \"琼海市\"},\n" +
            "      {\"key\": 469005, \"label\": \"文昌市\"},\n" +
            "      {\"key\": 469006, \"label\": \"万宁市\"},\n" +
            "      {\"key\": 469007, \"label\": \"东方市\"},\n" +
            "      {\"key\": 469021, \"label\": \"定安县\"},\n" +
            "      {\"key\": 469022, \"label\": \"屯昌县\"},\n" +
            "      {\"key\": 469023, \"label\": \"澄迈县\"},\n" +
            "      {\"key\": 469024, \"label\": \"临高县\"},\n" +
            "      {\"key\": 469025, \"label\": \"白沙黎族自治县\"},\n" +
            "      {\"key\": 469026, \"label\": \"昌江黎族自治县\"},\n" +
            "      {\"key\": 469027, \"label\": \"乐东黎族自治县\"},\n" +
            "      {\"key\": 469028, \"label\": \"陵水黎族自治县\"},\n" +
            "      {\"key\": 469029, \"label\": \"保亭黎族苗族自治县\"},\n" +
            "      {\"key\": 469030, \"label\": \"琼中黎族苗族自治县\"}\n" +
            "    ],\n" +
            "    \"500100\": [\n" +
            "      {\"key\": 500101, \"label\": \"万州区\"},\n" +
            "      {\"key\": 500102, \"label\": \"涪陵区\"},\n" +
            "      {\"key\": 500103, \"label\": \"渝中区\"},\n" +
            "      {\"key\": 500104, \"label\": \"大渡口区\"},\n" +
            "      {\"key\": 500105, \"label\": \"江北区\"},\n" +
            "      {\"key\": 500106, \"label\": \"沙坪坝区\"},\n" +
            "      {\"key\": 500107, \"label\": \"九龙坡区\"},\n" +
            "      {\"key\": 500108, \"label\": \"南岸区\"},\n" +
            "      {\"key\": 500109, \"label\": \"北碚区\"},\n" +
            "      {\"key\": 500110, \"label\": \"綦江区\"},\n" +
            "      {\"key\": 500111, \"label\": \"大足区\"},\n" +
            "      {\"key\": 500112, \"label\": \"渝北区\"},\n" +
            "      {\"key\": 500113, \"label\": \"巴南区\"},\n" +
            "      {\"key\": 500114, \"label\": \"黔江区\"},\n" +
            "      {\"key\": 500115, \"label\": \"长寿区\"},\n" +
            "      {\"key\": 500116, \"label\": \"江津区\"},\n" +
            "      {\"key\": 500117, \"label\": \"合川区\"},\n" +
            "      {\"key\": 500118, \"label\": \"永川区\"},\n" +
            "      {\"key\": 500119, \"label\": \"南川区\"},\n" +
            "      {\"key\": 500120, \"label\": \"璧山区\"},\n" +
            "      {\"key\": 500151, \"label\": \"铜梁区\"},\n" +
            "      {\"key\": 500152, \"label\": \"潼南区\"},\n" +
            "      {\"key\": 500153, \"label\": \"荣昌区\"},\n" +
            "      {\"key\": 500154, \"label\": \"开州区\"},\n" +
            "      {\"key\": 500155, \"label\": \"梁平区\"},\n" +
            "      {\"key\": 500156, \"label\": \"武隆区\"}\n" +
            "    ],\n" +
            "    \"500200\": [\n" +
            "      {\"key\": 500229, \"label\": \"城口县\"},\n" +
            "      {\"key\": 500230, \"label\": \"丰都县\"},\n" +
            "      {\"key\": 500231, \"label\": \"垫江县\"},\n" +
            "      {\"key\": 500233, \"label\": \"忠县\"},\n" +
            "      {\"key\": 500235, \"label\": \"云阳县\"},\n" +
            "      {\"key\": 500236, \"label\": \"奉节县\"},\n" +
            "      {\"key\": 500237, \"label\": \"巫山县\"},\n" +
            "      {\"key\": 500238, \"label\": \"巫溪县\"},\n" +
            "      {\"key\": 500240, \"label\": \"石柱土家族自治县\"},\n" +
            "      {\"key\": 500241, \"label\": \"秀山土家族苗族自治县\"},\n" +
            "      {\"key\": 500242, \"label\": \"酉阳土家族苗族自治县\"},\n" +
            "      {\"key\": 500243, \"label\": \"彭水苗族土家族自治县\"}\n" +
            "    ],\n" +
            "    \"510100\": [\n" +
            "      {\"key\": 510101, \"label\": \"成都市市辖区\"},\n" +
            "      {\"key\": 510104, \"label\": \"锦江区\"},\n" +
            "      {\"key\": 510105, \"label\": \"青羊区\"},\n" +
            "      {\"key\": 510106, \"label\": \"金牛区\"},\n" +
            "      {\"key\": 510107, \"label\": \"武侯区\"},\n" +
            "      {\"key\": 510108, \"label\": \"成华区\"},\n" +
            "      {\"key\": 510112, \"label\": \"龙泉驿区\"},\n" +
            "      {\"key\": 510113, \"label\": \"青白江区\"},\n" +
            "      {\"key\": 510114, \"label\": \"新都区\"},\n" +
            "      {\"key\": 510115, \"label\": \"温江区\"},\n" +
            "      {\"key\": 510116, \"label\": \"双流区\"},\n" +
            "      {\"key\": 510117, \"label\": \"郫都区\"},\n" +
            "      {\"key\": 510121, \"label\": \"金堂县\"},\n" +
            "      {\"key\": 510129, \"label\": \"大邑县\"},\n" +
            "      {\"key\": 510131, \"label\": \"蒲江县\"},\n" +
            "      {\"key\": 510132, \"label\": \"新津县\"},\n" +
            "      {\"key\": 510181, \"label\": \"都江堰市\"},\n" +
            "      {\"key\": 510182, \"label\": \"彭州市\"},\n" +
            "      {\"key\": 510183, \"label\": \"邛崃市\"},\n" +
            "      {\"key\": 510184, \"label\": \"崇州市\"},\n" +
            "      {\"key\": 510185, \"label\": \"简阳市\"}\n" +
            "    ],\n" +
            "    \"510300\": [\n" +
            "      {\"key\": 510301, \"label\": \"自贡市市辖区\"},\n" +
            "      {\"key\": 510302, \"label\": \"自流井区\"},\n" +
            "      {\"key\": 510303, \"label\": \"贡井区\"},\n" +
            "      {\"key\": 510304, \"label\": \"大安区\"},\n" +
            "      {\"key\": 510311, \"label\": \"沿滩区\"},\n" +
            "      {\"key\": 510321, \"label\": \"荣县\"},\n" +
            "      {\"key\": 510322, \"label\": \"富顺县\"}\n" +
            "    ],\n" +
            "    \"510400\": [\n" +
            "      {\"key\": 510401, \"label\": \"攀枝花市市辖区\"},\n" +
            "      {\"key\": 510402, \"label\": \"东区\"},\n" +
            "      {\"key\": 510403, \"label\": \"西区\"},\n" +
            "      {\"key\": 510411, \"label\": \"仁和区\"},\n" +
            "      {\"key\": 510421, \"label\": \"米易县\"},\n" +
            "      {\"key\": 510422, \"label\": \"盐边县\"}\n" +
            "    ],\n" +
            "    \"510500\": [\n" +
            "      {\"key\": 510501, \"label\": \"泸州市市辖区\"},\n" +
            "      {\"key\": 510502, \"label\": \"江阳区\"},\n" +
            "      {\"key\": 510503, \"label\": \"纳溪区\"},\n" +
            "      {\"key\": 510504, \"label\": \"龙马潭区\"},\n" +
            "      {\"key\": 510521, \"label\": \"泸县\"},\n" +
            "      {\"key\": 510522, \"label\": \"合江县\"},\n" +
            "      {\"key\": 510524, \"label\": \"叙永县\"},\n" +
            "      {\"key\": 510525, \"label\": \"古蔺县\"}\n" +
            "    ],\n" +
            "    \"510600\": [\n" +
            "      {\"key\": 510601, \"label\": \"德阳市市辖区\"},\n" +
            "      {\"key\": 510603, \"label\": \"旌阳区\"},\n" +
            "      {\"key\": 510623, \"label\": \"中江县\"},\n" +
            "      {\"key\": 510604, \"label\": \"罗江区\"},\n" +
            "      {\"key\": 510681, \"label\": \"广汉市\"},\n" +
            "      {\"key\": 510682, \"label\": \"什邡市\"},\n" +
            "      {\"key\": 510683, \"label\": \"绵竹市\"}\n" +
            "    ],\n" +
            "    \"510700\": [\n" +
            "      {\"key\": 510701, \"label\": \"绵阳市市辖区\"},\n" +
            "      {\"key\": 510703, \"label\": \"涪城区\"},\n" +
            "      {\"key\": 510704, \"label\": \"游仙区\"},\n" +
            "      {\"key\": 510705, \"label\": \"安州区\"},\n" +
            "      {\"key\": 510722, \"label\": \"三台县\"},\n" +
            "      {\"key\": 510723, \"label\": \"盐亭县\"},\n" +
            "      {\"key\": 510725, \"label\": \"梓潼县\"},\n" +
            "      {\"key\": 510726, \"label\": \"北川羌族自治县\"},\n" +
            "      {\"key\": 510727, \"label\": \"平武县\"},\n" +
            "      {\"key\": 510781, \"label\": \"江油市\"}\n" +
            "    ],\n" +
            "    \"510800\": [\n" +
            "      {\"key\": 510801, \"label\": \"广元市市辖区\"},\n" +
            "      {\"key\": 510802, \"label\": \"利州区\"},\n" +
            "      {\"key\": 510811, \"label\": \"昭化区\"},\n" +
            "      {\"key\": 510812, \"label\": \"朝天区\"},\n" +
            "      {\"key\": 510821, \"label\": \"旺苍县\"},\n" +
            "      {\"key\": 510822, \"label\": \"青川县\"},\n" +
            "      {\"key\": 510823, \"label\": \"剑阁县\"},\n" +
            "      {\"key\": 510824, \"label\": \"苍溪县\"}\n" +
            "    ],\n" +
            "    \"510900\": [\n" +
            "      {\"key\": 510901, \"label\": \"遂宁市市辖区\"},\n" +
            "      {\"key\": 510903, \"label\": \"船山区\"},\n" +
            "      {\"key\": 510904, \"label\": \"安居区\"},\n" +
            "      {\"key\": 510921, \"label\": \"蓬溪县\"},\n" +
            "      {\"key\": 510922, \"label\": \"射洪县\"},\n" +
            "      {\"key\": 510923, \"label\": \"大英县\"}\n" +
            "    ],\n" +
            "    \"511000\": [\n" +
            "      {\"key\": 511001, \"label\": \"内江市市辖区\"},\n" +
            "      {\"key\": 511002, \"label\": \"市中区\"},\n" +
            "      {\"key\": 511011, \"label\": \"东兴区\"},\n" +
            "      {\"key\": 511024, \"label\": \"威远县\"},\n" +
            "      {\"key\": 511025, \"label\": \"资中县\"},\n" +
            "      {\"key\": 511083, \"label\": \"隆昌市\"}\n" +
            "    ],\n" +
            "    \"511100\": [\n" +
            "      {\"key\": 511101, \"label\": \"乐山市市辖区\"},\n" +
            "      {\"key\": 511102, \"label\": \"市中区\"},\n" +
            "      {\"key\": 511111, \"label\": \"沙湾区\"},\n" +
            "      {\"key\": 511112, \"label\": \"五通桥区\"},\n" +
            "      {\"key\": 511113, \"label\": \"金口河区\"},\n" +
            "      {\"key\": 511123, \"label\": \"犍为县\"},\n" +
            "      {\"key\": 511124, \"label\": \"井研县\"},\n" +
            "      {\"key\": 511126, \"label\": \"夹江县\"},\n" +
            "      {\"key\": 511129, \"label\": \"沐川县\"},\n" +
            "      {\"key\": 511132, \"label\": \"峨边彝族自治县\"},\n" +
            "      {\"key\": 511133, \"label\": \"马边彝族自治县\"},\n" +
            "      {\"key\": 511181, \"label\": \"峨眉山市\"}\n" +
            "    ],\n" +
            "    \"511300\": [\n" +
            "      {\"key\": 511301, \"label\": \"南充市市辖区\"},\n" +
            "      {\"key\": 511302, \"label\": \"顺庆区\"},\n" +
            "      {\"key\": 511303, \"label\": \"高坪区\"},\n" +
            "      {\"key\": 511304, \"label\": \"嘉陵区\"},\n" +
            "      {\"key\": 511321, \"label\": \"南部县\"},\n" +
            "      {\"key\": 511322, \"label\": \"营山县\"},\n" +
            "      {\"key\": 511323, \"label\": \"蓬安县\"},\n" +
            "      {\"key\": 511324, \"label\": \"仪陇县\"},\n" +
            "      {\"key\": 511325, \"label\": \"西充县\"},\n" +
            "      {\"key\": 511381, \"label\": \"阆中市\"}\n" +
            "    ],\n" +
            "    \"511400\": [\n" +
            "      {\"key\": 511401, \"label\": \"眉山市市辖区\"},\n" +
            "      {\"key\": 511402, \"label\": \"东坡区\"},\n" +
            "      {\"key\": 511403, \"label\": \"彭山区\"},\n" +
            "      {\"key\": 511421, \"label\": \"仁寿县\"},\n" +
            "      {\"key\": 511423, \"label\": \"洪雅县\"},\n" +
            "      {\"key\": 511424, \"label\": \"丹棱县\"},\n" +
            "      {\"key\": 511425, \"label\": \"青神县\"}\n" +
            "    ],\n" +
            "    \"511500\": [\n" +
            "      {\"key\": 511501, \"label\": \"宜宾市市辖区\"},\n" +
            "      {\"key\": 511502, \"label\": \"翠屏区\"},\n" +
            "      {\"key\": 511503, \"label\": \"南溪区\"},\n" +
            "      {\"key\": 511504, \"label\": \"叙州区\"},\n" +
            "      {\"key\": 511523, \"label\": \"江安县\"},\n" +
            "      {\"key\": 511524, \"label\": \"长宁县\"},\n" +
            "      {\"key\": 511525, \"label\": \"高县\"},\n" +
            "      {\"key\": 511526, \"label\": \"珙县\"},\n" +
            "      {\"key\": 511527, \"label\": \"筠连县\"},\n" +
            "      {\"key\": 511528, \"label\": \"兴文县\"},\n" +
            "      {\"key\": 511529, \"label\": \"屏山县\"}\n" +
            "    ],\n" +
            "    \"511600\": [\n" +
            "      {\"key\": 511601, \"label\": \"广安市市辖区\"},\n" +
            "      {\"key\": 511602, \"label\": \"广安区\"},\n" +
            "      {\"key\": 511603, \"label\": \"前锋区\"},\n" +
            "      {\"key\": 511621, \"label\": \"岳池县\"},\n" +
            "      {\"key\": 511622, \"label\": \"武胜县\"},\n" +
            "      {\"key\": 511623, \"label\": \"邻水县\"},\n" +
            "      {\"key\": 511681, \"label\": \"华蓥市\"}\n" +
            "    ],\n" +
            "    \"511700\": [\n" +
            "      {\"key\": 511701, \"label\": \"达州市市辖区\"},\n" +
            "      {\"key\": 511702, \"label\": \"通川区\"},\n" +
            "      {\"key\": 511703, \"label\": \"达川区\"},\n" +
            "      {\"key\": 511722, \"label\": \"宣汉县\"},\n" +
            "      {\"key\": 511723, \"label\": \"开江县\"},\n" +
            "      {\"key\": 511724, \"label\": \"大竹县\"},\n" +
            "      {\"key\": 511725, \"label\": \"渠县\"},\n" +
            "      {\"key\": 511781, \"label\": \"万源市\"}\n" +
            "    ],\n" +
            "    \"511800\": [\n" +
            "      {\"key\": 511801, \"label\": \"雅安市市辖区\"},\n" +
            "      {\"key\": 511802, \"label\": \"雨城区\"},\n" +
            "      {\"key\": 511803, \"label\": \"名山区\"},\n" +
            "      {\"key\": 511822, \"label\": \"荥经县\"},\n" +
            "      {\"key\": 511823, \"label\": \"汉源县\"},\n" +
            "      {\"key\": 511824, \"label\": \"石棉县\"},\n" +
            "      {\"key\": 511825, \"label\": \"天全县\"},\n" +
            "      {\"key\": 511826, \"label\": \"芦山县\"},\n" +
            "      {\"key\": 511827, \"label\": \"宝兴县\"}\n" +
            "    ],\n" +
            "    \"511900\": [\n" +
            "      {\"key\": 511901, \"label\": \"巴中市市辖区\"},\n" +
            "      {\"key\": 511902, \"label\": \"巴州区\"},\n" +
            "      {\"key\": 511903, \"label\": \"恩阳区\"},\n" +
            "      {\"key\": 511921, \"label\": \"通江县\"},\n" +
            "      {\"key\": 511922, \"label\": \"南江县\"},\n" +
            "      {\"key\": 511923, \"label\": \"平昌县\"}\n" +
            "    ],\n" +
            "    \"512000\": [\n" +
            "      {\"key\": 512001, \"label\": \"资阳市市辖区\"},\n" +
            "      {\"key\": 512002, \"label\": \"雁江区\"},\n" +
            "      {\"key\": 512021, \"label\": \"安岳县\"},\n" +
            "      {\"key\": 512022, \"label\": \"乐至县\"}\n" +
            "    ],\n" +
            "    \"513200\": [\n" +
            "      {\"key\": 513201, \"label\": \"马尔康市\"},\n" +
            "      {\"key\": 513221, \"label\": \"汶川县\"},\n" +
            "      {\"key\": 513222, \"label\": \"理县\"},\n" +
            "      {\"key\": 513223, \"label\": \"茂县\"},\n" +
            "      {\"key\": 513224, \"label\": \"松潘县\"},\n" +
            "      {\"key\": 513225, \"label\": \"九寨沟县\"},\n" +
            "      {\"key\": 513226, \"label\": \"金川县\"},\n" +
            "      {\"key\": 513227, \"label\": \"小金县\"},\n" +
            "      {\"key\": 513228, \"label\": \"黑水县\"},\n" +
            "      {\"key\": 513230, \"label\": \"壤塘县\"},\n" +
            "      {\"key\": 513231, \"label\": \"阿坝县\"},\n" +
            "      {\"key\": 513232, \"label\": \"若尔盖县\"},\n" +
            "      {\"key\": 513233, \"label\": \"红原县\"}\n" +
            "    ],\n" +
            "    \"513300\": [\n" +
            "      {\"key\": 513301, \"label\": \"康定市\"},\n" +
            "      {\"key\": 513322, \"label\": \"泸定县\"},\n" +
            "      {\"key\": 513323, \"label\": \"丹巴县\"},\n" +
            "      {\"key\": 513324, \"label\": \"九龙县\"},\n" +
            "      {\"key\": 513325, \"label\": \"雅江县\"},\n" +
            "      {\"key\": 513326, \"label\": \"道孚县\"},\n" +
            "      {\"key\": 513327, \"label\": \"炉霍县\"},\n" +
            "      {\"key\": 513328, \"label\": \"甘孜县\"},\n" +
            "      {\"key\": 513329, \"label\": \"新龙县\"},\n" +
            "      {\"key\": 513330, \"label\": \"德格县\"},\n" +
            "      {\"key\": 513331, \"label\": \"白玉县\"},\n" +
            "      {\"key\": 513332, \"label\": \"石渠县\"},\n" +
            "      {\"key\": 513333, \"label\": \"色达县\"},\n" +
            "      {\"key\": 513334, \"label\": \"理塘县\"},\n" +
            "      {\"key\": 513335, \"label\": \"巴塘县\"},\n" +
            "      {\"key\": 513336, \"label\": \"乡城县\"},\n" +
            "      {\"key\": 513337, \"label\": \"稻城县\"},\n" +
            "      {\"key\": 513338, \"label\": \"得荣县\"}\n" +
            "    ],\n" +
            "    \"513400\": [\n" +
            "      {\"key\": 513401, \"label\": \"西昌市\"},\n" +
            "      {\"key\": 513422, \"label\": \"木里藏族自治县\"},\n" +
            "      {\"key\": 513423, \"label\": \"盐源县\"},\n" +
            "      {\"key\": 513424, \"label\": \"德昌县\"},\n" +
            "      {\"key\": 513425, \"label\": \"会理县\"},\n" +
            "      {\"key\": 513426, \"label\": \"会东县\"},\n" +
            "      {\"key\": 513427, \"label\": \"宁南县\"},\n" +
            "      {\"key\": 513428, \"label\": \"普格县\"},\n" +
            "      {\"key\": 513429, \"label\": \"布拖县\"},\n" +
            "      {\"key\": 513430, \"label\": \"金阳县\"},\n" +
            "      {\"key\": 513431, \"label\": \"昭觉县\"},\n" +
            "      {\"key\": 513432, \"label\": \"喜德县\"},\n" +
            "      {\"key\": 513433, \"label\": \"冕宁县\"},\n" +
            "      {\"key\": 513434, \"label\": \"越西县\"},\n" +
            "      {\"key\": 513435, \"label\": \"甘洛县\"},\n" +
            "      {\"key\": 513436, \"label\": \"美姑县\"},\n" +
            "      {\"key\": 513437, \"label\": \"雷波县\"}\n" +
            "    ],\n" +
            "    \"520100\": [\n" +
            "      {\"key\": 520101, \"label\": \"贵阳市市辖区\"},\n" +
            "      {\"key\": 520102, \"label\": \"南明区\"},\n" +
            "      {\"key\": 520103, \"label\": \"云岩区\"},\n" +
            "      {\"key\": 520111, \"label\": \"花溪区\"},\n" +
            "      {\"key\": 520112, \"label\": \"乌当区\"},\n" +
            "      {\"key\": 520113, \"label\": \"白云区\"},\n" +
            "      {\"key\": 520115, \"label\": \"观山湖区\"},\n" +
            "      {\"key\": 520121, \"label\": \"开阳县\"},\n" +
            "      {\"key\": 520122, \"label\": \"息烽县\"},\n" +
            "      {\"key\": 520123, \"label\": \"修文县\"},\n" +
            "      {\"key\": 520181, \"label\": \"清镇市\"}\n" +
            "    ],\n" +
            "    \"520200\": [\n" +
            "      {\"key\": 520201, \"label\": \"钟山区\"},\n" +
            "      {\"key\": 520203, \"label\": \"六枝特区\"},\n" +
            "      {\"key\": 520221, \"label\": \"水城县\"},\n" +
            "      {\"key\": 520281, \"label\": \"盘州市\"}\n" +
            "    ],\n" +
            "    \"520300\": [\n" +
            "      {\"key\": 520301, \"label\": \"遵义市市辖区\"},\n" +
            "      {\"key\": 520302, \"label\": \"红花岗区\"},\n" +
            "      {\"key\": 520303, \"label\": \"汇川区\"},\n" +
            "      {\"key\": 520304, \"label\": \"播州区\"},\n" +
            "      {\"key\": 520322, \"label\": \"桐梓县\"},\n" +
            "      {\"key\": 520323, \"label\": \"绥阳县\"},\n" +
            "      {\"key\": 520324, \"label\": \"正安县\"},\n" +
            "      {\"key\": 520325, \"label\": \"道真仡佬族苗族自治县\"},\n" +
            "      {\"key\": 520326, \"label\": \"务川仡佬族苗族自治县\"},\n" +
            "      {\"key\": 520327, \"label\": \"凤冈县\"},\n" +
            "      {\"key\": 520328, \"label\": \"湄潭县\"},\n" +
            "      {\"key\": 520329, \"label\": \"余庆县\"},\n" +
            "      {\"key\": 520330, \"label\": \"习水县\"},\n" +
            "      {\"key\": 520381, \"label\": \"赤水市\"},\n" +
            "      {\"key\": 520382, \"label\": \"仁怀市\"}\n" +
            "    ],\n" +
            "    \"520400\": [\n" +
            "      {\"key\": 520401, \"label\": \"安顺市市辖区\"},\n" +
            "      {\"key\": 520402, \"label\": \"西秀区\"},\n" +
            "      {\"key\": 520403, \"label\": \"平坝区\"},\n" +
            "      {\"key\": 520422, \"label\": \"普定县\"},\n" +
            "      {\"key\": 520423, \"label\": \"镇宁布依族苗族自治县\"},\n" +
            "      {\"key\": 520424, \"label\": \"关岭布依族苗族自治县\"},\n" +
            "      {\"key\": 520425, \"label\": \"紫云苗族布依族自治县\"}\n" +
            "    ],\n" +
            "    \"520500\": [\n" +
            "      {\"key\": 520502, \"label\": \"七星关区\"},\n" +
            "      {\"key\": 520521, \"label\": \"大方县\"},\n" +
            "      {\"key\": 520522, \"label\": \"黔西县\"},\n" +
            "      {\"key\": 520523, \"label\": \"金沙县\"},\n" +
            "      {\"key\": 520524, \"label\": \"织金县\"},\n" +
            "      {\"key\": 520525, \"label\": \"纳雍县\"},\n" +
            "      {\"key\": 520526, \"label\": \"威宁彝族回族苗族自治县\"},\n" +
            "      {\"key\": 520527, \"label\": \"赫章县\"}\n" +
            "    ],\n" +
            "    \"520600\": [\n" +
            "      {\"key\": 520602, \"label\": \"碧江区\"},\n" +
            "      {\"key\": 520603, \"label\": \"万山区\"},\n" +
            "      {\"key\": 520621, \"label\": \"江口县\"},\n" +
            "      {\"key\": 520622, \"label\": \"玉屏侗族自治县\"},\n" +
            "      {\"key\": 520623, \"label\": \"石阡县\"},\n" +
            "      {\"key\": 520624, \"label\": \"思南县\"},\n" +
            "      {\"key\": 520625, \"label\": \"印江土家族苗族自治县\"},\n" +
            "      {\"key\": 520626, \"label\": \"德江县\"},\n" +
            "      {\"key\": 520627, \"label\": \"沿河土家族自治县\"},\n" +
            "      {\"key\": 520628, \"label\": \"松桃苗族自治县\"}\n" +
            "    ],\n" +
            "    \"522300\": [\n" +
            "      {\"key\": 522301, \"label\": \"兴义市\"},\n" +
            "      {\"key\": 522302, \"label\": \"兴仁市\"},\n" +
            "      {\"key\": 522323, \"label\": \"普安县\"},\n" +
            "      {\"key\": 522324, \"label\": \"晴隆县\"},\n" +
            "      {\"key\": 522325, \"label\": \"贞丰县\"},\n" +
            "      {\"key\": 522326, \"label\": \"望谟县\"},\n" +
            "      {\"key\": 522327, \"label\": \"册亨县\"},\n" +
            "      {\"key\": 522328, \"label\": \"安龙县\"}\n" +
            "    ],\n" +
            "    \"522600\": [\n" +
            "      {\"key\": 522601, \"label\": \"凯里市\"},\n" +
            "      {\"key\": 522622, \"label\": \"黄平县\"},\n" +
            "      {\"key\": 522623, \"label\": \"施秉县\"},\n" +
            "      {\"key\": 522624, \"label\": \"三穗县\"},\n" +
            "      {\"key\": 522625, \"label\": \"镇远县\"},\n" +
            "      {\"key\": 522626, \"label\": \"岑巩县\"},\n" +
            "      {\"key\": 522627, \"label\": \"天柱县\"},\n" +
            "      {\"key\": 522628, \"label\": \"锦屏县\"},\n" +
            "      {\"key\": 522629, \"label\": \"剑河县\"},\n" +
            "      {\"key\": 522630, \"label\": \"台江县\"},\n" +
            "      {\"key\": 522631, \"label\": \"黎平县\"},\n" +
            "      {\"key\": 522632, \"label\": \"榕江县\"},\n" +
            "      {\"key\": 522633, \"label\": \"从江县\"},\n" +
            "      {\"key\": 522634, \"label\": \"雷山县\"},\n" +
            "      {\"key\": 522635, \"label\": \"麻江县\"},\n" +
            "      {\"key\": 522636, \"label\": \"丹寨县\"}\n" +
            "    ],\n" +
            "    \"522700\": [\n" +
            "      {\"key\": 522701, \"label\": \"都匀市\"},\n" +
            "      {\"key\": 522702, \"label\": \"福泉市\"},\n" +
            "      {\"key\": 522722, \"label\": \"荔波县\"},\n" +
            "      {\"key\": 522723, \"label\": \"贵定县\"},\n" +
            "      {\"key\": 522725, \"label\": \"瓮安县\"},\n" +
            "      {\"key\": 522726, \"label\": \"独山县\"},\n" +
            "      {\"key\": 522727, \"label\": \"平塘县\"},\n" +
            "      {\"key\": 522728, \"label\": \"罗甸县\"},\n" +
            "      {\"key\": 522729, \"label\": \"长顺县\"},\n" +
            "      {\"key\": 522730, \"label\": \"龙里县\"},\n" +
            "      {\"key\": 522731, \"label\": \"惠水县\"},\n" +
            "      {\"key\": 522732, \"label\": \"三都水族自治县\"}\n" +
            "    ],\n" +
            "    \"530100\": [\n" +
            "      {\"key\": 530101, \"label\": \"昆明市市辖区\"},\n" +
            "      {\"key\": 530102, \"label\": \"五华区\"},\n" +
            "      {\"key\": 530103, \"label\": \"盘龙区\"},\n" +
            "      {\"key\": 530111, \"label\": \"官渡区\"},\n" +
            "      {\"key\": 530112, \"label\": \"西山区\"},\n" +
            "      {\"key\": 530113, \"label\": \"东川区\"},\n" +
            "      {\"key\": 530114, \"label\": \"呈贡区\"},\n" +
            "      {\"key\": 530115, \"label\": \"晋宁区\"},\n" +
            "      {\"key\": 530124, \"label\": \"富民县\"},\n" +
            "      {\"key\": 530125, \"label\": \"宜良县\"},\n" +
            "      {\"key\": 530126, \"label\": \"石林彝族自治县\"},\n" +
            "      {\"key\": 530127, \"label\": \"嵩明县\"},\n" +
            "      {\"key\": 530128, \"label\": \"禄劝彝族苗族自治县\"},\n" +
            "      {\"key\": 530129, \"label\": \"寻甸回族彝族自治县\"},\n" +
            "      {\"key\": 530181, \"label\": \"安宁市\"}\n" +
            "    ],\n" +
            "    \"530300\": [\n" +
            "      {\"key\": 530301, \"label\": \"曲靖市市辖区\"},\n" +
            "      {\"key\": 530302, \"label\": \"麒麟区\"},\n" +
            "      {\"key\": 530303, \"label\": \"沾益区\"},\n" +
            "      {\"key\": 530304, \"label\": \"马龙区\"},\n" +
            "      {\"key\": 530322, \"label\": \"陆良县\"},\n" +
            "      {\"key\": 530323, \"label\": \"师宗县\"},\n" +
            "      {\"key\": 530324, \"label\": \"罗平县\"},\n" +
            "      {\"key\": 530325, \"label\": \"富源县\"},\n" +
            "      {\"key\": 530326, \"label\": \"会泽县\"},\n" +
            "      {\"key\": 530381, \"label\": \"宣威市\"}\n" +
            "    ],\n" +
            "    \"530400\": [\n" +
            "      {\"key\": 530401, \"label\": \"玉溪市市辖区\"},\n" +
            "      {\"key\": 530402, \"label\": \"红塔区\"},\n" +
            "      {\"key\": 530403, \"label\": \"江川区\"},\n" +
            "      {\"key\": 530422, \"label\": \"澄江县\"},\n" +
            "      {\"key\": 530423, \"label\": \"通海县\"},\n" +
            "      {\"key\": 530424, \"label\": \"华宁县\"},\n" +
            "      {\"key\": 530425, \"label\": \"易门县\"},\n" +
            "      {\"key\": 530426, \"label\": \"峨山彝族自治县\"},\n" +
            "      {\"key\": 530427, \"label\": \"新平彝族傣族自治县\"},\n" +
            "      {\"key\": 530428, \"label\": \"元江哈尼族彝族傣族自治县\"}\n" +
            "    ],\n" +
            "    \"530500\": [\n" +
            "      {\"key\": 530501, \"label\": \"保山市市辖区\"},\n" +
            "      {\"key\": 530502, \"label\": \"隆阳区\"},\n" +
            "      {\"key\": 530521, \"label\": \"施甸县\"},\n" +
            "      {\"key\": 530523, \"label\": \"龙陵县\"},\n" +
            "      {\"key\": 530524, \"label\": \"昌宁县\"},\n" +
            "      {\"key\": 530581, \"label\": \"腾冲市\"}\n" +
            "    ],\n" +
            "    \"530600\": [\n" +
            "      {\"key\": 530601, \"label\": \"昭通市市辖区\"},\n" +
            "      {\"key\": 530602, \"label\": \"昭阳区\"},\n" +
            "      {\"key\": 530621, \"label\": \"鲁甸县\"},\n" +
            "      {\"key\": 530622, \"label\": \"巧家县\"},\n" +
            "      {\"key\": 530623, \"label\": \"盐津县\"},\n" +
            "      {\"key\": 530624, \"label\": \"大关县\"},\n" +
            "      {\"key\": 530625, \"label\": \"永善县\"},\n" +
            "      {\"key\": 530626, \"label\": \"绥江县\"},\n" +
            "      {\"key\": 530627, \"label\": \"镇雄县\"},\n" +
            "      {\"key\": 530628, \"label\": \"彝良县\"},\n" +
            "      {\"key\": 530629, \"label\": \"威信县\"},\n" +
            "      {\"key\": 530681, \"label\": \"水富市\"}\n" +
            "    ],\n" +
            "    \"530700\": [\n" +
            "      {\"key\": 530701, \"label\": \"丽江市市辖区\"},\n" +
            "      {\"key\": 530702, \"label\": \"古城区\"},\n" +
            "      {\"key\": 530721, \"label\": \"玉龙纳西族自治县\"},\n" +
            "      {\"key\": 530722, \"label\": \"永胜县\"},\n" +
            "      {\"key\": 530723, \"label\": \"华坪县\"},\n" +
            "      {\"key\": 530724, \"label\": \"宁蒗彝族自治县\"}\n" +
            "    ],\n" +
            "    \"530800\": [\n" +
            "      {\"key\": 530801, \"label\": \"普洱市市辖区\"},\n" +
            "      {\"key\": 530802, \"label\": \"思茅区\"},\n" +
            "      {\"key\": 530821, \"label\": \"宁洱哈尼族彝族自治县\"},\n" +
            "      {\"key\": 530822, \"label\": \"墨江哈尼族自治县\"},\n" +
            "      {\"key\": 530823, \"label\": \"景东彝族自治县\"},\n" +
            "      {\"key\": 530824, \"label\": \"景谷傣族彝族自治县\"},\n" +
            "      {\"key\": 530825, \"label\": \"镇沅彝族哈尼族拉祜族自治县\"},\n" +
            "      {\"key\": 530826, \"label\": \"江城哈尼族彝族自治县\"},\n" +
            "      {\"key\": 530827, \"label\": \"孟连傣族拉祜族佤族自治县\"},\n" +
            "      {\"key\": 530828, \"label\": \"澜沧拉祜族自治县\"},\n" +
            "      {\"key\": 530829, \"label\": \"西盟佤族自治县\"}\n" +
            "    ],\n" +
            "    \"530900\": [\n" +
            "      {\"key\": 530901, \"label\": \"临沧市市辖区\"},\n" +
            "      {\"key\": 530902, \"label\": \"临翔区\"},\n" +
            "      {\"key\": 530921, \"label\": \"凤庆县\"},\n" +
            "      {\"key\": 530922, \"label\": \"云县\"},\n" +
            "      {\"key\": 530923, \"label\": \"永德县\"},\n" +
            "      {\"key\": 530924, \"label\": \"镇康县\"},\n" +
            "      {\"key\": 530925, \"label\": \"双江拉祜族佤族布朗族傣族自治县\"},\n" +
            "      {\"key\": 530926, \"label\": \"耿马傣族佤族自治县\"},\n" +
            "      {\"key\": 530927, \"label\": \"沧源佤族自治县\"}\n" +
            "    ],\n" +
            "    \"532300\": [\n" +
            "      {\"key\": 532301, \"label\": \"楚雄市\"},\n" +
            "      {\"key\": 532322, \"label\": \"双柏县\"},\n" +
            "      {\"key\": 532323, \"label\": \"牟定县\"},\n" +
            "      {\"key\": 532324, \"label\": \"南华县\"},\n" +
            "      {\"key\": 532325, \"label\": \"姚安县\"},\n" +
            "      {\"key\": 532326, \"label\": \"大姚县\"},\n" +
            "      {\"key\": 532327, \"label\": \"永仁县\"},\n" +
            "      {\"key\": 532328, \"label\": \"元谋县\"},\n" +
            "      {\"key\": 532329, \"label\": \"武定县\"},\n" +
            "      {\"key\": 532331, \"label\": \"禄丰县\"}\n" +
            "    ],\n" +
            "    \"532500\": [\n" +
            "      {\"key\": 532501, \"label\": \"个旧市\"},\n" +
            "      {\"key\": 532502, \"label\": \"开远市\"},\n" +
            "      {\"key\": 532503, \"label\": \"蒙自市\"},\n" +
            "      {\"key\": 532504, \"label\": \"弥勒市\"},\n" +
            "      {\"key\": 532523, \"label\": \"屏边苗族自治县\"},\n" +
            "      {\"key\": 532524, \"label\": \"建水县\"},\n" +
            "      {\"key\": 532525, \"label\": \"石屏县\"},\n" +
            "      {\"key\": 532527, \"label\": \"泸西县\"},\n" +
            "      {\"key\": 532528, \"label\": \"元阳县\"},\n" +
            "      {\"key\": 532529, \"label\": \"红河县\"},\n" +
            "      {\"key\": 532530, \"label\": \"金平苗族瑶族傣族自治县\"},\n" +
            "      {\"key\": 532531, \"label\": \"绿春县\"},\n" +
            "      {\"key\": 532532, \"label\": \"河口瑶族自治县\"}\n" +
            "    ],\n" +
            "    \"532600\": [\n" +
            "      {\"key\": 532601, \"label\": \"文山市\"},\n" +
            "      {\"key\": 532622, \"label\": \"砚山县\"},\n" +
            "      {\"key\": 532623, \"label\": \"西畴县\"},\n" +
            "      {\"key\": 532624, \"label\": \"麻栗坡县\"},\n" +
            "      {\"key\": 532625, \"label\": \"马关县\"},\n" +
            "      {\"key\": 532626, \"label\": \"丘北县\"},\n" +
            "      {\"key\": 532627, \"label\": \"广南县\"},\n" +
            "      {\"key\": 532628, \"label\": \"富宁县\"}\n" +
            "    ],\n" +
            "    \"532800\": [\n" +
            "      {\"key\": 532801, \"label\": \"景洪市\"},\n" +
            "      {\"key\": 532822, \"label\": \"勐海县\"},\n" +
            "      {\"key\": 532823, \"label\": \"勐腊县\"}\n" +
            "    ],\n" +
            "    \"532900\": [\n" +
            "      {\"key\": 532901, \"label\": \"大理市\"},\n" +
            "      {\"key\": 532922, \"label\": \"漾濞彝族自治县\"},\n" +
            "      {\"key\": 532923, \"label\": \"祥云县\"},\n" +
            "      {\"key\": 532924, \"label\": \"宾川县\"},\n" +
            "      {\"key\": 532925, \"label\": \"弥渡县\"},\n" +
            "      {\"key\": 532926, \"label\": \"南涧彝族自治县\"},\n" +
            "      {\"key\": 532927, \"label\": \"巍山彝族回族自治县\"},\n" +
            "      {\"key\": 532928, \"label\": \"永平县\"},\n" +
            "      {\"key\": 532929, \"label\": \"云龙县\"},\n" +
            "      {\"key\": 532930, \"label\": \"洱源县\"},\n" +
            "      {\"key\": 532931, \"label\": \"剑川县\"},\n" +
            "      {\"key\": 532932, \"label\": \"鹤庆县\"}\n" +
            "    ],\n" +
            "    \"533100\": [\n" +
            "      {\"key\": 533102, \"label\": \"瑞丽市\"},\n" +
            "      {\"key\": 533103, \"label\": \"芒市\"},\n" +
            "      {\"key\": 533122, \"label\": \"梁河县\"},\n" +
            "      {\"key\": 533123, \"label\": \"盈江县\"},\n" +
            "      {\"key\": 533124, \"label\": \"陇川县\"}\n" +
            "    ],\n" +
            "    \"533300\": [\n" +
            "      {\"key\": 533301, \"label\": \"泸水市\"},\n" +
            "      {\"key\": 533323, \"label\": \"福贡县\"},\n" +
            "      {\"key\": 533324, \"label\": \"贡山独龙族怒族自治县\"},\n" +
            "      {\"key\": 533325, \"label\": \"兰坪白族普米族自治县\"}\n" +
            "    ],\n" +
            "    \"533400\": [\n" +
            "      {\"key\": 533401, \"label\": \"香格里拉市\"},\n" +
            "      {\"key\": 533422, \"label\": \"德钦县\"},\n" +
            "      {\"key\": 533423, \"label\": \"维西傈僳族自治县\"}\n" +
            "    ],\n" +
            "    \"540100\": [\n" +
            "      {\"key\": 540101, \"label\": \"拉萨市市辖区\"},\n" +
            "      {\"key\": 540102, \"label\": \"城关区\"},\n" +
            "      {\"key\": 540103, \"label\": \"堆龙德庆区\"},\n" +
            "      {\"key\": 540104, \"label\": \"达孜区\"},\n" +
            "      {\"key\": 540121, \"label\": \"林周县\"},\n" +
            "      {\"key\": 540122, \"label\": \"当雄县\"},\n" +
            "      {\"key\": 540123, \"label\": \"尼木县\"},\n" +
            "      {\"key\": 540124, \"label\": \"曲水县\"},\n" +
            "      {\"key\": 540127, \"label\": \"墨竹工卡县\"}\n" +
            "    ],\n" +
            "    \"540200\": [\n" +
            "      {\"key\": 540202, \"label\": \"桑珠孜区\"},\n" +
            "      {\"key\": 540221, \"label\": \"南木林县\"},\n" +
            "      {\"key\": 540222, \"label\": \"江孜县\"},\n" +
            "      {\"key\": 540223, \"label\": \"定日县\"},\n" +
            "      {\"key\": 540224, \"label\": \"萨迦县\"},\n" +
            "      {\"key\": 540225, \"label\": \"拉孜县\"},\n" +
            "      {\"key\": 540226, \"label\": \"昂仁县\"},\n" +
            "      {\"key\": 540227, \"label\": \"谢通门县\"},\n" +
            "      {\"key\": 540228, \"label\": \"白朗县\"},\n" +
            "      {\"key\": 540229, \"label\": \"仁布县\"},\n" +
            "      {\"key\": 540230, \"label\": \"康马县\"},\n" +
            "      {\"key\": 540231, \"label\": \"定结县\"},\n" +
            "      {\"key\": 540232, \"label\": \"仲巴县\"},\n" +
            "      {\"key\": 540233, \"label\": \"亚东县\"},\n" +
            "      {\"key\": 540234, \"label\": \"吉隆县\"},\n" +
            "      {\"key\": 540235, \"label\": \"聂拉木县\"},\n" +
            "      {\"key\": 540236, \"label\": \"萨嘎县\"},\n" +
            "      {\"key\": 540237, \"label\": \"岗巴县\"}\n" +
            "    ],\n" +
            "    \"540300\": [\n" +
            "      {\"key\": 540302, \"label\": \"卡若区\"},\n" +
            "      {\"key\": 540321, \"label\": \"江达县\"},\n" +
            "      {\"key\": 540322, \"label\": \"贡觉县\"},\n" +
            "      {\"key\": 540323, \"label\": \"类乌齐县\"},\n" +
            "      {\"key\": 540324, \"label\": \"丁青县\"},\n" +
            "      {\"key\": 540325, \"label\": \"察雅县\"},\n" +
            "      {\"key\": 540326, \"label\": \"八宿县\"},\n" +
            "      {\"key\": 540327, \"label\": \"左贡县\"},\n" +
            "      {\"key\": 540328, \"label\": \"芒康县\"},\n" +
            "      {\"key\": 540329, \"label\": \"洛隆县\"},\n" +
            "      {\"key\": 540330, \"label\": \"边坝县\"}\n" +
            "    ],\n" +
            "    \"540400\": [\n" +
            "      {\"key\": 540402, \"label\": \"巴宜区\"},\n" +
            "      {\"key\": 540421, \"label\": \"工布江达县\"},\n" +
            "      {\"key\": 540422, \"label\": \"米林县\"},\n" +
            "      {\"key\": 540423, \"label\": \"墨脱县\"},\n" +
            "      {\"key\": 540424, \"label\": \"波密县\"},\n" +
            "      {\"key\": 540425, \"label\": \"察隅县\"},\n" +
            "      {\"key\": 540426, \"label\": \"朗县\"}\n" +
            "    ],\n" +
            "    \"540500\": [\n" +
            "      {\"key\": 540502, \"label\": \"乃东区\"},\n" +
            "      {\"key\": 540521, \"label\": \"扎囊县\"},\n" +
            "      {\"key\": 540522, \"label\": \"贡嘎县\"},\n" +
            "      {\"key\": 540523, \"label\": \"桑日县\"},\n" +
            "      {\"key\": 540524, \"label\": \"琼结县\"},\n" +
            "      {\"key\": 540525, \"label\": \"曲松县\"},\n" +
            "      {\"key\": 540526, \"label\": \"措美县\"},\n" +
            "      {\"key\": 540527, \"label\": \"洛扎县\"},\n" +
            "      {\"key\": 540528, \"label\": \"加查县\"},\n" +
            "      {\"key\": 540529, \"label\": \"隆子县\"},\n" +
            "      {\"key\": 540530, \"label\": \"错那县\"},\n" +
            "      {\"key\": 540531, \"label\": \"浪卡子县\"}\n" +
            "    ],\n" +
            "    \"540600\": [\n" +
            "      {\"key\": 540602, \"label\": \"色尼区\"},\n" +
            "      {\"key\": 540621, \"label\": \"嘉黎县\"},\n" +
            "      {\"key\": 540622, \"label\": \"比如县\"},\n" +
            "      {\"key\": 540623, \"label\": \"聂荣县\"},\n" +
            "      {\"key\": 540624, \"label\": \"安多县\"},\n" +
            "      {\"key\": 540625, \"label\": \"申扎县\"},\n" +
            "      {\"key\": 540626, \"label\": \"索县\"},\n" +
            "      {\"key\": 540627, \"label\": \"班戈县\"},\n" +
            "      {\"key\": 540628, \"label\": \"巴青县\"},\n" +
            "      {\"key\": 540629, \"label\": \"尼玛县\"},\n" +
            "      {\"key\": 540630, \"label\": \"双湖县\"}\n" +
            "    ],\n" +
            "    \"542500\": [\n" +
            "      {\"key\": 542521, \"label\": \"普兰县\"},\n" +
            "      {\"key\": 542522, \"label\": \"札达县\"},\n" +
            "      {\"key\": 542523, \"label\": \"噶尔县\"},\n" +
            "      {\"key\": 542524, \"label\": \"日土县\"},\n" +
            "      {\"key\": 542525, \"label\": \"革吉县\"},\n" +
            "      {\"key\": 542526, \"label\": \"改则县\"},\n" +
            "      {\"key\": 542527, \"label\": \"措勤县\"}\n" +
            "    ],\n" +
            "    \"610100\": [\n" +
            "      {\"key\": 610101, \"label\": \"西安市市辖区\"},\n" +
            "      {\"key\": 610102, \"label\": \"新城区\"},\n" +
            "      {\"key\": 610103, \"label\": \"碑林区\"},\n" +
            "      {\"key\": 610104, \"label\": \"莲湖区\"},\n" +
            "      {\"key\": 610111, \"label\": \"灞桥区\"},\n" +
            "      {\"key\": 610112, \"label\": \"未央区\"},\n" +
            "      {\"key\": 610113, \"label\": \"雁塔区\"},\n" +
            "      {\"key\": 610114, \"label\": \"阎良区\"},\n" +
            "      {\"key\": 610115, \"label\": \"临潼区\"},\n" +
            "      {\"key\": 610116, \"label\": \"长安区\"},\n" +
            "      {\"key\": 610117, \"label\": \"高陵区\"},\n" +
            "      {\"key\": 610118, \"label\": \"鄠邑区\"},\n" +
            "      {\"key\": 610122, \"label\": \"蓝田县\"},\n" +
            "      {\"key\": 610124, \"label\": \"周至县\"}\n" +
            "    ],\n" +
            "    \"610200\": [\n" +
            "      {\"key\": 610201, \"label\": \"铜川市市辖区\"},\n" +
            "      {\"key\": 610202, \"label\": \"王益区\"},\n" +
            "      {\"key\": 610203, \"label\": \"印台区\"},\n" +
            "      {\"key\": 610204, \"label\": \"耀州区\"},\n" +
            "      {\"key\": 610222, \"label\": \"宜君县\"}\n" +
            "    ],\n" +
            "    \"610300\": [\n" +
            "      {\"key\": 610301, \"label\": \"宝鸡市市辖区\"},\n" +
            "      {\"key\": 610302, \"label\": \"渭滨区\"},\n" +
            "      {\"key\": 610303, \"label\": \"金台区\"},\n" +
            "      {\"key\": 610304, \"label\": \"陈仓区\"},\n" +
            "      {\"key\": 610322, \"label\": \"凤翔县\"},\n" +
            "      {\"key\": 610323, \"label\": \"岐山县\"},\n" +
            "      {\"key\": 610324, \"label\": \"扶风县\"},\n" +
            "      {\"key\": 610326, \"label\": \"眉县\"},\n" +
            "      {\"key\": 610327, \"label\": \"陇县\"},\n" +
            "      {\"key\": 610328, \"label\": \"千阳县\"},\n" +
            "      {\"key\": 610329, \"label\": \"麟游县\"},\n" +
            "      {\"key\": 610330, \"label\": \"凤县\"},\n" +
            "      {\"key\": 610331, \"label\": \"太白县\"}\n" +
            "    ],\n" +
            "    \"610400\": [\n" +
            "      {\"key\": 610401, \"label\": \"咸阳市市辖区\"},\n" +
            "      {\"key\": 610402, \"label\": \"秦都区\"},\n" +
            "      {\"key\": 610403, \"label\": \"杨陵区\"},\n" +
            "      {\"key\": 610404, \"label\": \"渭城区\"},\n" +
            "      {\"key\": 610422, \"label\": \"三原县\"},\n" +
            "      {\"key\": 610423, \"label\": \"泾阳县\"},\n" +
            "      {\"key\": 610424, \"label\": \"乾县\"},\n" +
            "      {\"key\": 610425, \"label\": \"礼泉县\"},\n" +
            "      {\"key\": 610426, \"label\": \"永寿县\"},\n" +
            "      {\"key\": 610482, \"label\": \"彬州市\"},\n" +
            "      {\"key\": 610428, \"label\": \"长武县\"},\n" +
            "      {\"key\": 610429, \"label\": \"旬邑县\"},\n" +
            "      {\"key\": 610430, \"label\": \"淳化县\"},\n" +
            "      {\"key\": 610431, \"label\": \"武功县\"},\n" +
            "      {\"key\": 610481, \"label\": \"兴平市\"}\n" +
            "    ],\n" +
            "    \"610500\": [\n" +
            "      {\"key\": 610501, \"label\": \"渭南市市辖区\"},\n" +
            "      {\"key\": 610502, \"label\": \"临渭区\"},\n" +
            "      {\"key\": 610503, \"label\": \"华州区\"},\n" +
            "      {\"key\": 610522, \"label\": \"潼关县\"},\n" +
            "      {\"key\": 610523, \"label\": \"大荔县\"},\n" +
            "      {\"key\": 610524, \"label\": \"合阳县\"},\n" +
            "      {\"key\": 610525, \"label\": \"澄城县\"},\n" +
            "      {\"key\": 610526, \"label\": \"蒲城县\"},\n" +
            "      {\"key\": 610527, \"label\": \"白水县\"},\n" +
            "      {\"key\": 610528, \"label\": \"富平县\"},\n" +
            "      {\"key\": 610581, \"label\": \"韩城市\"},\n" +
            "      {\"key\": 610582, \"label\": \"华阴市\"}\n" +
            "    ],\n" +
            "    \"610600\": [\n" +
            "      {\"key\": 610601, \"label\": \"延安市市辖区\"},\n" +
            "      {\"key\": 610602, \"label\": \"宝塔区\"},\n" +
            "      {\"key\": 610603, \"label\": \"安塞区\"},\n" +
            "      {\"key\": 610621, \"label\": \"延长县\"},\n" +
            "      {\"key\": 610622, \"label\": \"延川县\"},\n" +
            "      {\"key\": 610623, \"label\": \"子长县\"},\n" +
            "      {\"key\": 610625, \"label\": \"志丹县\"},\n" +
            "      {\"key\": 610626, \"label\": \"吴起县\"},\n" +
            "      {\"key\": 610627, \"label\": \"甘泉县\"},\n" +
            "      {\"key\": 610628, \"label\": \"富县\"},\n" +
            "      {\"key\": 610629, \"label\": \"洛川县\"},\n" +
            "      {\"key\": 610630, \"label\": \"宜川县\"},\n" +
            "      {\"key\": 610631, \"label\": \"黄龙县\"},\n" +
            "      {\"key\": 610632, \"label\": \"黄陵县\"}\n" +
            "    ],\n" +
            "    \"610700\": [\n" +
            "      {\"key\": 610701, \"label\": \"汉中市市辖区\"},\n" +
            "      {\"key\": 610702, \"label\": \"汉台区\"},\n" +
            "      {\"key\": 610703, \"label\": \"南郑区\"},\n" +
            "      {\"key\": 610722, \"label\": \"城固县\"},\n" +
            "      {\"key\": 610723, \"label\": \"洋县\"},\n" +
            "      {\"key\": 610724, \"label\": \"西乡县\"},\n" +
            "      {\"key\": 610725, \"label\": \"勉县\"},\n" +
            "      {\"key\": 610726, \"label\": \"宁强县\"},\n" +
            "      {\"key\": 610727, \"label\": \"略阳县\"},\n" +
            "      {\"key\": 610728, \"label\": \"镇巴县\"},\n" +
            "      {\"key\": 610729, \"label\": \"留坝县\"},\n" +
            "      {\"key\": 610730, \"label\": \"佛坪县\"}\n" +
            "    ],\n" +
            "    \"610800\": [\n" +
            "      {\"key\": 610801, \"label\": \"榆林市市辖区\"},\n" +
            "      {\"key\": 610802, \"label\": \"榆阳区\"},\n" +
            "      {\"key\": 610803, \"label\": \"横山区\"},\n" +
            "      {\"key\": 610822, \"label\": \"府谷县\"},\n" +
            "      {\"key\": 610824, \"label\": \"靖边县\"},\n" +
            "      {\"key\": 610825, \"label\": \"定边县\"},\n" +
            "      {\"key\": 610826, \"label\": \"绥德县\"},\n" +
            "      {\"key\": 610827, \"label\": \"米脂县\"},\n" +
            "      {\"key\": 610828, \"label\": \"佳县\"},\n" +
            "      {\"key\": 610829, \"label\": \"吴堡县\"},\n" +
            "      {\"key\": 610830, \"label\": \"清涧县\"},\n" +
            "      {\"key\": 610831, \"label\": \"子洲县\"},\n" +
            "      {\"key\": 610881, \"label\": \"神木市\"}\n" +
            "    ],\n" +
            "    \"610900\": [\n" +
            "      {\"key\": 610901, \"label\": \"安康市市辖区\"},\n" +
            "      {\"key\": 610902, \"label\": \"汉滨区\"},\n" +
            "      {\"key\": 610921, \"label\": \"汉阴县\"},\n" +
            "      {\"key\": 610922, \"label\": \"石泉县\"},\n" +
            "      {\"key\": 610923, \"label\": \"宁陕县\"},\n" +
            "      {\"key\": 610924, \"label\": \"紫阳县\"},\n" +
            "      {\"key\": 610925, \"label\": \"岚皋县\"},\n" +
            "      {\"key\": 610926, \"label\": \"平利县\"},\n" +
            "      {\"key\": 610927, \"label\": \"镇坪县\"},\n" +
            "      {\"key\": 610928, \"label\": \"旬阳县\"},\n" +
            "      {\"key\": 610929, \"label\": \"白河县\"}\n" +
            "    ],\n" +
            "    \"611000\": [\n" +
            "      {\"key\": 611001, \"label\": \"商洛市市辖区\"},\n" +
            "      {\"key\": 611002, \"label\": \"商州区\"},\n" +
            "      {\"key\": 611021, \"label\": \"洛南县\"},\n" +
            "      {\"key\": 611022, \"label\": \"丹凤县\"},\n" +
            "      {\"key\": 611023, \"label\": \"商南县\"},\n" +
            "      {\"key\": 611024, \"label\": \"山阳县\"},\n" +
            "      {\"key\": 611025, \"label\": \"镇安县\"},\n" +
            "      {\"key\": 611026, \"label\": \"柞水县\"}\n" +
            "    ],\n" +
            "    \"620100\": [\n" +
            "      {\"key\": 620101, \"label\": \"兰州市市辖区\"},\n" +
            "      {\"key\": 620102, \"label\": \"城关区\"},\n" +
            "      {\"key\": 620103, \"label\": \"七里河区\"},\n" +
            "      {\"key\": 620104, \"label\": \"西固区\"},\n" +
            "      {\"key\": 620105, \"label\": \"安宁区\"},\n" +
            "      {\"key\": 620111, \"label\": \"红古区\"},\n" +
            "      {\"key\": 620121, \"label\": \"永登县\"},\n" +
            "      {\"key\": 620122, \"label\": \"皋兰县\"},\n" +
            "      {\"key\": 620123, \"label\": \"榆中县\"}\n" +
            "    ],\n" +
            "    \"620200\": [{\"key\": 620201, \"label\": \"嘉峪关市市辖区\"}],\n" +
            "    \"620300\": [\n" +
            "      {\"key\": 620301, \"label\": \"金昌市市辖区\"},\n" +
            "      {\"key\": 620302, \"label\": \"金川区\"},\n" +
            "      {\"key\": 620321, \"label\": \"永昌县\"}\n" +
            "    ],\n" +
            "    \"620400\": [\n" +
            "      {\"key\": 620401, \"label\": \"白银市市辖区\"},\n" +
            "      {\"key\": 620402, \"label\": \"白银区\"},\n" +
            "      {\"key\": 620403, \"label\": \"平川区\"},\n" +
            "      {\"key\": 620421, \"label\": \"靖远县\"},\n" +
            "      {\"key\": 620422, \"label\": \"会宁县\"},\n" +
            "      {\"key\": 620423, \"label\": \"景泰县\"}\n" +
            "    ],\n" +
            "    \"620500\": [\n" +
            "      {\"key\": 620501, \"label\": \"天水市市辖区\"},\n" +
            "      {\"key\": 620502, \"label\": \"秦州区\"},\n" +
            "      {\"key\": 620503, \"label\": \"麦积区\"},\n" +
            "      {\"key\": 620521, \"label\": \"清水县\"},\n" +
            "      {\"key\": 620522, \"label\": \"秦安县\"},\n" +
            "      {\"key\": 620523, \"label\": \"甘谷县\"},\n" +
            "      {\"key\": 620524, \"label\": \"武山县\"},\n" +
            "      {\"key\": 620525, \"label\": \"张家川回族自治县\"}\n" +
            "    ],\n" +
            "    \"620600\": [\n" +
            "      {\"key\": 620601, \"label\": \"武威市市辖区\"},\n" +
            "      {\"key\": 620602, \"label\": \"凉州区\"},\n" +
            "      {\"key\": 620621, \"label\": \"民勤县\"},\n" +
            "      {\"key\": 620622, \"label\": \"古浪县\"},\n" +
            "      {\"key\": 620623, \"label\": \"天祝藏族自治县\"}\n" +
            "    ],\n" +
            "    \"620700\": [\n" +
            "      {\"key\": 620701, \"label\": \"张掖市市辖区\"},\n" +
            "      {\"key\": 620702, \"label\": \"甘州区\"},\n" +
            "      {\"key\": 620721, \"label\": \"肃南裕固族自治县\"},\n" +
            "      {\"key\": 620722, \"label\": \"民乐县\"},\n" +
            "      {\"key\": 620723, \"label\": \"临泽县\"},\n" +
            "      {\"key\": 620724, \"label\": \"高台县\"},\n" +
            "      {\"key\": 620725, \"label\": \"山丹县\"}\n" +
            "    ],\n" +
            "    \"620800\": [\n" +
            "      {\"key\": 620801, \"label\": \"平凉市市辖区\"},\n" +
            "      {\"key\": 620802, \"label\": \"崆峒区\"},\n" +
            "      {\"key\": 620821, \"label\": \"泾川县\"},\n" +
            "      {\"key\": 620822, \"label\": \"灵台县\"},\n" +
            "      {\"key\": 620823, \"label\": \"崇信县\"},\n" +
            "      {\"key\": 620881, \"label\": \"华亭市\"},\n" +
            "      {\"key\": 620825, \"label\": \"庄浪县\"},\n" +
            "      {\"key\": 620826, \"label\": \"静宁县\"}\n" +
            "    ],\n" +
            "    \"620900\": [\n" +
            "      {\"key\": 620901, \"label\": \"酒泉市市辖区\"},\n" +
            "      {\"key\": 620902, \"label\": \"肃州区\"},\n" +
            "      {\"key\": 620921, \"label\": \"金塔县\"},\n" +
            "      {\"key\": 620922, \"label\": \"瓜州县\"},\n" +
            "      {\"key\": 620923, \"label\": \"肃北蒙古族自治县\"},\n" +
            "      {\"key\": 620924, \"label\": \"阿克塞哈萨克族自治县\"},\n" +
            "      {\"key\": 620981, \"label\": \"玉门市\"},\n" +
            "      {\"key\": 620982, \"label\": \"敦煌市\"}\n" +
            "    ],\n" +
            "    \"621000\": [\n" +
            "      {\"key\": 621001, \"label\": \"庆阳市市辖区\"},\n" +
            "      {\"key\": 621002, \"label\": \"西峰区\"},\n" +
            "      {\"key\": 621021, \"label\": \"庆城县\"},\n" +
            "      {\"key\": 621022, \"label\": \"环县\"},\n" +
            "      {\"key\": 621023, \"label\": \"华池县\"},\n" +
            "      {\"key\": 621024, \"label\": \"合水县\"},\n" +
            "      {\"key\": 621025, \"label\": \"正宁县\"},\n" +
            "      {\"key\": 621026, \"label\": \"宁县\"},\n" +
            "      {\"key\": 621027, \"label\": \"镇原县\"}\n" +
            "    ],\n" +
            "    \"621100\": [\n" +
            "      {\"key\": 621101, \"label\": \"定西市市辖区\"},\n" +
            "      {\"key\": 621102, \"label\": \"安定区\"},\n" +
            "      {\"key\": 621121, \"label\": \"通渭县\"},\n" +
            "      {\"key\": 621122, \"label\": \"陇西县\"},\n" +
            "      {\"key\": 621123, \"label\": \"渭源县\"},\n" +
            "      {\"key\": 621124, \"label\": \"临洮县\"},\n" +
            "      {\"key\": 621125, \"label\": \"漳县\"},\n" +
            "      {\"key\": 621126, \"label\": \"岷县\"}\n" +
            "    ],\n" +
            "    \"621200\": [\n" +
            "      {\"key\": 621201, \"label\": \"陇南市市辖区\"},\n" +
            "      {\"key\": 621202, \"label\": \"武都区\"},\n" +
            "      {\"key\": 621221, \"label\": \"成县\"},\n" +
            "      {\"key\": 621222, \"label\": \"文县\"},\n" +
            "      {\"key\": 621223, \"label\": \"宕昌县\"},\n" +
            "      {\"key\": 621224, \"label\": \"康县\"},\n" +
            "      {\"key\": 621225, \"label\": \"西和县\"},\n" +
            "      {\"key\": 621226, \"label\": \"礼县\"},\n" +
            "      {\"key\": 621227, \"label\": \"徽县\"},\n" +
            "      {\"key\": 621228, \"label\": \"两当县\"}\n" +
            "    ],\n" +
            "    \"622900\": [\n" +
            "      {\"key\": 622901, \"label\": \"临夏市\"},\n" +
            "      {\"key\": 622921, \"label\": \"临夏县\"},\n" +
            "      {\"key\": 622922, \"label\": \"康乐县\"},\n" +
            "      {\"key\": 622923, \"label\": \"永靖县\"},\n" +
            "      {\"key\": 622924, \"label\": \"广河县\"},\n" +
            "      {\"key\": 622925, \"label\": \"和政县\"},\n" +
            "      {\"key\": 622926, \"label\": \"东乡族自治县\"},\n" +
            "      {\"key\": 622927, \"label\": \"积石山保安族东乡族撒拉族自治县\"}\n" +
            "    ],\n" +
            "    \"623000\": [\n" +
            "      {\"key\": 623001, \"label\": \"合作市\"},\n" +
            "      {\"key\": 623021, \"label\": \"临潭县\"},\n" +
            "      {\"key\": 623022, \"label\": \"卓尼县\"},\n" +
            "      {\"key\": 623023, \"label\": \"舟曲县\"},\n" +
            "      {\"key\": 623024, \"label\": \"迭部县\"},\n" +
            "      {\"key\": 623025, \"label\": \"玛曲县\"},\n" +
            "      {\"key\": 623026, \"label\": \"碌曲县\"},\n" +
            "      {\"key\": 623027, \"label\": \"夏河县\"}\n" +
            "    ],\n" +
            "    \"630100\": [\n" +
            "      {\"key\": 630101, \"label\": \"西宁市市辖区\"},\n" +
            "      {\"key\": 630102, \"label\": \"城东区\"},\n" +
            "      {\"key\": 630103, \"label\": \"城中区\"},\n" +
            "      {\"key\": 630104, \"label\": \"城西区\"},\n" +
            "      {\"key\": 630105, \"label\": \"城北区\"},\n" +
            "      {\"key\": 630121, \"label\": \"大通回族土族自治县\"},\n" +
            "      {\"key\": 630122, \"label\": \"湟中县\"},\n" +
            "      {\"key\": 630123, \"label\": \"湟源县\"}\n" +
            "    ],\n" +
            "    \"630200\": [\n" +
            "      {\"key\": 630202, \"label\": \"乐都区\"},\n" +
            "      {\"key\": 630203, \"label\": \"平安区\"},\n" +
            "      {\"key\": 630222, \"label\": \"民和回族土族自治县\"},\n" +
            "      {\"key\": 630223, \"label\": \"互助土族自治县\"},\n" +
            "      {\"key\": 630224, \"label\": \"化隆回族自治县\"},\n" +
            "      {\"key\": 630225, \"label\": \"循化撒拉族自治县\"}\n" +
            "    ],\n" +
            "    \"632200\": [\n" +
            "      {\"key\": 632221, \"label\": \"门源回族自治县\"},\n" +
            "      {\"key\": 632222, \"label\": \"祁连县\"},\n" +
            "      {\"key\": 632223, \"label\": \"海晏县\"},\n" +
            "      {\"key\": 632224, \"label\": \"刚察县\"}\n" +
            "    ],\n" +
            "    \"632300\": [\n" +
            "      {\"key\": 632321, \"label\": \"同仁县\"},\n" +
            "      {\"key\": 632322, \"label\": \"尖扎县\"},\n" +
            "      {\"key\": 632323, \"label\": \"泽库县\"},\n" +
            "      {\"key\": 632324, \"label\": \"河南蒙古族自治县\"}\n" +
            "    ],\n" +
            "    \"632500\": [\n" +
            "      {\"key\": 632521, \"label\": \"共和县\"},\n" +
            "      {\"key\": 632522, \"label\": \"同德县\"},\n" +
            "      {\"key\": 632523, \"label\": \"贵德县\"},\n" +
            "      {\"key\": 632524, \"label\": \"兴海县\"},\n" +
            "      {\"key\": 632525, \"label\": \"贵南县\"}\n" +
            "    ],\n" +
            "    \"632600\": [\n" +
            "      {\"key\": 632621, \"label\": \"玛沁县\"},\n" +
            "      {\"key\": 632622, \"label\": \"班玛县\"},\n" +
            "      {\"key\": 632623, \"label\": \"甘德县\"},\n" +
            "      {\"key\": 632624, \"label\": \"达日县\"},\n" +
            "      {\"key\": 632625, \"label\": \"久治县\"},\n" +
            "      {\"key\": 632626, \"label\": \"玛多县\"}\n" +
            "    ],\n" +
            "    \"632700\": [\n" +
            "      {\"key\": 632701, \"label\": \"玉树市\"},\n" +
            "      {\"key\": 632722, \"label\": \"杂多县\"},\n" +
            "      {\"key\": 632723, \"label\": \"称多县\"},\n" +
            "      {\"key\": 632724, \"label\": \"治多县\"},\n" +
            "      {\"key\": 632725, \"label\": \"囊谦县\"},\n" +
            "      {\"key\": 632726, \"label\": \"曲麻莱县\"}\n" +
            "    ],\n" +
            "    \"632800\": [\n" +
            "      {\"key\": 632801, \"label\": \"格尔木市\"},\n" +
            "      {\"key\": 632802, \"label\": \"德令哈市\"},\n" +
            "      {\"key\": 632803, \"label\": \"茫崖市\"},\n" +
            "      {\"key\": 632821, \"label\": \"乌兰县\"},\n" +
            "      {\"key\": 632822, \"label\": \"都兰县\"},\n" +
            "      {\"key\": 632823, \"label\": \"天峻县\"},\n" +
            "      {\"key\": 632825, \"label\": \"海西蒙古族藏族自治州直辖\"}\n" +
            "    ],\n" +
            "    \"640100\": [\n" +
            "      {\"key\": 640101, \"label\": \"银川市市辖区\"},\n" +
            "      {\"key\": 640104, \"label\": \"兴庆区\"},\n" +
            "      {\"key\": 640105, \"label\": \"西夏区\"},\n" +
            "      {\"key\": 640106, \"label\": \"金凤区\"},\n" +
            "      {\"key\": 640121, \"label\": \"永宁县\"},\n" +
            "      {\"key\": 640122, \"label\": \"贺兰县\"},\n" +
            "      {\"key\": 640181, \"label\": \"灵武市\"}\n" +
            "    ],\n" +
            "    \"640200\": [\n" +
            "      {\"key\": 640201, \"label\": \"石嘴山市市辖区\"},\n" +
            "      {\"key\": 640202, \"label\": \"大武口区\"},\n" +
            "      {\"key\": 640205, \"label\": \"惠农区\"},\n" +
            "      {\"key\": 640221, \"label\": \"平罗县\"}\n" +
            "    ],\n" +
            "    \"640300\": [\n" +
            "      {\"key\": 640301, \"label\": \"吴忠市市辖区\"},\n" +
            "      {\"key\": 640302, \"label\": \"利通区\"},\n" +
            "      {\"key\": 640303, \"label\": \"红寺堡区\"},\n" +
            "      {\"key\": 640323, \"label\": \"盐池县\"},\n" +
            "      {\"key\": 640324, \"label\": \"同心县\"},\n" +
            "      {\"key\": 640381, \"label\": \"青铜峡市\"}\n" +
            "    ],\n" +
            "    \"640400\": [\n" +
            "      {\"key\": 640401, \"label\": \"固原市市辖区\"},\n" +
            "      {\"key\": 640402, \"label\": \"原州区\"},\n" +
            "      {\"key\": 640422, \"label\": \"西吉县\"},\n" +
            "      {\"key\": 640423, \"label\": \"隆德县\"},\n" +
            "      {\"key\": 640424, \"label\": \"泾源县\"},\n" +
            "      {\"key\": 640425, \"label\": \"彭阳县\"}\n" +
            "    ],\n" +
            "    \"640500\": [\n" +
            "      {\"key\": 640501, \"label\": \"中卫市市辖区\"},\n" +
            "      {\"key\": 640502, \"label\": \"沙坡头区\"},\n" +
            "      {\"key\": 640521, \"label\": \"中宁县\"},\n" +
            "      {\"key\": 640522, \"label\": \"海原县\"}\n" +
            "    ],\n" +
            "    \"650100\": [\n" +
            "      {\"key\": 650101, \"label\": \"乌鲁木齐市市辖区\"},\n" +
            "      {\"key\": 650102, \"label\": \"天山区\"},\n" +
            "      {\"key\": 650103, \"label\": \"沙依巴克区\"},\n" +
            "      {\"key\": 650104, \"label\": \"新市区\"},\n" +
            "      {\"key\": 650105, \"label\": \"水磨沟区\"},\n" +
            "      {\"key\": 650106, \"label\": \"头屯河区\"},\n" +
            "      {\"key\": 650107, \"label\": \"达坂城区\"},\n" +
            "      {\"key\": 650109, \"label\": \"米东区\"},\n" +
            "      {\"key\": 650121, \"label\": \"乌鲁木齐县\"}\n" +
            "    ],\n" +
            "    \"650200\": [\n" +
            "      {\"key\": 650201, \"label\": \"克拉玛依市市辖区\"},\n" +
            "      {\"key\": 650202, \"label\": \"独山子区\"},\n" +
            "      {\"key\": 650203, \"label\": \"克拉玛依区\"},\n" +
            "      {\"key\": 650204, \"label\": \"白碱滩区\"},\n" +
            "      {\"key\": 650205, \"label\": \"乌尔禾区\"}\n" +
            "    ],\n" +
            "    \"650400\": [\n" +
            "      {\"key\": 650402, \"label\": \"高昌区\"},\n" +
            "      {\"key\": 650421, \"label\": \"鄯善县\"},\n" +
            "      {\"key\": 650422, \"label\": \"托克逊县\"}\n" +
            "    ],\n" +
            "    \"650500\": [\n" +
            "      {\"key\": 650502, \"label\": \"伊州区\"},\n" +
            "      {\"key\": 650521, \"label\": \"巴里坤哈萨克自治县\"},\n" +
            "      {\"key\": 650522, \"label\": \"伊吾县\"}\n" +
            "    ],\n" +
            "    \"652300\": [\n" +
            "      {\"key\": 652301, \"label\": \"昌吉市\"},\n" +
            "      {\"key\": 652302, \"label\": \"阜康市\"},\n" +
            "      {\"key\": 652323, \"label\": \"呼图壁县\"},\n" +
            "      {\"key\": 652324, \"label\": \"玛纳斯县\"},\n" +
            "      {\"key\": 652325, \"label\": \"奇台县\"},\n" +
            "      {\"key\": 652327, \"label\": \"吉木萨尔县\"},\n" +
            "      {\"key\": 652328, \"label\": \"木垒哈萨克自治县\"}\n" +
            "    ],\n" +
            "    \"652700\": [\n" +
            "      {\"key\": 652701, \"label\": \"博乐市\"},\n" +
            "      {\"key\": 652702, \"label\": \"阿拉山口市\"},\n" +
            "      {\"key\": 652722, \"label\": \"精河县\"},\n" +
            "      {\"key\": 652723, \"label\": \"温泉县\"}\n" +
            "    ],\n" +
            "    \"652800\": [\n" +
            "      {\"key\": 652801, \"label\": \"库尔勒市\"},\n" +
            "      {\"key\": 652822, \"label\": \"轮台县\"},\n" +
            "      {\"key\": 652823, \"label\": \"尉犁县\"},\n" +
            "      {\"key\": 652824, \"label\": \"若羌县\"},\n" +
            "      {\"key\": 652825, \"label\": \"且末县\"},\n" +
            "      {\"key\": 652826, \"label\": \"焉耆回族自治县\"},\n" +
            "      {\"key\": 652827, \"label\": \"和静县\"},\n" +
            "      {\"key\": 652828, \"label\": \"和硕县\"},\n" +
            "      {\"key\": 652829, \"label\": \"博湖县\"}\n" +
            "    ],\n" +
            "    \"652900\": [\n" +
            "      {\"key\": 652901, \"label\": \"阿克苏市\"},\n" +
            "      {\"key\": 652922, \"label\": \"温宿县\"},\n" +
            "      {\"key\": 652923, \"label\": \"库车县\"},\n" +
            "      {\"key\": 652924, \"label\": \"沙雅县\"},\n" +
            "      {\"key\": 652925, \"label\": \"新和县\"},\n" +
            "      {\"key\": 652926, \"label\": \"拜城县\"},\n" +
            "      {\"key\": 652927, \"label\": \"乌什县\"},\n" +
            "      {\"key\": 652928, \"label\": \"阿瓦提县\"},\n" +
            "      {\"key\": 652929, \"label\": \"柯坪县\"}\n" +
            "    ],\n" +
            "    \"653000\": [\n" +
            "      {\"key\": 653001, \"label\": \"阿图什市\"},\n" +
            "      {\"key\": 653022, \"label\": \"阿克陶县\"},\n" +
            "      {\"key\": 653023, \"label\": \"阿合奇县\"},\n" +
            "      {\"key\": 653024, \"label\": \"乌恰县\"}\n" +
            "    ],\n" +
            "    \"653100\": [\n" +
            "      {\"key\": 653101, \"label\": \"喀什市\"},\n" +
            "      {\"key\": 653121, \"label\": \"疏附县\"},\n" +
            "      {\"key\": 653122, \"label\": \"疏勒县\"},\n" +
            "      {\"key\": 653123, \"label\": \"英吉沙县\"},\n" +
            "      {\"key\": 653124, \"label\": \"泽普县\"},\n" +
            "      {\"key\": 653125, \"label\": \"莎车县\"},\n" +
            "      {\"key\": 653126, \"label\": \"叶城县\"},\n" +
            "      {\"key\": 653127, \"label\": \"麦盖提县\"},\n" +
            "      {\"key\": 653128, \"label\": \"岳普湖县\"},\n" +
            "      {\"key\": 653129, \"label\": \"伽师县\"},\n" +
            "      {\"key\": 653130, \"label\": \"巴楚县\"},\n" +
            "      {\"key\": 653131, \"label\": \"塔什库尔干塔吉克自治县\"}\n" +
            "    ],\n" +
            "    \"653200\": [\n" +
            "      {\"key\": 653201, \"label\": \"和田市\"},\n" +
            "      {\"key\": 653221, \"label\": \"和田县\"},\n" +
            "      {\"key\": 653222, \"label\": \"墨玉县\"},\n" +
            "      {\"key\": 653223, \"label\": \"皮山县\"},\n" +
            "      {\"key\": 653224, \"label\": \"洛浦县\"},\n" +
            "      {\"key\": 653225, \"label\": \"策勒县\"},\n" +
            "      {\"key\": 653226, \"label\": \"于田县\"},\n" +
            "      {\"key\": 653227, \"label\": \"民丰县\"}\n" +
            "    ],\n" +
            "    \"654000\": [\n" +
            "      {\"key\": 654002, \"label\": \"伊宁市\"},\n" +
            "      {\"key\": 654003, \"label\": \"奎屯市\"},\n" +
            "      {\"key\": 654004, \"label\": \"霍尔果斯市\"},\n" +
            "      {\"key\": 654021, \"label\": \"伊宁县\"},\n" +
            "      {\"key\": 654022, \"label\": \"察布查尔锡伯自治县\"},\n" +
            "      {\"key\": 654023, \"label\": \"霍城县\"},\n" +
            "      {\"key\": 654024, \"label\": \"巩留县\"},\n" +
            "      {\"key\": 654025, \"label\": \"新源县\"},\n" +
            "      {\"key\": 654026, \"label\": \"昭苏县\"},\n" +
            "      {\"key\": 654027, \"label\": \"特克斯县\"},\n" +
            "      {\"key\": 654028, \"label\": \"尼勒克县\"}\n" +
            "    ],\n" +
            "    \"654200\": [\n" +
            "      {\"key\": 654201, \"label\": \"塔城市\"},\n" +
            "      {\"key\": 654202, \"label\": \"乌苏市\"},\n" +
            "      {\"key\": 654221, \"label\": \"额敏县\"},\n" +
            "      {\"key\": 654223, \"label\": \"沙湾县\"},\n" +
            "      {\"key\": 654224, \"label\": \"托里县\"},\n" +
            "      {\"key\": 654225, \"label\": \"裕民县\"},\n" +
            "      {\"key\": 654226, \"label\": \"和布克赛尔蒙古自治县\"}\n" +
            "    ],\n" +
            "    \"654300\": [\n" +
            "      {\"key\": 654301, \"label\": \"阿勒泰市\"},\n" +
            "      {\"key\": 654321, \"label\": \"布尔津县\"},\n" +
            "      {\"key\": 654322, \"label\": \"富蕴县\"},\n" +
            "      {\"key\": 654323, \"label\": \"福海县\"},\n" +
            "      {\"key\": 654324, \"label\": \"哈巴河县\"},\n" +
            "      {\"key\": 654325, \"label\": \"青河县\"},\n" +
            "      {\"key\": 654326, \"label\": \"吉木乃县\"}\n" +
            "    ],\n" +
            "    \"659000\": [\n" +
            "      {\"key\": 659001, \"label\": \"石河子市\"},\n" +
            "      {\"key\": 659002, \"label\": \"阿拉尔市\"},\n" +
            "      {\"key\": 659003, \"label\": \"图木舒克市\"},\n" +
            "      {\"key\": 659004, \"label\": \"五家渠市\"},\n" +
            "      {\"key\": 659005, \"label\": \"北屯市\"},\n" +
            "      {\"key\": 659006, \"label\": \"铁门关市\"},\n" +
            "      {\"key\": 659007, \"label\": \"双河市\"},\n" +
            "      {\"key\": 659008, \"label\": \"可克达拉市\"},\n" +
            "      {\"key\": 659009, \"label\": \"昆玉市\"}\n" +
            "    ],\n" +
            "    \"810000\": [\n" +
            "      {\"key\": 810001, \"label\": \"中西区\"},\n" +
            "      {\"key\": 810002, \"label\": \"湾仔区\"},\n" +
            "      {\"key\": 810003, \"label\": \"东区\"},\n" +
            "      {\"key\": 810004, \"label\": \"南区\"},\n" +
            "      {\"key\": 810005, \"label\": \"油尖旺区\"},\n" +
            "      {\"key\": 810006, \"label\": \"深水埗区\"},\n" +
            "      {\"key\": 810007, \"label\": \"九龙城区\"},\n" +
            "      {\"key\": 810008, \"label\": \"黄大仙区\"},\n" +
            "      {\"key\": 810009, \"label\": \"观塘区\"},\n" +
            "      {\"key\": 810010, \"label\": \"荃湾区\"},\n" +
            "      {\"key\": 810011, \"label\": \"屯门区\"},\n" +
            "      {\"key\": 810012, \"label\": \"元朗区\"},\n" +
            "      {\"key\": 810013, \"label\": \"北区\"},\n" +
            "      {\"key\": 810014, \"label\": \"大埔区\"},\n" +
            "      {\"key\": 810015, \"label\": \"西贡区\"},\n" +
            "      {\"key\": 810016, \"label\": \"沙田区\"},\n" +
            "      {\"key\": 810017, \"label\": \"葵青区\"},\n" +
            "      {\"key\": 810018, \"label\": \"离岛区\"}\n" +
            "    ],\n" +
            "    \"820000\": [\n" +
            "      {\"key\": 820001, \"label\": \"花地玛堂区\"},\n" +
            "      {\"key\": 820002, \"label\": \"花王堂区\"},\n" +
            "      {\"key\": 820003, \"label\": \"望德堂区\"},\n" +
            "      {\"key\": 820004, \"label\": \"大堂区\"},\n" +
            "      {\"key\": 820005, \"label\": \"风顺堂区\"},\n" +
            "      {\"key\": 820006, \"label\": \"嘉模堂区\"},\n" +
            "      {\"key\": 820007, \"label\": \"路凼填海区\"},\n" +
            "      {\"key\": 820008, \"label\": \"圣方济各堂区\"}\n" +
            "    ]\n" +
            "  }\n" +
            "}\n";


      static   JSONObject adcodeObject = JSONObject.parseObject(adcodeJson);


     public static GeographyPoint  getCodeInfo(String _adcode){
         int districtCode = Integer.parseInt(_adcode);
         int cityCode = districtCode - (districtCode % 100);
         int provinceCode = districtCode - (districtCode % 10000);
         String provinceLabel = "";

         JSONArray provinces  = adcodeObject.getJSONArray("province");

         for (int i = 0; i < provinces.size(); i++) {
              JSONObject p =  provinces.getJSONObject(i);
              if(p.getInteger("key").intValue() == provinceCode){
                  provinceLabel = p.getString("label");
                  break;
              }
         }

         JSONObject citysObject  = adcodeObject.getJSONObject("city");
         JSONArray  citys = citysObject.getJSONArray(provinceCode+"");

         String cityLabel = "";
         for (int i = 0; i < citys.size(); i++) {
             JSONObject p =  citys.getJSONObject(i);
             if(p.getInteger("key").intValue() == cityCode){
                 cityLabel = p.getString("label");
                 break;
             }
         }

         JSONObject districtObject  = adcodeObject.getJSONObject("district");
         JSONArray  districts = districtObject.getJSONArray(cityCode+"");

         String districtLabel = "";
         for (int i = 0; i < districts.size(); i++) {
             JSONObject p =  districts.getJSONObject(i);
             if(p.getInteger("key").intValue() == cityCode){
                 districtLabel = p.getString("label");
                 break;
             }
         }

         GeographyPoint ret = new GeographyPoint();
         ret.setProvince(provinceCode+"");
         ret.setProvinceName(provinceLabel);
         ret.setCity(cityCode+"");
         ret.setCityName(cityLabel);
         ret.setDistrict(districtCode+"");
         ret.setDistrictName(districtLabel);

         return ret;
     }
}
